-----------------------------------------------------------
-- [1] الإعدادات والبيانات
-----------------------------------------------------------
local config = {
    {
        name = "🌲 أشجـار وزهـور 🌸",
        items = {
{name = "شجرة أرز", Code = {1701996302,842100325,0,0,0,0}, Level = 0, isPointer = false},
{name = "شجرة تنوب", Code = {1701996302,808611429,0,0,0,0}, Level = 0, isPointer = false},
{name = "شجرة جزر", Code = {1851877492, 1768387435, 1735289206, 1918976863, 1416916850, 6645106}, Level = 23, isPointer = true},
{name = "نبات الوستريا", Code = {1634034206,1601795189,1953720695,1634300517,0,0}, Level = 0, isPointer = false},
{name = "شجرة الأرجواني", Code = {1634034208,1601795189,1734439521,1701732725,121,0}, Level = 0, isPointer = false},
{name = "الوردية", Code = {1634034214,1601795189,1685022834,1852138607,1852797540,0}, Level = 0, isPointer = false},
{name = "شجرة البونسيانا", Code = {1634034204,1601795189,1869374820,7891310,0,0}, Level = 0, isPointer = false},
{name = "السنط", Code = {1634034218,1601795189,1667326817,1734304105,1717662313,25958}, Level = 0, isPointer = false},
{name = "نخيل البلح", Code = {1634034210,1601795189,1768843622,1634754403,28012,0}, Level = 0, isPointer = false},
{name = "الصنوبر الياباني", Code = {1634034208,1601795189,1701734768,1701999711,101,0}, Level = 0, isPointer = false},
{name = "شجرة السكوية", Code = {1634034204,1601795189,1970365811,6383983,0,0}, Level = 0, isPointer = false},
{name = "شجرة شبكة العنكبوت", Code = {1667592275, 1114399081, 1953849701, 1884512121, 1919247465, 1701147220, 0, 0}, Level = 24, isPointer = true},
{name = "شجرة قابلة للنفخ", Code = {1634034212,1601795189,1701147252,1818321503,7237484,0}, Level = 0, isPointer = false},
{name = "أزهار برية", Code = {1701996302,808545893,0,0,0,0}, Level = 0, isPointer = false},
{name = "باقة بالونات", Code = {1634034218,1601795189,1869373794,1717530223,1702326124,29554}, Level = 0, isPointer = false},
{name = "مزهرية الأزهار", Code = {1634034212,1601795189,2003790950,1985966693,6648673,0}, Level = 0, isPointer = false},
{name = "عمود إنارة من الزهور", Code = {1634034218,1601795189,1953718629,1818194533,1702129249,28274}, Level = 0, isPointer = false},
{name = "شجرة البروكلي", Code = {1667592275,1114399081,1953849701,1918132089,1916953957,1868784495,1124100460}, Level = 26, isPointer = true},
{name = "مشتل الأزهار على شكل طاووس", Code = {1667592275, 1114399081, 1953849701, 1766023033, 1631877492, 1634754425, 1852402806, 0}, Level = 28, isPointer = true}, 
{name = "شجرة الحصاد", Code = {1667592275, 1114399081, 1953849701, 1634230137, 1936029298, 1768316788, 1701999975, 0}, Level = 28, isPointer = true},
{name = "شجرة المصباح", Code = {1667592275, 1114399081, 1953849701, 1749245817, 1600220777, 1751607660, 1701991540, 1049231461 }, Level = 29, isPointer = true},
{name = "شجرة عيد الفصح", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1935754591, 1416783220, 6645106}, Level = 31, isPointer = true},
{name = "تمثال النصر", Code = {1768649504, 2003780467, 2037149535, 1634300013, 668926052, 110}, Level = 0, isPointer = false},
{name = "نافورة شجرة الحياة", Code = {1970234906, 1767994478, 1920229230, 25957, 0, 0}, Level = 0, isPointer = false},
{name = "عمل مشبك الغسيل الفني", Code = {1852395544, 1819632467, 1920300144, 1701314661, 0, 0}, Level = 0, isPointer = false},
{name = "الشراع الذهبي", Code = {1634231064, 1869181037, 1969446766, 1601372272, 1953718640, 97}, Level = 0, isPointer = false},
{name = "المنتزه البري", Code = {1818851088, 1918988388, 1969422443, 1601372272, 1953718640, 97}, Level = 0, isPointer = false},
{name = "نافورة مشتل الأزهار 1", Code = {1869374996, 1651664247, 3236965, 1869768558, 2037540195, 0}, Level = 0, isPointer = false},
{name = "نافورة مشتل الأزهار 2", Code = {1869374996, 1651664247, 3302501, 1869768558, 2037540195, 0}, Level = 0, isPointer = false},
{name = "حديقة الأزهار", Code = {1918988306, 828322155, 822096248, 3307520, 875585381, 0}, Level = 0, isPointer = false},
{name = "ازدهار الكرز", Code = {1701991446, 1634951013, 1634891115, 3307520, 875585381, 0}, Level = 0, isPointer = false},
{name = "شجرة نخيل", Code = {1818325004, 3432813, 1634891115, 3307520, 875585381, 0}, Level = 0, isPointer = false},
{name = "معدات الشاطئ", Code = {1818325014, 1952407917, 1835365487, 3276800, 875585381, 0}, Level = 0, isPointer = false},
{name = "الباأوباب", Code = {1868653068,6447458,1953718627,25964, 0, 0}, Level = 0, isPointer = false},
{name = "لوحة الزهور", Code = {1818316832,1702130789,1819632467,1920300144,-414711707,111}, Level = 0, isPointer = false},
{name = "وردة القصة الخيالية", Code = {1869375006,1433560439,1919247470,1685024584,3670016,7566444}, Level = 0, isPointer = false},
{name = "زهور دوار الشمس", Code = {1853190930,2003790950,1694528101,845116274,0,0}, Level = 0, isPointer = false},
{name = "شجرة التفاح", Code = {1886413076,1952408940,6645106,7237475,-469733771,111}, Level = 0, isPointer = false},
{name = "ورود صفراء", Code = {1818589464,1601662828,1702063986,6619251,875585381,0}, Level = 0, isPointer = false},
{name = "الجربارة", Code = {1869375010,1651664247,1734304869,1700950629,1929404786,0}, Level = 0, isPointer = false},
{name = "السوسنيات", Code = {1869375014,1651664247,1734304869,1768186220,1937075311,0}, Level = 0, isPointer = false},
{name = "الخشخاش", Code = {1869375010,1651664247,1885299813,1768976495,1929409381,0}, Level = 0, isPointer = false},
{name = "القزحية", Code = {1869375008,1651664247,1767859301,1702062450,1936457843,0}, Level = 0, isPointer = false},
{name = "نرجسي", Code = {1869375014,1651664247,1683973221,1868981857,1936484708,0}, Level = 0, isPointer = false},
{name = "حقل الزهور", Code = {1869375000,1601332599,1734632808,101,872444782,0}, Level = 0, isPointer = false},
{name = "تشذيب القلعة", Code = {1886352412,2037539177,1935762271,6646900,0,0}, Level = 0, isPointer = false},
{name = "شجرة في طور الازدهار", Code = {1869375004,1769104759,1952409454,6645106,0,0}, Level = 0, isPointer = false},
{name = "شجرة السلة", Code = {1701999640, 1752391525, 1852403809, 103, 0, 0}, Level = 0, isPointer = false},
{name = "الصبار", Code = {1667326732, 7566708, 1701079404, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة السكر", Code = {1702318868, 1415541861, 6645106, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرتا أرز", Code = {1701996300, 3698277, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة مورقة 1", Code = {1701996302, 909209189, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة مورقة 2", Code = {1701996300, 3305061, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة مورقة 3", Code = {1701996302, 875654757, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة مورقة 4", Code = {1634562854, 1734306924, 1852138866, 1701999711, 875585381, 0}, Level = 0, isPointer = false},
{name = "شجرة التنوب 1", Code = {1701996302, 808611429, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة التنوب 2", Code = {1701996304, 1597337189, 50, 0, 0, 0}, Level = 0, isPointer = false},
{name = "حديقة الفضاء", Code = {1634759446, 1634166115, 1852138610, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة تزيين", Code = {1701996310, 1952411237, 828728690, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة زينة", Code = {1701996310, 1952411237, 845505906, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شجيرة زينة", Code = {1701996310, 1952411237, 862283122, 0, 0, 0}, Level = 0, isPointer = false},
{name = "أرنب المنتزه", Code = {1701996310, 1650421349, 2037280373, 0, 0, 0}, Level = 0, isPointer = false},
{name = "شرفة", Code = {1701996312, 1868721765, 1768316792, 7536750, 0, 0}, Level = 0, isPointer = false},
{name = "نبات الصفصاف المتهدل", Code = {1701148444, 1735289200, 1818851167, 7827308, 0, 0}, Level = 0, isPointer = false},
{name = "بيت الشجرة", Code = {1701999648, 1769430885, 1935632500, 1919508852, -352321421, 0}, Level = 0, isPointer = false},
{name = "شجرة الضوء", Code = {1768440602, 1702061422, 1918130510, 1862296933, 0, 0}, Level = 0, isPointer = false},
{name = "التشذيب على شكل طير", Code = {1701996308, 1650421349, 6582889, 0, 0, 0}, Level = 0, isPointer = false},
{name = "التشذيب على شكل دولفين", Code = {1701996314, 1683975781, 1752198255, 1946185321, 0, 0}, Level = 0, isPointer = false},
{name = "التشذيب على شكل طاووس", Code = {1701996314, 1885302373, 1868783973, 1946184547, 0, 0}, Level = 0, isPointer = false},
{name = "تشذيب على شكل سلحفاة", Code = {1701996312, 1952411237, 1819570805, 1946157157, 0, 0}, Level = 0, isPointer = false},
{name = "التشذيب ع شكل فيل", Code = {1701996316, 1700752997, 1752196460, 7630433, 0, 0}, Level = 0, isPointer = false},
{name = "نبات العدينة", Code = {1701999640, 1684103013, 1969843813, 1702494317, 0, 0}, Level = 0, isPointer = false},
{name = "شجرة ساقطة", Code = {1701344022, 1684370017, 1701147220, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال الزرافة", Code = {1919510286,1701208434,1868783872,1946184547,6648431,0}, Level = 0, isPointer = false},
{name = "تمثال الغوريلا", Code = {1919903502,1634495593,1744830464,7630433,6648431,0}, Level = 0, isPointer = false},
{name = "ورود حمراء", Code = {1936683538,1969381221,1845520499,25955,875585381,0}, Level = 0, isPointer = false},
{name = "خليج صغير ", Code = {1920234264,1601003877,1734632808,101,872444782,0}, Level = 0, isPointer = false},
{name = "تركيب الأعجوبة الطبيعية", Code = {1936615712,1819042164,1869182049,1918984046,1718157428,7536741}, Level = 0, isPointer = false},
{name = "شجرة توت", Code = {1919246878,1918138738,1801413989,1701210478,1701999872,0}, Level = 0, isPointer = false},
{name = "عربة الزهور", Code = {1667592275, 1114399081, 1953849701, 1633050489, 1953391980, 1600482921, 2003790950, 1633907301, 905999474}, Level = 34, isPointer = true},
{name = "قوس الأزهار", Code = {1667592275, 1114399081, 1953849701, 1766023033, 1631877492, 1918984057, 1868523619, 1818648422, 1919252335, 115}, Level = 37, isPointer = true},
{name = "مشتل الأزهار على شكل سيارة", Code = {1667592275, 1114399081, 1953849701, 1766023033, 1631877492, 1818648441, 1919252335, 1600415074, 7496035}, Level = 35, isPointer = true}

        }
    },
    {
        name = "🚧 سـيـاج وجسـور 🌉",
        items = {
 {name = "السياج الذهبي", Code = {2020961304,1601794677,1668179302,7536741,875585381,0}, Level = 0, isPointer = false},       	
{name = "فوانيس ورقية", Code = {1667592275,1114399081,1953849701,1749245817,1600220777,1953390956,7238245}, Level = 27, isPointer = true},
{name = "جسر الفاكهة", Code = {1667592275, 1114399081, 1953849701, 1917214585, 1114925429, 1734633842, 65637, 0}, Level = 25, isPointer = true},
{name = "سياج من بسكويت الزنجبيل", Code = {1851876118,1717533028,1701015141,1752392960,1929408623,29440 }, Level = 0, isPointer = false},
{name = "سيا﻿ج الزهور", Code = {1869375000,1601332599,1668179302,7536741,0,0}, Level = 0, isPointer = false},
{name = "سيا﻿﻿ج البحر", Code = {1634030364, 1668179270, 1701207909, 6644590, 1701015137, 0}, Level = 0, isPointer = false},
{name = "سياج شج﻿يرات", Code = {1684367370, 1627415911, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "سياج ديكوري", Code = {1634887450, 1702127982, 1852139103, 25955, 0, 0}, Level = 0, isPointer = false},
{name = ﻿﻿"سياج خشبي", Code = {1768453910, 1717527924, 1701015141, 0, 0, 0}, Level = 0, isPointer = false},
{name = "سياج شرقي", Code = {1768440602, 1702061422, 1852139103, 25955, 0, 0}, Level = 0, isPointer = false},
{name = "سياج عيد﻿ الفصح", Code = {1935754520,1601332596,1668179302,1852375141,-368251136,111}, Level = 0, isPointer = false},
{name = "بوابة الزهور", Code = {1634034214,1601795189,2003790918,1734308453,1936028769,0}, Level = 0, isPointer = false},
{name = "بوابات المجد", Code = {1634034214,1601795189,1970828620,1734310258,1936028769,0}, Level = 0, isPointer = false}
        }
    },
    {
        name = "🗿 تمـاثيـل ونـافـورات ⛲",
        items = {
{name = "مصمم الطائرات الأول", Code = {1635021594,1600484724,1652124774,1744861551,1702065519,0}, Level = 0, isPointer = false},
{name = "العالم الأول", Code = {1635021604,1600484724,1851876718,1953654116,7102824,0}, Level = 0, isPointer = false},
{name = "لاعب كرة القدم الأول", Code = {1635021602,1600484724,1953460070,1819042146,29285,0}, Level = 0, isPointer = false},
{name = "عالم الوراثة الأول", Code = {1635021602,1600484724,1701733735,1768122740,29811,0}, Level = 0, isPointer = false},
{name = "السائح الأول", Code = {1635021596,1600484724,1920298868,7631721,29811,0}, Level = 0, isPointer = false},
{name = "الكيميائي الأول", Code = {1635021596,1600484724,1835362403,7631721,29811,0}, Level = 0, isPointer = false},
{name = "المفكر الأول", Code = {1635021596,1600484724,1852401780,7497067,29811,0}, Level = 0, isPointer = false},
{name = "رجل إطفاء الحرائق الأول", Code = {1635021596,1600484724,1701996902,7233901,29811,0}, Level = 0, isPointer = false},
{name = "الكاتب الأول", Code = {1635021594,1600484724,1953067639,29285,29811,0}, Level = 0, isPointer = false},
{name = "الشرطي الأول", Code = {1635021600,1600484724,1768714096,1634559331,110,0}, Level = 0, isPointer = false},
{name = "الموسيقي الأول", Code = {1635021596,1600484724,1769174381,7233891,110,0}, Level = 0, isPointer = false},
{name = "الرسام الأول", Code = {1635021594,1600484724,1769239137,29811,110,0}, Level = 0, isPointer = false},
{name = "قاهر البحار", Code = {1635021600,1600484724,1952542562,1819240287,1701707876,114}, Level = 0, isPointer = false},
{name = "درج لا نهاية له", Code = {1635021594,1601401449,1668571501,1962947432,1862296947,110}, Level = 0, isPointer = false}, 
{name = "افضل تمثال صنعه عمدة", Code = {1919509036,1633970292,1852403321,1667581029,1952543343,7237481}, Level = 0, isPointer = false},
{name = "تمثال حامل الشعلة", Code = {1969317218,1952414068,1751347823,1918985570,1868526181,1886222700,6578537}, Level = 27, isPointer = true},
{name = "بركة بها إوز", Code = {1701601622, 1852404846, 1867538277, 2002740334, 1600681065, 1851881331, 1702232179, 0}, Level = 25, isPointer = true},
{name = "صائدة الأشباح", Code = {1667592275, 1114399081, 1953849701, 1749507961, 1651798895, 1702130549, 301138034, 0}, Level = 25, isPointer = true},
{name = "نافورة الأصدقاء", Code = {1667592275,1114399081,1953849701,1851875193,1818324329,2003792991,1124102757}, Level = 26, isPointer = true},
{name = "تمثال القرد", Code = {1667592275,1114399081,1953849701,1749245817,1600220777,1802399597,1711307109 }, Level = 26, isPointer = true},
{name = "تمثال عيد مدينة سعيد", Code = {1667592275, 1114399081, 1953849701, 1768054649, 1684567154, 1650424161, 1869376609, 110 }, Level = 29, isPointer = true},
{name = "الطاهي", Code = {1667592275, 1114399081, 1953849701, 1951620985, 1702196321, 1750361679, 1869562725, 1049231467 }, Level = 29, isPointer = true},
{name = "نافورة الغرام", Code = {1701601622, 1852404846, 1868980069, 1635020405, 1700753001, 1852990836, 1869376609, 25974 }, Level = 30, isPointer = true},
{name = "الربيع", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1919963999, 1197960809, 7107177 }, Level = 31, isPointer = true},
{name = "بركة سمك الشبوط", Code = {1852796956, 1769430884, 1667197044, 7369313, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال القائد", Code = {1852796178, 1852140917, 1845506420, 1701999711, 875585381, 0}, Level = 0, isPointer = false},
{name = "نافورة عصرية", Code = {1970234898, 1767994478, 1761620590, 1701970030, 875585381, 0}, Level = 0, isPointer = false},
{name = "تمثال الملك", Code = {1852796178, 1852140917, 13172, 1701970030, 875585381, 0}, Level = 0, isPointer = false},
{name = "المسلة الحجرية", Code = {1852796178, 1852140917, 1593848948, 3307569, 875585381, 0}, Level = 0, isPointer = false},
{name = "الكرة الحجرية", Code = {1852796178, 1852140917, 12916, 3307569, 875585381, 0}, Level = 0, isPointer = false},
{name = "نافورة كلاسيكية", Code = {1970234898, 1767994478, 822096238, 3307520, 875585381, 0}, Level = 0, isPointer = false},
{name = "تمثال الأسد", Code = {1869179912,1701183598,1868783872,1946184547,6648431,0}, Level = 0, isPointer = false},
{name = "تمثال البطريق", Code = {1852141582,1852405095,18﻿19570688,1946157157,6648431,0}, Level = 0, isPointer = false},
{name = "تمثال التمساح", Code = {1869767442,1768189795,1744856428,7630433,6648431,0}, Level = 0, isPointer = false},
{name = "تمثال الباندا", Code = {1851879434,1627414884,1744830464,7630433,6648431,0}, Level = 0, isPointer = false},
{name = "تماثيل الحد﻿﻿يقة", Code = {1869506316,7562605,1919247470,1685024584,3670016,0}, Level = 0, isPointer = false},
{name = "سيد الفاكهة", Co﻿de = {1852403222,1801412970,1701210478,1761638144,1852795252,7566336}, Level = 0, isPointer = false},
{﻿﻿﻿name = "القراصنة", Code = {1885430568,1852399﻿988,1952543827,1885300085,1952543337,101}, Level = 0, isPointer = false},
{name = "النافورة التفاعلية", Code = {1819239208,1866887791,1635020405,1834970729,175134﻿﻿﻿﻿﻿8321,51}, Level = 0, isPointer = false},
{name = "الثور الغاضب", Code = {1869767190,1600485998,1819047266,7237376,0,0}, Level = 0, isPointer = false},
{name = "دليل البحر", Code = {1818585130,1333028205,1886﻿352483,1633645429,1701405550,29806}, Level = 0, isPointer = false},
{name = "الثور الذهبي", Code = {1819632162,1635013484,1600484724,1852732786,1694528101,114}, Level = 0, isPointer = false},
{name = "النوافير الراقصة", Code = {1851876384,1735289187,1853189958,1852399988,6619251,0}, Level = 0, isPointer = false},
{name = "تمثال الحمار الوحشي", Code = {1650817546, 1627414898, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال فقمة الفراء", Code = {1634038536, 1627390060, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال الفلامينجو", Code = {1634493968, 1735289197, 1744830575, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال نمر البحر", Code = {1734964234, 1845523045, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال الكوالا", Code = {1634691850, 1677746540, 1752198255, 1946185321, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال البجعة", Code = {1635218184, 1683947630, 1752198255, 1946185321, 0, 0}, Level = 0, isPointer = false},
{name = "نافورة جنية مزهرة", Code = {1767982620, 1180662130, 1953396079, 7235937, 0, 0}, Level = 0, isPointer = false},
{name = "حارس الثروة", Code = {1634886696, 1601072999, 1952543859, 1398760821, 809000784, 48}, Level = 0, isPointer = false},
{name = "المصباح السحري", Code = {1634885918, 1600350562, 1601071466, 1886216556, 1667329024, 101}, Level = 0, isPointer = false},
{name = "تمثال الجعران", Code = {1633907480, 1600282994, 1887004517, 1634533492, 0, 0}, Level = 0, isPointer = false},
{name = "الخيول العربية", Code = {1634885926, 1600350562, 1936879464, 1953718117, 1702196321, 0}, Level = 0, isPointer = false},
{name = "الثلاثي الرائع", Code = {1769100296, 1631780975, 1937076082, 6646885, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال المخرج المشهور", Code = {1734955024, 1633907535, 1937047666, 0, 0, 0}, Level = 0, isPointer = false},
{name = "الصنبور السحري", Code = {1634878234, 1866884462, 1635020405, 1912630889, 0, 0}, Level = 0, isPointer = false},
{name = "الكلب الأصفر", Code = {1768440596, 1702061422, 6778692, 0, 0, 0}, Level = 0, isPointer = false},
{name = "رمز العام الجديد", Code = {1768440614, 1702061422, 1885296974, 1951623017, 1702196321, 0}, Level = 0, isPointer = false},
{name = "نافورة عيد الفصح", Code = {1935754526,1601332596,1853189990,1852399988,-368251136,111}, Level = 0, isPointer = false},
{name = "رامي القرص", Code = {1936286762,1416852835,2003792488,1633645157,1701405550,29806}, Level = 0, isPointer = false},
{name = "نافورة الأنغام", Code = {1919503384,1970226785,1767994478,1912602734,-368902043,111}, Level = 0, isPointer = false},
{name = "نافورة الحوت", Code = {1970234908,1767994478,1752653678,6646881,7566446,29806}, Level = 0, isPointer = false},
{name = "نافورة عصرية ", Code = {1970234898,1767994478,1761620590,1701970030,875585381,0}, Level = 0, isPointer = false},
{name = "نافورة الشهرة ", Code = {1970234906,1767994478,2004049774,28257,872444782,0}, Level = 0, isPointer = false},
{name = "نافورة الشلال", Code = {1970234898,1767994478,1946170478,6645106,875585381,0}, Level = 0, isPointer = false},
{name = "حارس اللفائف", Code = {1919512618,1399157857,1970561396,1920229221,1970495845,25970}, Level = 0, isPointer = false},
{name = "تمثال الشمس", Code = {1701860130,1818323299,1969317186,1398765940,28277,0}, Level = 0, isPointer = false},
{name = "تمثال موجة الثلج", Code = {2003791475, 1918988130, 1701335908, 1868525669, 1886222700, 6578537}, Level = 23, isPointer = true},
{name = "تمثال المحبين", Code = {1701601622, 1852404846, 1951620965, 1702196321, 1987005535, 7565925}, Level = 23, isPointer = true},
{name = "تمثال خبز الزنجبيل", Code = {1769105475, 1634563187, 1766285171, 1919248238, 1634038370, 1851870564, 0, 0}, Level = 24, isPointer = true},
{name = "تمثال الطاووس", Code = {1634034218,1601795189,1667327344,1600873327,1952543859,25973}, Level = 0, isPointer = false},
{name = "تمثال عائلة الدببة", Code = {1634034200,1717531506,1818848609,121,0,0}, Level = 0, isPointer = false},
{name = "تمثال وحيد القرن", Code = {1634034200,1601795189,1852401778,111,0,0}, Level = 0, isPointer = false},
{name = "تمثال الدب القطبي", Code = {1634034210,1601795189,1634496368,1700945778,29281,0}, Level = 0, isPointer = false},
{name = "تمثال قديم", Code = {1634034216,1601795189,1735292266,1952408940,1835365487,115}, Level = 0, isPointer = false},
{name = "تمثال بوسيدون", Code = {1634034206,1601795189,1702063984,1852793961,0,0}, Level = 0, isPointer = false},
{name = "تمثال الثروات البحرية", Code = {1634034220,1601795189,1634497633,1936290926,1635021663,6649204}, Level = 0, isPointer = false},
{name = "تمثال جليدي لحيوان الرنة", Code = {1634034204,1601795189,1147495273,7497061,0,0}, Level = 0, isPointer = false},
{name = "أمير على حصان أبيض", Code = {1701601622, 1852404846, 1953718117, 1702196321, 1769107551, 6644590}, Level = 23, isPointer = true},
{name = "بطل العالم", Code = {1634034212,1601795189,1953460038,1819042146,6778692,0}, Level = 0, isPointer = false},
{name = "عمد Wild West", Code = {1667592275, 1114399081, 1953849701, 1866686329, 1852796269, 1818322295, 1951623284, 1702196321}, Level = 32, isPointer = true},
{name = "الجبابرة", Code = {1634034202,1601795189,1635019124,29550,0,0}, Level = 0, isPointer = false},
{name = "نافورة الفيلم", Code = {1634034216,1601795189,1769369421,1970226789,1767994478,110}, Level = 0, isPointer = false},
{name = "فنان شارع", Code = {2003780370,1769239105,29811,0,872694720,124}, Level = 0, isPointer = false},
{name = "نافورة الشوكولاتة", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1869103967, 1634496355, 1866884468, 905997941}, Level = 34, isPointer = true},
{name = "نافورة حفل الشاي", Code = {1667592275, 1114399081, 1953849701, 1868980089, 1635020405, 1918856809, 1869902693, 1851880053, 838886772}, Level = 34, isPointer = true},
{name = "نافورة الرقم القياسي الجديد", Code = {1634034220,1601795189,1836674127,1180920176,1953396079,7235937}, Level = 0, isPointer = false}
        }
    },
    {
        name = "🎃 زينـة الهالويـن والرعـب 👻",
        items = {
{name = "مصباح الأشباح", Code = {1667592275,1114399081,1953849701,1632395129,1919251566,1869105006,1845523571}, Level = 26, isPointer = true},
{name = "عربة الم﻿طاردة", Code = {1667592275,1114399081,﻿1953849701,1867014009,1919906418,1936879432,1694528357}, Level = 26, isPointer = true},
{name = "عجلة قرع العسل", Code = {1667592275,1114399081,1953849701,1968201593,1768648813,1701336942,1241541﻿7﻿33}, Level = 26, isPointer = true},
{name = "قبو مخيف", Code = {1969317218, 1751087476, 1869376609, 1852138871, 1633907551, 1667201394, 195﻿3528178, 0}, Level = 28, isPointer = true},
{name = "عربة الأشباح", Code = {1869113118,2037150835,1920098627,1701273961,7471104,111}, Level = 0, isPointer = false},
{name = "بقعة خضر رائعة", Code = {1869104918,1632072819,1852138610,1633645312,1701405550,29806}, Level = 0, isPointer = false},
{name = "غرفة الرعب ", Code = {1818322976,1702326124,1834970725,1969582965,1238237293,114}, Level = 0, isPointer = false},
{name = "ساحرة مع جرعة ", Code = {1818322974,1702326124,2002742885,1751348329,6646784,97}, Level = 0, isPointer = false},
{name = "رجل اليقطين", Code = {1818322972,1702326124,1885302373,7368053,6646784,97}, Level = 0, isPointer = false},
{name = "القطة السوداء", Code = {1818322970,1702326124,1667198565,29793,6646784,97}, Level = 0, isPointer = false},
{name = "شجرة مع ثمار يقطين", Code = {1818322972,1702326124,1952411237,6645106,6646784,97}, Level = 0, isPointer = false},
{name = "زينة عاديه", Code = {1818322984,1702326124,1734307429,1953722216,1768452959,112}, Level = 0, isPointer = false},
{name = "السفينة الشبح", Code = {1818322984,1702326124,2002742885,1751348329,1919510623,101}, Level = 0, isPointer = false},
{name = "متنزه الساحرات", Code = {1818322980,1702326124,1717530213,1953396079,7235937,29557}, Level = 0, isPointer = false},
{name = "نافورة مشؤومة", Code = {1818322976,1702326124,1667198565,1819571041,6619237,97}, Level = 0, isPointer = false},
{name = "المزراب", Code = {1818322980,1702326124,1734307429,1869050465,6646905,97}, Level = 0, isPointer = false},
{name = "فزاعة من اليقطين", Code = {1818322982,1702326124,1935634021,1701994851,2003792483,0}, Level = 0, isPointer = false},
{name = " طريق سري", Code = {1836404762,1852402544,1952795999,1828745074,0,0}, Level = 0, isPointer = false},
{name = "معصرة العنب", Code = {1634879254, 1348429168, 1936942450, 0, 0, 0}, Level = 0, isPointer = false},
{name = "متجر الساحرة", Code = {1634488340, 1398762350, 7368552, 0, 0, 0}, Level = 0, isPointer = false},
{name = "فارس برأس قرع عسل", Code = {1634027554, 1936026724, 1867014003, 1835365234, 1912630881, 0},﻿ ﻿Level = 0, isPointer = false},
{name = "البيت الزجاجي لآكل اللحوم", Code = {1701988134, 1869114981, 1600484213, 1684370000, 1919906913, 0}, Level = 0, isPointer = false},
{name = "عرض المستذئب", Code = {1634488348, 1465871214, 2003137125, 6712431, 0, 0}, Level = 0, isPointer = false},
{name = "بيت الرعب", Code = {1634231074, 1919246957, 1818323039, 170232﻿6124, 28261, 0}, Level = 0, isPointer = false},
{name = "البرج المرعب", Code = {1953449752,1600350568,1702326100,1835335794,1912630881,0}, Level = 0, isPointer = false},
{name = "مرجل سحري ", Code = {1953060624,1867540579,1852113012,1633645312,1701405550,29806}, Level = 0, isPointer = false},
{name = "دورة ركوب المكنسة ", Code = {1953060650,1951623267,1702196321,1818323039,1702326124,28261}, Level = 0, isPointer = false},
{name = "المنزل الملعون", Code = {1819042152, 1701148527, 1634230126, 1702129269, 1869111140, 6648693}, Level = 23, isPointer = true},
{name = "أوركسترا مذهلة", Code = {1969317218, 1751087476, 1869376609, 1852138871, 1701540703, 1869899116, 1919901550, 1936025699, 6386292}, Level = 35, isPointer = true}
        }
    },
    {
        name = "❄️ زينـة ثلجيـة وكريسـماس 🎄",
        items = {
{name = "الرقم السحري2022", Code = {2003127824,1634031967,1912602738,7173481,1912602725,0}, Level = 0, isPointer = false},        	
{name = "الكرة الثلجية 2", Code = {2003127832,1918985593,1651469383,101,872605664,124}, Level = 0, isPointer = false},        	
{name = "مدفع الثلج", Code = {2037141286,1667854445,1869501279,1667329399,1701734760,0}, Level = 0, isPointer = false},        	
{name = "متجر هدايا الأعياد", Code = {808465457, 1919435615, 1836348265, 1147106145, 1919902565, 1869182049, 110, 0}, Level = 25, isPointer = true},
{name = "منزل هاسكي", Code = {1853189965, 1852399988, 1818323011, 1214215269, 2037085045, 1937076040, 1868955749, 0}, Level = 25, isPointer = tru﻿e},
 {name = "السيد بسكويت الزنجبيل", Code = {1735289159,1919054437,1298424165,1867017825,1869103988,1634496355,25972}, Level =﻿ 26, isPointer = true},
{name = "كوخ الأعياد", Code = {1852405542,1500669300,1601466997,1935764856,84214﻿﻿9938,3289600},﻿ Level = 0, isPointer = false},
{name = "مطعم وجبات خفيفة", Code = {1869576724,1952539999,7959141,111,878968932,0}, Level = 0, isPointer = false},
{name = "مساعدو سانتا", Code = {1851872022,1817403764,1751607653,1851875840,1701999711,101}, Level = 0, isPointer = false},
{name = "معركة الثلج", Code = {1869509406,1734952567,1885303912,1802396012,0,0}, Level = 0, isPointer = false},
{name = "مكتب سانتا ", Code = {1851872030,1381982580,1885692773,1852795252,1912602624,0}, Level = 0, isPointer = false},
{name = "حلبة تزلج السناجب", Code = {1734960684, 1399157365, 1769234795, 2019518318, 846422381, 3289648}, Level = 0, isPointer = false},
{name = "منزل بسكويت الزنجبيل", Code = {1852393240,1601332583,1937076040,7143525,1912602725,0}, Level = 0, isPointer = false},
{name = "زلاقة النعجات", Code = {1701335828, 1817407589, 6644841, 0, 0, 0}, Level = 0, isPointer = false},
{name = "معدات الرياضيات الشتوية", Code = {1768641296, 1869108063, 1130299504, 6645345, 0, 0}, Level = 0, isPointer = false},
{name = "سوق شجرة العيد", Code = {1701991446, 1632460645, 1952803698, 0, 0, 0}, Level = 0, isPointer = false},
{name = "كوخ رجل الثلج", Code = {1634289434, 1398764654, 1836543854, 1845522017, 0, 0}, Level = 0, isPointer = false},
{name = "مساعد سانتا", Code = {1701335838, 1816490085, 1970429798, 1919250030, 0, 0}, Level = 0, isPointer = false},
{name = "تماثيل جليدية", Code = {1701005608, 1768454213, 1769236834, 1918856815, 1701736053, 114}, Level = 0, isPointer = false},
{name = "متحف الجليد", Code = {1701013798, 1819632467, 1920300144, 1885303653, 1802396012, 0}, Level = 0, isPointer = false},
{name = "روديو حيوانات الرنة", Code = {1701143584, 1684623986, 1600613993, 1851878512, 1701249131, 29554}, Level = 0, isPointer = false},
{name = "كشك سوق الأعياد", Code = {1769304344, 1600877423, 1851878512, 1718747243, 0, 0}, Level = 0, isPointer = false},
{name = "تنين الجليد", Code = {1701013778, 1734439492, 1224765039, 0, 0, 0}, Level = 0, isPointer = false},
{name = "منحدر القلعة الجليدية", Code = {1768715032, 1834968420, 1751348321, 1751318579, 0, 0}, Level = 0, isPointer = false},
{name = "بحيرة متجمدة", Code = {1701013774, 1701536076, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "الينابيع الساخنة 1", Code = {1953450008,1970226783,1767994478,7143534,1912602725,0}, Level = 0, isPointer = false},
{name = "ورشة سانتا", Code = {1987003156,1197437541,7628393,1852795252,1912602624,0}, Level = 0, isPointer = false},
{name = "منزل سانتا ", Code = {1919435562,1836348265,1398764385,1635020385,1970227295,25971}, Level = 0, isPointer = false},
{name = "منزل مساعد سانتا ", Code = {1919443756,1836348265,1935635297,1635020385,1818585183,7497072}, Level = 0, isPointer = false},
{name = "ملك  الثلج", Code = {1919435550,1836348265,1633645409,1818584942,7105536,111}, Level = 0, isPointer = false},
{name = "شجرة احتفالية", Code = {1919443756,1836348265,1918137185,2019517797,846422381,3289648}, Level = 0, isPointer = false},
{name = "الكرة الثلجية", Code = {1919443748,1836348265,1935635297,1651994478,7105633,111}, Level = 0, isPointer = false},
{name = "ليلة رأس السنة", Code = {1935764508,1970227316,1819303794,7040609,1970495845,25970}, Level = 0, isPointer = false},
﻿{name = "﻿حادث ف﻿ي الورشة",﻿ Code = {1﻿919907610﻿,186911626﻿7,163487832﻿0,1912629363,170﻿1735936,114}, Level = 0, isPointer = false},
{name = "الكرلنج", Code = {1920295708,1735289196,1853190751,7497070,1761607800,26478}, Level = 0, isPointer = false},
{name = "موسم الأعياد", Code = {1919443742,1836348265,1866691425,1735289197,1761607680,26478}, Level = 0, isPointer = false},
{name = "مزلقة سانتا التربو", Code = {1920300066,1819504482,1701274725,1851880287,1761632628,26478}, Level = 0, isPointer = false},
{name = "القلعة الثلجية 1", Code = {1769105475, 1634563187, 1850957683, 1717532527, 1920234095, 7566181}, Level = 23, isPointer = true},
{name = "رنة سانتا", Code = {1769105475, 1634563187, 1632853875, 1935766638, 1768247903, 6644846}, Level = 23, isPointer = true},
{name = "أنشطة شتوية", Code = {1735288176, 1231972725, 1869112675, 2019517804, 846422381, 3289648}, Level = 23, isPointer = true},
{name = "ساحة الكريسماس", Code = {1769105507, 1634563187, 1634488435, 2019517795, 846422381, 3289648}, Level = 23, isPointer = true},
{name = "شاليه مريح", Code = {1853189965, 1852399988, 1818323011, 1130329189, 1215920751, 1702065519, 0, 0}, Level = 24, isPointer = true},
{name = "القلعة الثلجية 2", Code = {1634034214,1601795189,2003791475,1953656678,1936942450,0}, Level = 0, isPointer = false},
{name = "زلاجة الثلج", Code = {1634034208,1601795189,2003791475,1684630643,101,0}, Level = 0, isPointer = false},
{name = "النهر الجليدي في القطب الشمالي", Code = {1634034204,1601795189,1650811753,6779493,0,0}, Level = 0, isPointer = false},
{name = "القلعة الجليدية", Code = {1634034210,1601795189,1600480105,1953718627,25964,0}, Level = 0, isPointer = false},
{name = "مصعد التزلج", Code = {1634034220,1601795189,1852732786,1667199589,1701601889,7496035}, Level = 0, isPointer = false},
{name = "متعة الشتاء", Code = {1634034216,1601795189,1953393015,1667199589,1869508193,110}, Level = 0, isPointer = false},
{name = "حلبة تزلج البطاريق", Code = {1634034220,1601795189,1952541555,1348955753,1969712741,7564905}, Level = 0, isPointer = false},
{name = "زلاجة كلاب", Code = {1634034212,1601795189,1936158564,1668440415,6515060,0}, Level = 0, isPointer = false},
{name = "محطة قطبية", Code = {1634034214,1601795189,1634496368,1635013490,1852795252,0}, Level = 0, isPointer = false},
{name = "منزل البحيرة", Code = {1634034210,1601795189,1701536108,1970235487,25971,0}, Level = 0, isPointer = false},
{name = "صورة مع سانتا", Code = {1634034212,1601795189,1953390963,1819303777,7040609,0}, Level = 0, isPointer = false},
{name = "حلبة تزلج على الجليد", Code = {1634034218,1601795189,2003791475,1601069421,1952541555,29285}, Level = 0, isPointer = false},
{name = "منزل الأقزام", Code = {1634034208,1601795189,1600547941,1937076072,101,0}, Level = 0, isPointer = false}

        }
    },
    {
        name = "🏛️ زينـات و معالـم أثريـة 🏺",
        items = {
{name = "التقويم القديم", Code = {2036428058,1633902433,1684956524,1593864801,1735292266,25964}, Level = 0, isPointer = false},
{name = "برج بيزا المائل", Code = {2053196304,1970029434,1767964770,1912602734,872677477,124}, Level = 0, isPointer = false},       	
{name = "تمثال الفرعون", Code = {2036811044,1750103152,1868657249,1635013480,6649204,6357102}, Level = 0, isPointer = false},
{name = "هرم خوفو", Code = {2036811032,2035315824,1768776050,1929379940,7368552,6357102}, Level = 0, isPointer = false},        	
{name = "برج خليفة", Code = {1634034216,1601795189,1685222754,1751083130,1718185057,97}, Level = 0, isPointer = false},
{name = "معبد تايلاندي", Code = {1634034212,1601795189,1767991412,1835365471,6646896,0}, Level = 0, isPointer = false},
{name = "مقدمة سفينة القرصان", Code = {1634034220,1601795189,1634888048,1935631732,1601202536,7827298}, Level = 0, isPointer = false},
{name = "صندوق كنز", Code = {1634034218,1601795189,1634038388,1701999987,1701339999,29811}, Level = 0, isPointer = false},
{name = "أطلال أتلانتس", Code = {1634034218,1601795189,1634497633,1936290926,1769304671,29550}, Level = 0, isPointer = false},
{name = "المدينة المفقودة", Code = {1634034214,1601795189,1735292266,1918854508,1936615797,0}, Level = 0, isPointer = false},
{name = "المنزل الصيني", Code = {1667592275, 1114399081, 1953849701, 1749245817, 1600220777, 1937076072, 1132658789, 0}, Level = 25, isPointer = tr﻿ue},
{name =" وعاء الثروة", Code = {1667592275, 1114399081, 1953849701, 1702322041, 1752460385, 2003788383, 1170145388, 0}, Level = 25, isPointer = true},
{name = "عرش صاحب الجلالة", Code = {1667592275, 1114399081, 1953849701, 1766547321, 1416849262, 1852797544, 101, 0}, Level = 25, isPointer = true},
{name = "أبو الهول", Code = {1752199954, 1601728105, 1929392502, 101, 0, 0}, Level = 0, isPointer = false},
{name = "بناء ناطحة سحاب", Code = {1886217502, 160﻿﻿0483945, 1952543859, 829841253, 0, 0}, Level = 0, isPointer = false},
{name = "الهرم", Code = {1920561168, 1684630881, 1946157157, 829841253, 0, 0}, Level = 0, isPointer =﻿ false},
{name = "معبد الفردوس", Code = {1818316834,1600480097,1952409199,1935631720,-419399317,111 }, Level = 0, isPointer = false},
{name = "قوس النصر", Code = {1852796178,1852140917,1694512500,3241567,-416496384,111}, Level = 0, isPointer = false},
{name = "قصر الشيخ", Code = {1634885928, 1600350562, 1633643617, 1885302377, 1667329121, 101}, Level = 0, isPointer = false},
{name = "فوهة بركان", Code = {1634886412, 7497076, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "دار أوبرا سيدني", Code = {1685680920, 1601791342, 1919250543, 1929379937, 0, 0}, Level = 0, isPointer = false},
{name = "برج إيفل", Code = {1718183190, 1952410725, 1919252335, 0, 0, 0}, Level = 0, isPointer = f﻿alse},
{name = "ساعة بيج بن", Code = {1734959630, 1851875935, 1702125824, 829841152, 0, 0}, Level = 0, isPointer = false},
{name = "تاج محل", Code = {1784771606, 1634230637, 829841260, 0, 0, 0}, Level = 0, isPointer = false},
{name = "تمثال الحرية", Code = {1701996052, 1836016741, 3241567, 0, 0, 0}, Level = 0, isPointer = false},
{name = "كاتدرائية نوتردام في باريس", Code = {1953451540,1147102578,6647137,1929379937,-369067669,111}, Level = 0, isPointer = false},
{name = "كاتدرائية القديس ب﻿آس﻿يل", Code = {1935753748,1130327145,6845537,29696,-368923392,111}, Level = 0, isPointer = false},
{name = "تيرانوسورس", Code = {1667592275, 1114399081, 1953849701, 1766088569, 1852401511, 2035572583, 1852727666, 1969320815, 7566706}, Level = 35, isPointer = true},
{name = " بتروناس", Code = {1952804880,1634627442,1694498931,3241567,-368923392,111}, Level = 0, isPointer = false}


        }
    },
    {
        name = "✈️ زينـات طـائرة فـ الجـو 🎈",
        items = {
{name = "كيوبيد عين النسر", Code = {2037147170,1701601622,1852404846,1886733157,1946182761,30464}, Level = 0, isPointer = false},
{name = "قلوب طائرة", Code = {2037147176,1701601622,1852404846,1818313317,1852796780,6815859}, Level = 0, isPointer = false},
{name = "تنين قابل للنفخ", Code = {2037147154,1734439492,1694527087,0,1241012352,114}, Level = 0, isPointer = false},
{name = "نحلة قابلة للنفخ ", Code = {2037147148,6645058,1701052513,0,1241012352,114}, Level = 0, isPointer = false},
{name = "باندا قابلة للنفخ ", Code = {2037147152,1684955472,1701052513,0,1241012352,114}, Level = 0, isPointer = false},
{name = "السفينة الطائرة  ", Code = {2037147174,1399287401,1601202536,1634038388,1701999987,29440}, Level = 0, isPointer = false},
{name = "مصابيح عائمة ", Code = {2037147168,1953390924,1601073765,1953390963,1761607777,26478}, Level = 0, isPointer = false},
{name = "ببغاء قابل للنفخ", Code = {1667592275, 1114399081, 1953849701, 1818648441, 1918980217, 7630706}, Level = 23, isPointer = true},
{name = "سلفحاة قابلة للنفخ", Code = {1667592275, 1114399081, 1953849701, 1818648441, 1920291961, 6646900}, Level = 23, isPointer = true},
{name = "أخطبوط قابل للنفخ", Code = {1667592275, 1114399081, 1953849701, 1818648441, 1952665465, 1937076335, 0, 0}, Level = 24, isPointer = true},
{name = "بطريق قابل للنفخ", Code = {1667592275, 1114399081, 1953849701, 1818648441, 1852133497, 1852405095, 0, 0}, Level = 24, isPointer = true},
{name = "دجاجة قابلة للنفخ", Code = {1667592275, 1114399081, 1953849701, 1818648441, 1768440697, 1852140387, 0, 0}, Level = 24, isPointer = true},
{name = "خنزير قابل للنفخ", Code = {1701860136,1818323299,1969317186,1717533044,1766881644,103}, Level = 0, isPointer = false},
{name = "خروف قابل للنفخ", Code = {1701860140,1818323299,1969317186,1717533044,1750301036,7365989}, Level = 0, isPointer = false},
{name = "بقرة قابلة للنفخ", Code = {1701860136,1818323299,1969317186,1717533044,1866692972,119}, Level = 0, isPointer = false},
{name = "فيل قابل للنفخ", Code = {1701860138,1818323299,1969317186,1717533044,1816492396,28773}, Level = 0, isPointer = false},
{name = "سمكة قابلة للنفخ", Code = {1634034212,1601795189,1752394086,1818321503,7237484,0}, Level = 0, isPointer = false},
{name = "فراشة قابلة لنفخ", Code = {1667592275,1114399081,1953849701,1818648441,1953841785,1718773108,﻿31084}, Level = 26, isPointer = true},
{name = "الحوت المطاطي", Code = {1701860140,1818323299,1969317186,1717533044,1750563180,6646881}, Level = 0, isPointer = false},
{name = "بالون البطة", Code = {1701860138,1818323299,1969317186,1717533044,1967421804,27491}, Level = 0, isPointer = false},
{name = "طائرة مطاطية", Code = {1701860140,1818323299,1969317186,1717533044,1817213292,6647393}, Level = 0, isPointer = false},
{name = "رقم 3 قابل للنفخ", Code = {1634034206,1601795189,1633836851,1852796012,0,0}, Level = 0, isPointer = false},
{name = "منزل طائر", Code = {1634034206,1601795189,1215917158,1702065519,0,0}, Level = 0, isPointer = false},
{name = "كلب قابل للنفخ", Code = {1634034210,1601795189,1600614244,1819042146,28271,0}, Level = 0, isPointer = false},
{name = "دمية راقصة بالهواء", Code = {1634034218,1601795189,1819042146,1601073007,1668178276,29285}, Level = 0, isPointer = false},
{name = "قنديل البحر المطاطي", Code = {1634034208,1601795189,1299803238,1937073253,97,0}, Level = 0, isPointer = false},
{name = "قوس البالون", Code = {1634034214,1601795189,1751347809,1818321503,1852796780,0}, Level = 0, isPointer = false},
{name = "منطاد هواء القبعة", Code = {1667592275,1114399081,1953849701,1751342969,1650419301,1869376609,28271}, Level = 26﻿, isPointer = true},
{name = "بيتسي رائدة الفضاء", Code = {1969317218,1935636852,1701011824,1936679775,1634627437,1667200117,30575 }, Level = 26, is﻿Pointer = true},
{name = "منطاد", Code = {1919508760, 1885956211, 1935762015, 101, 0, 0}, Level = 0,﻿ isPointer = false},
{name = "منطاد على هيئة خنزير", Code = {1919509536,1634035561,1936026722,1970561396,1701707877,114}, Level = 0, isPointer = false}

        }
    },
    {
        name = "💧 زينـات مـائيـة 🌊",
        items = {
{name = "مركب ورق البردي", Code = {2036811040,1632662640,1970436464,1634681459,6619252,6357102}, Level = 0, isPointer = false},        	
{name = "حورية البحر", Code = {1701860138,1818323299,1969317186,1834973556,1634562661,25705}, Level = 0, isPointer = false},
{name = "الزنبق المائي الأحمر", Code = {1952544542,1717531237,1702326124,828339058,-419430400,111}, Level = 0, isPointer = false},
{name = "زهرة زنبق مائية وردية", Code = {1952544542,1717531237,1702326124,845116274,-419430400,111}, Level = 0, isPointer = false},
{name = "الطوف", Code = {1952541458,1918987617,1811967585,7602297,6648431,0}, Level = 0, isPointer = false},
{name = "قارب هوائي ", Code = {1919508762,1952542562,1634496607,1593863022,1735292266,25964}, Level = 0, isPointer = false},
{name = "البرج المغمور", Code = {1667592275,1114399081,1953849701,1818648441,1701080943,1869897572,7497079}, Level = 27, isPointer = true},
{name = "حانة القراصنة", Code = {1667592275,1114399081,1953849701,1766875001,1702125938,1702256980,28274}, Level = 26, isPointer = true},
{name = "سفينة أوديسيوس", Code = {1969317218,1935636852,1433430376,1936947564,1633645413,1701405550,1946186862}, Level = 26, isPointer = true},
{name = "طائرة برمائية", Code = {1667592275, 1114399081, 1953849701, 1819303801, 1097166433, 1768452205, 1851877730, 0}, Level = 28, isPointer = true}, 
{name = "لعبة جهاز الطيران", Code = {1667592275, 1114399081, 1953849701, 1900109689, 1769234805, 1952795235, 1801675120, 0}, Level﻿﻿ = ﻿28, isPointer = true},
{name = "يخت عالق", Code = {1667592275, 1114399081, 1953849701, 1816223609, 1920229730, 1332966255, 1634681454, 1049231476 }, Level = 29, isPointer = true},
{name = "منزل الصياد", Code = {1667592275, 1114399081, 1953849701, 1768316793, 1919248499, 1936613741, 1970235487, 25971 }, Level = 30, isPointer = true},
{name = "عطلة", Code = {1819502872, 1600417377, 1718185579, 101, 0, 0}, Level = 0, isPointer = false},
{name = "جسر خشبي", Code = {1769103896, 811951972, 1768316721, 1701970030, 875585381, 0}, Level = 0, isPointer = false},
{name = "مرسى", Code = {1635086608, 1768316793, 1593835630, 3307569, 875585381, 0}﻿, Level = 0, isPointer = false},
{name = "جسر حجري", Code = {1769103896, 811951972, 1768316720, 3276910, 875585381, 0}, Level = 0, isPoi﻿n﻿ter = false},
{name = "يخت", Code = {1667332370, 1717531752, 1946185321, 829841253, 0, 0}, Level = 0, isPointer = false},
{name = "جسر البوابة الذهبية", Code = {1819240214,1601070436,1702125927,829841152,0,0}, Level = 0, isPointer = false},
{name = "سحر السينما", Code = {1818846758,1801547117,1600613993,1634038388,1701999987,0}, Level = 0, isPointer = false},﻿
{name = "الفوانيس الطافية", Code = {1869375010,1852404833,1634492263,1919251566,872444782,0}, Level = 0, isPointer = false},
{name = "جسر فينيسي", Code = {1634292250, 1601139820, 1684632130, 25959, 0, 0}, Level = 0, isPointer = false},
{name = "مخيم عائم", Code = {1767985960, 1735289196, 1952866642, 1701999711, 1920299873, 101}, Level = 0, isPointer = false},
{name = "الجسر الزجاجي", Code = {1634486038, 1916957555, 1701274729, 0, 0, 0}, Level = 0, isPointer = false},
{name = "المدينة الغارقة", Code = {1668440360, 1868915048, 2036821868, 18﻿19566431, 1769238113, 115}, Level = 0, isPointer = false},
{name = "يخت متعة", Code = {1667332362, 1862300776, 0, 0, 0, 0},﻿ Leve﻿l = ﻿0, is﻿Poin﻿ter ﻿= false},
{name = "المحطة البحرية", Code = {1634038558, 1952543827, 1601073001, 1702259044, 0, 0}, Level = 0, isPointer = false},
{name = "بوابات البحر", Code = {1634038544, 1952540511, 1702101093, 0, 0, 0}, Level = ﻿0, isPointer = false},
{name = "قارب", Code = {1634689556, 1597124724, 7235942, 0, 0, 0}, Level = 0, isPointer = false},
{name = "الفندق الشراعي", Code = {1767994130, 1953450092, 1761635429, 0, 0, 0}, Level = 0, isPointer = false},
{name = "قارب صيد", Code = {1768452872, 1635057776, 1751082098, 29813, 0, 0}, Level = 0, isPointer = false},
{name = "الشعب المرجانية", Code = {1701147156, 1701338982, 6645604, 0, 0, 0}, Level = 0, isPointer = false},
{name = "جنية الماء", Code = {1767990806, 2002745714, 1919251553, 0, 0, 0}, Level = 0, isPointer = false},
{name = "البوابة الجليدية", Code = {1701013788, 1751347777, 1668440415, 6515060, 0, 0}, Level = 0, isPointer = false},
{name = "فيلا مائية", Code = {1952536352,1967288933,1818322798,1347647343,3670073,7566444}, Level = 0, isPointer = false},
{name = "الجسر الأحمر", Code = {1667592275, 1114399081, 1953849701, 1701994361, 1769095780, 6645604}, Level = 23, isPointer = true},
{name = "طاحونة مائية", Code = {1667592275, 1114399081, 1953849701, 1633116025, 1299342708, 7105641}, Level = 23, isPointer = true},
{name = "معبد الأعماق", Code = {1667592275, 1114399081, 1953849701, 1968332665, 1148415593, 6649449}, Level = 23, isPointer = true},
{name = "سيف ف الحجر", Code = {1667592275, 1114399081, 1953849701, 2017812345, 1768710499, 7501154}, Level = 23, isPointer = true},
{name = "قرية الغابة", Code = {1969317218, 1784641908, 1818717813, 1769103205, 1752327542, 1702065519, 0, 0}, Level = 24, isPointer = true},
{name = "السفينة القديمة", Code = {1634034206,1601795189,1818845555,1952542562,0,0}, Level = 0, isPointer = false},
{name = "قارب المتعة", Code = {1634034212,1601795189,1734439524,1650421359,7627119,0}, Level = 0, isPointer = false},
{name = "قارب الجندول", Code = {1634034204,1601795189,1684959079,6384751,0,0}, Level = 0, isPointer = false},
{name = "زلاقة مائية", Code = {1634034210,1601795189,1702125943,1768706930,25956,0}, Level = 0, isPointer = false},
{name = "زلاجة", Code = {1634034210,1601795189,1702125943,1634886514,29798,0}, Level = 0, isPointer = false},
{name = "سوق رصيف الصيد", Code = {1634034212,1601795189,1752394086,1918987615,7628139,0}, Level = 0, isPointer = false},
{name = "حديقة مرجانية", Code = {1634034214,1601795189,1634889571,1634164588,1852138610,0}, Level = 0, isPointer = false},
{name = "زيارة الدلافين", Code = {1634034206,1601795189,1886154596,1936615784,0,0}, Level = 0, isPointer = false},
{name = "الغواصة", Code = {1634034208,1601795189,1835169139,1852404321,101,0}, Level = 0, isPointer = false},
{name = "مستكشفو أعماق البحار", Code = {1634034220,1601795189,1600218483,1702061426,1751347809,7565925}, Level = 0, isPointer = false},
{name = "جسر الحلوى", Code = {1634034214,1601795189,1684955491,1919049593,1701274729,0}, Level = 0, isPointer = false},
{name = "حديقة مائية قطبية", Code = {1634034220,1601795189,1650811753,1600615013,1735288176,7235957}, Level = 0, isPointer = false},
{name = "الغواصون", Code = {1634034212,1601795189,1702259044,1650422642,7627119,0}, Level = 0, isPointer = false},
{name = "فندق في أطلانتس", Code = {1634034218,1601795189,1634497633,1936290926,1953458271,27749}, Level = 0, isPointer = false},
{name = "رمح ثلاثي أطلنطي", Code = {1634034210,1601795189,1634497633,1634230131,25710,0}, Level = 0, isPointer = false},
{name = "كسارة الثلج", Code = {1634034210,1601795189,1650811753,1801545074,29285,0}, Level = 0, isPointer = false},
{name = "نيسي", Code = {1634034216,1601795189,1702125943,1869438834,1702130542,114}, Level = 0, isPointer = false},
{name = "سفينة مسكونة", Code = {1634034210,1601795189,1936681063,1752391540,28777,0}, Level = 0, isPointer = false},
{name = "سفينة القراصنة", Code = {1667592275, 1114399081, 1953849701, 1866620793, 1767339105, 1766877300, 1702125938, 1734437958}, Level = 32, isPointer = true},
{name = "قارب مع أزهار", Code = {1667592275, 1114399081, 1953849701, 1766023033, 1631877492, 1868717945, 1868526689, 1818648422, 1919252335, 115}, Level = 37, isPointer = true},
{name = "بيت من طابق واحد", Code = {1634034216,1601795189,1937076072,1818316133,1702259044,115}, Level = 0, isPointer = false}

        }
    },
    {
        name = "🎮 زينـات ألعـاب ومـرح 🎡",
        items = {
{name = "سينما قديمة الطراز", Code = {2003127840,1701734723,1734304109,1651733601,873398393,124}, Level = 0, isPointer = false},
{name = "سيارات منخفظة", Code = {2003790880,1701079410,1918858098,1969451877,1761607781,26478}, Level = 0, isPointer = false},
{name = "راكب الدراجة الأنيق", Code = {2003788586,1400467298,1970561396,1769430885,1702323308,29811}, Level = 0, isPointer = false},        	
{name = "ملعب رعاة البقر الصغار", Code = {2003780376,1601793890,1702326100,6750322,1694524672,0}, Level = 0, isPointer = false},        	
{name = "ركن القراصنة", Code = {2003784722,1632001902,1593864809,1835102804,1768714096,25966}, Level = 0, isPointer = false},        	
{name = "قواطع البيتزا", Code = {2053730340,1969447290,1852404852,1634754407,6386803,29811}, Level = 0, isPointer = false},        	
{name = "آلة المخلب", Code = {2037347360,1751343437,1600482921,1768711528,1761607800,26478}, Level = 0, isPointer = false},        	
{name = "قش طازج", Code = {2036426758,1717531136,1702326124,845116274,469762048,124}, Level = 0, isPointer = false},        	
{name = "روبوت آلي", Code = {1667592275, 1114399081, 1953849701, 1634164601, 1869770604, 7630690}, Level = 23, isPointer = true},
{name = "مسابقة ثلاثية", Code = {1969317218, 1952414068, 1952541042, 1852796008, 1853190751, 7497070}, Level = 23, isPointer = true},
{name = "آلة متطورة", Code = {1969317218, 1734310260, 1650748527, 1600615013, 1751343469, 6647401}, Level = 23, isPointer = true},
{name = "جوال المريخ", Code = {1969317218, 1935636852, 1701011824, 1918987615, 1869766515, 7497078}, Level = 23, isPointer = true},
{name = "ملعب القراصنة", Code = {1969317218, 1667201396, 1684826472, 1601070450, 1634888048, 7562612}, Level = 23, isPointer = true},
{name = "التخييم الصيفي", Code = {1920298836, 1349809001, 1768649313, 1952409454, 1935762802, 6648437}, Level = 23, isPointer = true},
{name = "تفاحة بالكراميل", Code = {1634885987, 1097622893, 1701605488, 1920299871, 1735289190, 7565925}, Level = 23, isPointer = true},
{name = "منزل مقلوب", Code = {1769173109, 1866753380, 1867017847, 1600484213, 1735292258, 2003790945, 0, 0}, Level = 24, isPointer = true},
{name = " طائرة تجريبية", Code = {1969317218, 1885305204, 1701732716, 1970239071, 1601464423, 859255158, 0, 0}, Level = 24, isPointer = true},
{name = " ملعب جزيرة الكنز", Code = {1768711496, 1836403320, 1918132080, 1970495845, 1934189938, 1684955500, 0, 0}, Level = 24, isPointer = true},
{name = "ممارسة البيسبول", Code = {1836674127, 1600350576, 1702060354, 1819042146, 1767993972, 1735289198, 0, 0}, Level = 24, isPointer = true},
{name = "جولة الإقلاع", Code = {1667592275, 1114399081, 1953849701, 2001952633, 1348955753, 1701732716, 0, 0}, Level = 24, isPointer = true},
{name = "كرة بلازما", Code = {1969317218, 1700755828, 1919250552, 1852140905, 1819303796, 1634562913, 0, 0}, Level = 24, isPointer = true},
{name = "خبير صناعة الطائرة الورقية", Code = {1701860138,1818323299,1969317186,1264548212,1766548585,25972}, Level = 0, isPointer = false},
{name = "طائرة تعمل بالكتلة الحيوية", Code = {1701860138,1818323299,1969317186,1650424180,1819307881,28257}, Level = 0, isPointer = false},
{name = "عنكبوت آلي", Code = {1701860140,1818323299,1969317186,1885305204,1869313377,6582120}, Level = 0, isPointer = false},
{name = "جرس", Code = {1634034198,1601795189,1735290695,0,0,0}, Level = 0, isPointer = false},
{name = "حامل الألعاب النارية", Code = {1634034214,1601795189,1701996902,1802661751,1886349427,0}, Level = 0, isPointer = false},
{name = "الماسة الكبرى", Code = {1634034204,1601795189,1835100516,6581871,0,0}, Level = 0, isPointer = false},
{name = "الأرجوحات", Code = {1634034216,1601795189,1852405619,1768382311,1717985650,101}, Level = 0, isPointer = false},
{name = "أرجوحة الأطفال", Code = {1634034206,1601795189,1869767011,1818588021,0,0}, Level = 0, isPointer = false},
{name = "ملعب الأطفال", Code = {1634034212,1601795189,2036427888,1970238055,3302510,0}, Level = 0, isPointer = false},
{name = "القرص الشمسي", Code = {1634034216,1601795189,1735549292,1970495333,1634296942,108}, Level = 0, isPointer = false},
{name = "رمي السكاكين", Code = {1634034220,1601795189,1869768820,1735289207,1768844127,7562614}, Level = 0, isPointer = false},
{name = "أرجوحة الزهور", Code = {1869375000,1601332599,1852405619,1769209959,1852795252,7566336}, Level = 0, isPointer = false},
{name = "الأعوام الخمسة المذهلة", Code = {1634034212,1601795189,1834973493,1836412527,7630437,0}, Level = 0, isPointer = false},
{name = "أداء الركائز", Code = {1634034220,1601795189,1869767521,1937006946,1769239391,7566444}, Level = 0, isPointer = false},
{name = "متزلجون", Code = {1634034218,1601795189,1952803667,1919902309,1634488420,25955}, Level = 0, isPointer = false},
{name = "محاكي الطيران", Code = {1634034220,1601795189,1970104691,1869898092,1819303794,6647393}, Level = 0, isPointer = false},
{name = "طائرة بجناحين أحدهما فوق الآخر", Code = {1634034214,1601795189,1684305264,1967809900,1919250541,0}, Level = 0, isPointer = false},
{name = "سفينة شراعية هوائية", Code = {1634034210,1601795189,1769565286,1752393582,28777,0}, Level = 0, isPointer = false},
{name = "طائرة بخارية", Code = {1634034212,1601795189,1851878512,1953718117,7168357,0}, Level = 0, isPointer = false},
{name = "رقصة التنين", Code = {1634034214,1601795189,1734439524,1683975791,1701015137,0}, Level = 0, isPointer = false},
{name = "الرسامون المرحون", Code = {1634034218,1601795189,1869377379,1735289202,1651860319,29541}, Level = 0, isPointer = false},
{name = "لعبة  دوارة من الحلوى", Code = {1634034218,1601795189,1684955491,1633902457,1937076082,27749}, Level = 0, isPointer = false},
{name = "حاو", Code = {1634034204,1601795189,1734833514,7497068,0,0}, Level = 0, isPointer = false},
{name = "لعبة مهرجان سباق الزوارق", Code = {1634034208,1601795189,1885956211,1869574239,108,0}, Level = 0, isPointer = false},
{name = "حارس مرمى منهك", Code = {1634034210,1601795189,1818324807,1885693291,29285,0}, Level = 0, isPointer = false},
{name = "ساحة رقص زهرية", Code = {1634034210,1683974243,1701015137,1869375071,29295,0}, Level = 0, isPointer = false},
{name = "قبة سماوية مفتوحة", Code = {1634034214,1601795189,1634496371,2037604210,1835365491,0}, Level = 0, isPointer = false},
{name = "ستونهنج", Code = {1634034210,1601795189,1852798067,1852139621,25959,0}, Level = 0, isPointer = false},
{name = "موجة فائقة", Code = {1920291602,1867538278,1728081007,1651733601,-388759431,111}, Level = 0, isPointer = false},
{name = "أرجوحة الأفيال الطائرة", Code = {1918984996,1702065519,1818582892,1634234469,7566446,29806}, Level = 0, isPointer = false},
{name = "دوامة خيل عالمية تحت الماء", Code = {1667592275, 1114399081, 1953849701, 1699962745, 1918976865, 1702065519, 1132658796, 0}, Level = 25, isPointer = true},
{name = "الصندوق المقدس", Code = {1667592275,1114399081,1953849701,1666146169,1970302836,1701331827,1711305843}, Level = 26, isPointer = true},
{name = "نصب تجريبي", Code = {1969317218,1700755828,1919250552,1852140905,1869438836,1701672302,1862300782}, Level = 26, isPointer = true},
{name = "لافتة لصورة ذاتية للاحتفال", Code = {1667592275, 1114399081, 1953849701, 1765957497, 1684567154, 1631746401, 1919250030, 0}, Level = 28, isPointer = true},
{name = "أصبحت لعبة township لعبتين", Code ﻿= {1667592275, 1114399081, 1953849701, 1766023033, 1﻿6﻿31877492, 1752391545, 1936745829, 0}, Level = 28, isPointer = true},
{name = "القلعة المتحركة", Code = {16﻿6﻿7﻿592275, 1114399081, 1953849701, 1635213177, 1852402540, 1633902﻿439, 1701606515, 0}, Level = 28, isPointer = true},
{name = "نموذج غواصة الأعماق", Code = {1667592275, 1114399081, 1953849701, 1631739769, 1937336436, 1752195427, 1702259012, 0}, Level = 28, isPointer = true},
{name = "لعبة السيارات الاصطدامية", Code = {1667592275, 1114399081, 1953849701, 1983995769, 1950445428, 1667330676, 1852795252, 0}, Level = 28, isPointer = true},
{name = "الثور ا﻿لآلي", Code = {1667592275, 1114399081, 1953849701, 1699569529, 1851877475, 1818321769, 1701080914, 1049231471 }, Level = 29, isPointer = true},
{name = "ساحة الأبطال", Code = {1969317218, 2002745716, 1701736041, 1885303666, 1701011820, 2037149535, 1634300013, 1049231460 }, Level = 29, isPointer = true},
{name = "بطيخة عملاقة", Code = {1667592275, 1114399081, 1953849701, 1766285177, 1467248225, 1919251553, 1869374829, 110 }, Level = 29, isPointer = true},
{name = "حلبة الهوكي", Code = {1668245540, 1182360939, 1684825449, 1853190751, 7497070, 0}, Level = 0, isPointer = false},
{name = "بطارية داخلية", Code = {1667592275, 1114399081, 1953849701, 1701863289, 1952804978, 1970040181, 1852990819, 97 }, Level = 29, isPointer = true},
{name = "العربة الملكية ", Code = {1667592275, 1114399081, 1953849701, 1699569529, 1﻿986357604, 1631808617, 1734963826, 1040187493}, Level = 29, isPointer = true},
{name = "ملعب التدريب", Code = {1969317218, 1415543156, 1852399986, 1197960809, 1853190002, 1819238244, 1768975737, 1040213089 }, Level = 30, isPointer = true},
{name = "قلعة مطاطية", Code = {1667592275, 1114399081, 1953849701, 18503023﻿29,﻿ 1952541798, 1701601889, 1953718595, 1677747564 }, Level = 30, isPointer = true},
{name = "لافتة 5 أعوام معاً", Code = {1702442252, 7565921, 1969317186, 1113553268, 1701736033, 114}, Level = 0, isPointer = false},
{name = "المضمار المنزلق", Code =﻿ {1651458586, 1768254579, 1632790631, 1845519715, 7497070, 110}, Level = 0, isPointer = false},
{name = "منحدر بلا نهاية", Code = {1869509408, 1634689655, 1918854258, 1701736053, 7471218, 110}, Level = 0, isPointer = false},
{name = "الفائز المجنح", Code = {1634496550, 1765893486, 1634886514, 1699902566, 1685217655, 0}, Level = 0, isPointer = false},
{name = "الملعب", Code = {1634496532, 1869768569, 6581877, 1869768558, 2037540195, 0}, Level = 0, isPointer = false},
{name = "ملعب التنس", Code = {1852142604, 7563630, 7234916, 1701999711, 875585381, 0}, Level = 0, isPointer = false},
{name = "ملعب كرة القدم", Code = {1869571600, 1818321524, 108, 1701999711, 875585381, 0}, Level = 0, isPointer = false},
{name = "ملعب البيسبول", Co﻿de = {1935761936, 1818321509, 108, 3307569, 875585381, 0}, Level = 0, isPointer = false},
{name = "البالونات", Code = {1818321422,1936617327,1818848512,7602297,6648431,0}, Level = 0, isPointer = false},
{name = "ترامبولين الأسد", Code = {1869179926,1819500﻿3﻿98,1936024681,25856}, Level = 0, isPointer = false},
{name = "حوض زهور الفاكهة", Code = {1852403742,1886413157,1801413996,1701210478,3670016,7566444}, Level = 0, isPointer = false},
{name = "مصنع قوس قزح", Code = {1851876122,1918859620,1651403105,1761638255,1852795252,7566336}, Level = 0, isPointer = false},
{name = "جولة عالمية", Code = {1869375268,1181507938,1751607660,1819303796,6647393}, Level = 0, isPointer = false},
{name = "نطاق التصويب على الفاكهة", Code = {1869116190,1852404847,1701994343,1702191987,6647296}, Level = 0, isPointer = false},
{name = "مهاجم قوي", Code = {1853449252,1836019041,191﻿925﻿1557,1936028255,6649187,7536741}, Level = 0, isPointer = false},
{name = "لعبة  بينبول", Code = {1852403738,1819042146,1818585183,1711306857,1768452969,26478}, Level = 0, isPointer = false},
{name = "قلعة الحلوى", Code = {1851876130,1631811940,1701606515,1818585183,1761638505,26478}, Level = 0, isPointer = false},
{name = "مؤسس ألعاب الهاتف المحمول", Code = {1835099930,2037342821,1818585183,1761638505,1761607800,26478}, Level = 0, isPointer = false},
{name = "ترامبولين هلامي", Code = {1818585622,1866627436,1701015157,7496960,1761607800,26478}, Level = 0, isPointer = false},
{name = "مستك﻿شف قطبي", Code = {1819242526,1634562657,1918984046,1667855459,1761607680,26478}, Level = 0, isPointer = false},
{name = ﻿"الفنانون المتجولين", Code = {1869771812,1919252085,1834972005,1701405797,7102838,51}, Level = 0, isPointer = false},
{name = "مسابقة الرقص ", Code = {1851876388,1632462179,1852401763,1701338981,7891308,0}, Level = 0, isPointer = false},
{name = "سباق طائرات آلية", Code = {1869759518,1632789870,1885300067,1701732716,1852732672,29285}, Level = 0, isPointer = false},
{name = "ميدان رماية نجوم", Code = {1818321444,1869108076,1852404847,17013389﻿83,78﻿91308} , Level = 0, isPointer = false},
{name = "قطار حلوى سريع", Code = {1851876138,1918138724,16010﻿71457,1718777203,1701277289,29554}, Level = 0, isPo﻿inter = false},
{name = "لعبة رمي الحلقات", Code = {1852404262,1835091815,1970495333,1852401266,1936876903,29440}, Level = 0, isPointer = false},
{name = "سباق فرع العسل", Code = {1836412950,185240254﻿4,1701011826,1936876800,1701707776,114}, Level = 0, isPointer = false},
{name = "لغز ضخم", Code = {1818576922,1348434025,1819966049,1660973925,1701734760,0}, Level = 0, isPointer = false},
{name = "آثار الأطباق الطائرة", Code = {1868985614,1702194243,7235840,3276800}, Level = 0, isPointer = false},
{name = "حديقة المغامرات", Code = {1667580958, 1415541359, 1214604658, 1702065519, 0, 0}, Level = 0, isPointer = false},
{name = "ترامبولين فك القرش", Code = {1634235158, 1935633266, 1701079404, 0, 0, 0}, Level = 0, isPointer = false},
{name = "موقف الدراجات", Code = {1668891418, 1348429164, 1768649313, 26478, 0, 0}, Level = 0, isPointer = false},
{name = "زلاقة قطار", Code = {1634882588, 1866690153, 1668637806, 7499636, 0, 0}, Level = 0, isPointer = false},
{name = "روديو الشاحنات الصغيرة", Code = {1667583256, 1768841576, 1631805283, 7078002, 0, 0}, Level = 0, isPointer = false},
{name = "محطة الوادي", Code = {1734432540, 1298099823, 1953396079, 7235937, 0, 0}, Level = 0, isPointer = false},
{name = "مبارزة الإبحار", Code = {17679941﻿36, 1735289196, 1667330655, 1920204901, 1970495845, 25970}, Level = 0, isPointer = false},
{name = "لقاء بحري", Code = {1768444692, 1766219632, 7628903, 0, 0, 0}, Level = 0, isPointer = false},
{name = "لعبة الموجة التاسعة", Code = {1768444690, 2003784816, 29285, 0, 0, 0}, Level = 0, isPointer = false},
{name = "لعبة قوس قزح", Code = {1767993890, 2003788398, 1919508﻿806, 1818585183, 956332137, 0}, Level = 0, isPointer = false},
{name = "الرماية", Code = {1668440348, 2037540200, 1853190751, 7497070, 0, 0}, Level = 0, isPointer = false},
{name = "لعبة القطار للأطفال", Code = {1684622102, 1767985779, 2036430700, 0, 0, 0}, Level = 0, isPointer = false},
{name = "درج لا نهاية له", Code = {1635021594, 1601401449, 1668571501, 1962947432, 0, 0}, Level = 0, isPointer = false},
{name = "انصهار", Code = {1685025314, 1699245925, 1600350572, 1852732786, 1711305317, 0}, Level = 0, isPointer = false},
{name = "فزاعة ميكانيكية", Code = {1667591448, 1920226152, 1634563937, 1761607790, 0, 0}, Level = 0, isPointer = false},
{name = "متسابقو الشوارع الصغار", Code = {1684107808, 1634889577, 1918854499, 1969451877, 101, 0}, Level = 0, isPointer = false},
{name = "صنع القش", Code = {1634890782, 1919906915, 1684955487, 2036426847, 0, 0}, Level = 0, isPointer = false},
{name = "حارس الكنز", Code = {1667591462, 1634878568, 1601072999, 1768187245, 1818326629, 0}, Level = 0, isPointer = false},
{name = "مباراة الشطرنج", Code = {1701339928, 1633645427, 1768055154, 6750307, 0, 0}, Level = 0, isPointer = false},
{name = "نافورة عصير البرتقال", Code = {1769302556, 1717527907, 1953396079, 7235937, 0, 0}, Level = 0, isPointer = false},
{name = "عربة مع ثمار اليقطين", Code = {1734702612, 1650553957, 7562604, 0, 0, 0}, Level = 0, isPointer = false},
{name = "أكبر كعكة", Code = {1734692112, 1801536353, 7274597, 0, 0, 0}, Level = 0, isPointer = false},
{name = "خلاط عملاق", Code = {1701601818, 1919247470, 1768844127, 1342203238, 0, 0}, Level = 0, isPointer = false},
{name = "ركوب البحر الجامح", Code = {1768452906, 1953775984, 1952670066, 1601073001, 1634888048, 25972}, Level = 0, isPointer = false},
{n﻿ame = "سباق الأكياس", Code = {1734435362, 1852732786, 1600613993, 1953718629, 1627419237, 0}, Level = 0, isPointer = false},
{name = "لعبة الصدفة", Code = {1701344030, 1634167916, 1751082349, 2020174949, 0, 0}, Level = 0, isPointer = false},
{name = "عرض السيارة الكلاسيكية", Code = {1918976798,2017812339,1769172848,1852795252,1694524672,0}, Level = 0, isPointer = false},
{name = "جولة الغرب الأمريكي", Code = {1919895580,1130325363,1970238049,7103859,1694524672,0}, Level = 0, isPointer = false},
{name = "شاحنة عملاقة", Code = {1734959650, 1667330644, 1601335156, 1668506994, 25973, 0}, Level = 0, isPointer = false},
{name = "القلعة النطاطة", Code = {1935754018,1600482420,1835102804,1768714096,1694524782,0}, Level = 0, isPointer = false},
{name = "أرجوحة النقانق", Code = {1953450006,1399287620,1735289207,1919906816,1667581049,29295}, Level = 0, isPointer = false},
{name = "لعبة ركوب القارب", Code = {1935762710,1601332596,1684959088,7959040,-368251072,111}, Level = 0, isPointer = false},
{name = "ملعب كرة السلة", Code = {1935761948,1651795307,1600941153,3307569,875585381,0}, Level = 0, isPointer = false},
{name = "ملعب البيسبول ", Code = {1935761936,1818321509,108,3307569,875585381,0}, Level = 0, isPointer = false},
{name = "كره فاكهة", Code = {1970431526,1866888297,1633842287,1801415788,1701210478,0}, Level = 0, isPointer = false},
{name = "ديسكو إلى الأبد ", Code = {1936286756,1866887011,1702258034,1970102130,6515059,6649187}, Level = 0, isPointer = false},
{name = "دوامة خيل طائرة", Code = {1918984988,1﻿7020﻿65519,1701338988,7891308,1702326124,28261}, Level = 0, isPointer = false},
{name = "مغامرة مائية", Code = {1970364700,1918988385,1701338987,7891308,1701707877,114}, Level = 0, isPointer = false},
{name = "حفلة آلات البانجو", Code = {1918985746,1937075565,1694524265,1936876800,1701707776,114}, Level = 0, isPointer = false},
{name = "العجلة الدوارة", Code = {1918984990,1702065519,1970429804,1919250030,1694528000,114}, Level = 0, isPointer = false},
{name = "الشاحنات العملاقة", Code = {1970426908,1601399651,1868784964,7499636,-388697088,111}, Level = 0, isPointer = false},
{name = "غارة القراصنة ", Code = {1919504404,1181054049,7631471,1701999711,7340133,111}, Level = 0, isPointer = false},
{name = "أرجوحة سماوية", Code = {1920291626,1735289190,1601401445,1835102804,1768714096,25966}, Level = 0, isPointer = false},
{name = "لعبة الأحصنة الدوارة الأخطبوطية ", Code = {1918976800,1702065519,1666146156,1970302836,1768685683,25966}, Level = 0, isPointer = false},
{name = "ترامبولين الطائرة الهليكوبتر", Code = {1667592275, 1114399081, 1953849701, 1699241849, 1868786028, 1919251568, 1835102804, 1768714096, 922772846}, Level = 34, isPointer = true},
{name = "لافتة انفجار قصاصات الورق الملون", Code = {1768440602, 1702061422, 1852727618, 29285,0,0}, Level = 0, isPointer = false},
{name = "راية الطبخ الرائعة", Code = {1701860136,1818323299,1969317186,1113553268,1701736033,114}, Level = 0, isPointer = false}

        }
    },
    {
        name = "🦁 زينـات حديقـة وحيوانـات 🐘",
        items = {
{name = "مصنع المشروبات", Code = {1869576740,1668244319,1767994475,1953718124,6648431,1}, Level = 0, isPointer = false},
{name = "حديقة الحيوانات المدلله", Code = {1869576726,1852793695,1952670068,7630336,872444015,1}, Level = 0, isPointer = false},
{name = "المطعم", Code = {1869576732,1936028255,1920295284,7630433,872444015,1}, Level = 0, isPointer = false},
{name = "متجر الهدايا", Code = {1869576720,1869116255,1634009200,1752391533,872444015,1}, Level = 0, isPointer = false},
{name = "متجر الآيس كريم", Code = {1869576738,1701013855,1634038371,1752391533,872444015,1}, Level = 0, isPointer = false},
{name = "zoo حديقة الحيوانات", Code = {1869576722,1667589215,1728082543,101,872444782,0}, Level = 0, isPointer = false},
{name = "مطعم وجبات خفيفه ", Code = {1869576724,1952539999,7959141,114,878968932,1}, Level = 0, isPointer = false},
{name = "مقهى", Code = {1869576722,1717658463,25958,114,878968932,1}, Level = 0, isPointer = false},
{name = "المسرح رباعي الأبعاد", Code = {1869576724,1852400479,6384997,114,878968932,1}, Level = 0, isPointer = false},
{nam﻿e = "جهاز عرض ثلاثي الأبعاد ", Code = {1969317218,1700755828,1919250552,1852140905,1919967092,1667590767,7499636}, Level = 27, isPointer = true},
{name = "الديك الناري", Code = {1667592275, 1114399081, 1953849701, 1768316793, 1869768050, 1702130543, 1718485106, 0}, Level = 25, isPointer = true},
{name = "قط الحظ", Code = {1667592275,1114399081,1953849701,1749245817,1600220777,1701732717,26987 }, Level = 26, isPointer = true},
{name = "الأسد الصيني", Code = {1667592275,1114399081,1953849701,1749245817,1600220777,1734439524,16805487}, Level = 26, isPointer = true},
{name = "كوي الرقص", Code = {1667592275,1114399081,1953849701,196990﻿55﻿29,1852403821,1768316775,1627416691}, Level = 26, isPointer = true},
{name = "التنين الأحمر", Code = {1667592275, 1114399081, 1953849701, 1751342969, 1600220777, 1734439524, 808611439, 1040201521 }, Level = 30, isPointer = true},
{name = "الماموث المتجمد", Code = {1835101468,﻿ 1752461165, 1952542047, 3369059, 0, 0}, Level = 0, isPointer = false},
{name = "حوض سمك عملاق", Code = {1970364694, 1969844833, 829841261, 3307520, 875585381, 0}, Level = 0, isPointer = false},
{name = "حديقة الحيوانات المدللة", Code = {1869576726,1852793695,1952670068,7630336,872444015,0}, Level = 0, isPointer = false},
{name = "ترامبولين حديقة الحيوانات", Code = {1818321434,1601073007,1953718627,25964}, Level = 0, isPointer = false},
{name = "حضانة القرود", Code = {1852796186,1937335659,1634496607,1593863022}, Level = 0, isPointer﻿ = false},
{name = "المينوتور", Code = {1852402976,1969321071,1851875186,1852139875,-414711692,111}, Level = 0, isPointer = false},
{name = "حصان طروادة", Code = {1869771814,1215193450,1702064751,1668178271,1953391977,7630848}, Level = 0, isPointer = false},
{name = "حديقة الحيوانات", Code = {1869576722,1667589215,1728082543,101,872444782,0}, Level = 0, isPointer = false},
{name = "حوض أسماك سعيد", Code = {1885423644,1096776048,1918989681,7173481,1912602725,0}, Level = 0, isPointer = false},
{name = "حديقة الديناصورات", Code = {1852392466,1632853871,1677747558,25959}, Level = 0, isPointer = false},
{name = "سقسقة", Code = {1768448786, 1751346019, 1694526313, 7891308, 0, 0}, Level = 0, isPointer = false},
{name = "أفعوانية كلاكي", Code = {1634890776, 1751346793, 1701536617, 1912602734, 0, 0}, Level = 0, isPointer = false},
{name =﻿ "نز﻿هة الذروة", Code = {1734959634, 1852008784, 1845519209, 0, 0, 0}, Level = 0, isPointer = false},
{name = "كيتي روك", Code = {1668248090, 1952531307, 1937075551, 1795187561, 1701210478, 0}, Level = 0, isPointer = false},
{name = "التي ريكس المتجمد", Code = {1701013776, 1852400735, 1634467951, 0, 0, 0}, Level = 0, isPointer = false},
{name = "بطل الوزن الثقيل", Code = {1768257318, 1819568231, 1702127209, 1970429810, 1919250030, 0}, Level = 0, isPointer = false},
{name = "قوس قزح", Code = {1767985686, 2003788398, 1751347777, 0, 0, 0}, Level = 0, isPointer = false},
{name = "حديقة الفئران الذهبية", Code = {1952543260,1685217607,1784639077,7368053,1761607781,26478}, Level = 0, isPointer = false},
{name = "النحلة الطيارة", Code = {1701860140,1818323299,1969317186,1113553268,1766876517,7630700}, Level = 0, isPointer = false},
{name = "طوطم المزارع", Code = {1701860134,1818323299,1969317186,1415543156,1835365487,0}, Level = 0, isPointer = false},
{name = "برج الحمام", Code = {1701860140,1818323299,1969317186,1147107700,1667593839,6648943}, Level = 0, isPointer = false},
{name = "بقرة الحلوى", Code = {1969317218, 1667201396, 1701211759, 1869182051, 1601332590, 7827299}, Level = 23, isPointer = true},
{name = "مقعد الصداقة", Code = {1969317218, 1717533044, 1852139890, 1852129892, 1717528675, 7954788}, Level = 23, isPointer = true},
{name = "رسام بدائي", Code = {1969317218, 1885305204, 1768778098, 1702259060, 1953653087, 7631721}, Level = 23, isPointer = true},
{name = "محمية الحياة البرية", Code = {1969317218, 1784641908, 1818717813, 1634951013, 1970561902, 7959137}, Level = 23, isPointer = true},
{name = "معرض صديق للبيئة", Code = {1819632467, 1920300144, 1752712549, 1953063529, 1601073001, 7631457}, Level = 23, isPointer = true},
{name = "طاووس عاشق", Code = {1701601622, 1852404846, 1701863269, 1668244321, 1852399467, 1702260588, 0, 0}, Level = 24, isPointer = true},
{name = "التخييم", Code = {1667592275, 1114399081, 1953849701, 1953718137, 1702196321, 1734963295, 0, 0}, Level = 24, isPointer = true},
{name = " حوض سمك يوناني", Code = {1635086657, 1836411250, 1634497601, 1667855470, 1668178271, 1953391977, 0, 0}, Level = 24, isPointer = true},
{name = "حوض سمك أطلنطي", Code = {1969317218, 1633646964, 1851878516, 1601399156, 1635086689, 1836411250, 0, 0}, Level = 24, isPointer = true},
{name = "حوض سمك المدينة", Code = {1701860140,1818323299,1969317186,1096776052,1918989681,7173481}, Level = 0, isPointer = false},
{name = "ضفدع المال", Code = {1667592275, 1114399081, 1953849701, 1917214585, 1951623023, 1702196321, 0, 0}, Level = 24, isPointer = true},
{name = "سمكة ذهبية", Code = {1667592275, 1114399081, 1953849701, 1749245817, 1600220777, 1752394086, 0, 0}, Level = 24, isPointer = true},
{name = "لوحة الفيل", Code = {1634034218,1601795189,1818323043,1818582891,1634234469,29806}, Level = 0, isPointer = false},
{name = "لوحة الزرافة", Code = {1634034216,1601795189,1818323043,1768578923,1717985650,101}, Level = 0, isPointer = false},
{name = "رشات سعيدة", Code = {1667592275, 1114399081, 1953849701, 1752653689, 1717922913, 1953396079, 1601071457, 1752394086, 6778473}, Level = 35, isPointer = true},
{name = "لوحة الحمار الوحشي", Code = {1634034212,1601795189,1818323043,1702518635,6386274,0}, Level = 0, isPointer = false},
{name = "لوحة الأسد", Code = {1634034210,1601795189,1818323043,1768709995,28271,0}, Level = 0, isPointer = false},
{name = "زرافة ميكانيكية", Code = {1634034212,1601795189,1634888042,1683973478,7105633,0}, Level = 0, isPointer = false},
{name = "مشتل أزهار على شكل خروف", Code = {1634034216,1601795189,1919904870,1935633505,1885693288,115}, Level = 0, isPointer = false},
{name = "أفيال سعيدة", Code = {1634034208,1601795189,1885695077,1953390952,115,0}, Level = 0, isPointer = false},
{name = "خروف محشو", Code = {1634034210,1601795189,1937075312,1701335912,28773,0}, Level = 0, isPointer = false},
{name = "طهاة سعداء", Code = {1634034216,1601795189,1835626081,1601399905,1953718640,97}, Level = 0, isPointer = false},
{name = "خبز الموز", Code = {1634034212,1601795189,1735292266,1834968428,7040623,0}, Level = 0, isPointer = false},
{name = "ديبلودوكس", Code = {1634034206,1601795189,1869506916,1920295283,0,0}, Level = 0, isPointer = false},
{name = "ويلات الفن", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1935754591, 1131570548, 1801677160, 905997925}, Level = 34, isPointer = true},
{name = "العمل الجماعي", Code = {1667592275, 1114399081, 1953849701, 1951620985, 1702196321, 1802661719, 1701277524, 1919248500}, Level = 32, isPointer = true},
{name = "الراكب الأول", Code = {1634034204,1601795189,1835884909,6845551,0,0}, Level = 0, isPointer = false}
        }
    },
    {
        name = "❤️ زينـات حـب وفلانتـين 🌹",
        items = {
{name = "حديقة حب", Code = {1987013652,1918986085,7234916,1701999711,875585381,0}, Level = 0, isPointer = false},
{name = "لحن غرامي لا نهايه له", Code = {1987013650,2003784805,1761636965,1912602736,1694528000,114}, Level = 0, isPointer = false},
{name = "طيار عاشق", Code = {1987013650,1852397413,1761637223,1912602736,1694528000,114}, Level = 0, isPointer = false},
{name = "جسر الحب", Code = {1987013654,1919049573,1701274729,3276800,875585381,0}, Level = 0, isPointer = false},
{name = "عربة مع أزهار", Code = {1987013656,1818648421,1919252335,7209075,1275096693,114}, Level = 0, isPointer = false},
{name = "كيوبيد", Code = {1701601622, 1852404846, 1951620965, 1702196321, 1600548703, 1768977763, 100, 0}, Level = 25, isPointer = true},
{name = "هدية غير متوقعة", Code = {1701601622,1852404846,1869438821,1717530223,﻿1﻿601007474,1986094440,28261}, Level = 26, isPointer = true},
{name = "عشاء رومانسي", Code = {1﻿667592275, 1114399081, 19538497﻿01﻿, 1867669369, 1953390957, 1766089577, 1919250030, 0}, Level = 28, isPointer = true},
{name = "موعد مزدوج", Code = {1801546788,1970235493,1650419059,1953784175,7367026,111}, Level = 0, isPointer = false},
{name = "منطقة صورة الزوجين الرائعين", Code = {1869115432,1951625076,1600417377,1701601654,1852404846,101}, Level = 0, isPointer = false},
{name = "عشب حفل الزفاف", Code = {1684363038, 1735289188, 1147094067, 1919902565, 0, 0},﻿ Level = 0, isPointer = false},
{name = "نفق الغرام", Code = {1987005460,1853183077,7103854,1919252079,1700945779,6841198}, Level = 0, isPointer = false},
{name = "قفلا الغرام", Code = {1987005456,1668238437,1818165355,1919252079,1700﻿945779,68﻿41198}, ﻿Level = ﻿0, is﻿Pointer =﻿ false},
{name = "حديقة رومانسية", Code = {1634035750, 1918137458, 1985963365, 1852140641, 1701734772, 0}, Level = 0, isPointer = false},
{name = "الكشك", Code = {1651663114, 1845523055﻿, 0, 0, 0, 0}, Level = 0, isPointer = false},
﻿{name = ﻿"وحيد قرن﻿ محشو ", C﻿ode = {19700408﻿76,1851091059,1919902569,1635147630,1953391980,6647401}, Level = 0, isPointer = false},
{name = "حديقة الحب", Code = {1987013652,1918986085,7234916,1701999711,875585381,0}, Level = 0, isPointer = false},
{name = "طيار العاشق", Code = {1987013650,1852397413,1761637223,1912602736,1694528000,114}, Level = 0, isPointer = false},
{name = "لحن غرامي لا نهاية له", Code = {1987013650,2003784805,1761636965,1912602736,1694528000,114}, Level = 0, isPointer = false},
{name = "قلب ع شكل ياقوتة", Code = {1701601622, 1852404846, 1768185701, 1852796257, 1701338980, 7631457}, Level = 23, isPointer = true},
{name = "الحب الخالد", Code = {1818318380,1769238117,1751082350,1953653093,1632136777,7562350}, Level = 0, isPointer = false},
{name = "متزوجان حديثا", Code = {1818318378,1769238117,1784636782,1299477365,1769108065,25701}, Level = 0, isPointer = false},
{name = "مشتل أزهار على شكل قلب", Code = {1818318374,1769238117,1717527918,1702326124,1684365938,7562496}, Level = 0, isPointer = false},
{name = "حمام عاشق", Code = {1818318380,1769238117,1885300078,1868916585,1818194798,6649455}, Level = 0, isPointer = false},
{name = "النقل ", Code = {1818318378,1769238117,1818191214,1919252079,1633902451,29810}, Level = 0, isPointer = false},
{name = "تمثال رسول الحب", Code = {1818318374,1769238117,1885300078,1937011567,1885693288,29696}, Level = 0, isPointer = false},
{name = "موعد رومانسي", Code = {1818318372,1769238117,1935631726,1852142181,6644833,29696}, Level = 0, isPointer = false},
{name = "دمية  دب", Code = {1818318378,1769238117,1415538030,2036622437,1634034271,12914}, Level = 0, isPointer = false},
{name = "المفتاح إلى القلب", Code = {1818318362,1769238117,1801413998,31077,1234898304,114}, Level = 0, isPointer = false},
{name = "قوس الحب", Code = {1818318372,1769238117,1818191214,1634039407,6841202,30464}, Level = 0, isPointer = false},
{name = "القطة المحبوبة", Code = {1818318374,1769238117,1885300078,1752397164,1952539487,30464}, Level = 0, isPointer = false},
{name = "دمية أرنب", Code = {1818318366,1769238117,1113548142,2037280373,1920090368,30575}, Level = 0, isPointer = false},
{name = "سهم كيوبيد", Code = {1818318378,1769238117,1130325358,1684631669,1920090483,30575}, Level = 0, isPointer = false},
{name = "مقعد المحبين", Code = {1818318380,1769238117,1818191214,1919252079,1700945779,6841198}, Level = 0, isPointer = false},
{name = "تمثال عاطفي", Code = {1818318364,1769238117,1667196270,7566433,1953391980,6647401}, Level = 0, isPointer = false},
{name = "شجيرة مشدبة", Code = {1818318370,1769238117,1415538030,1634300015,1224767858,114}, Level = 0, isPointer = false},
{name = "دب الدمية ", Code = {01818318376,1769238117,1415538030,2036622437,1634034271,114}, Level = 0, isPointer = false},
{name = "مشتل الأزهار مع الملائكة", Code = {1818318374,1769238117,1180657006,1702326124,1684365938,0}, Level = 0, isPointer = false},
{name = "أرجوحة دوارة", Code = {1818318380,1769238117,1398760814,1735289207,1987013727,7565925}, Level = 0, isPointer = false},
{name = "الكشك الرومانسي", Code = {1701601622, 1852404846, 1632067429, 1868719482, 1987013727, 7565925}, Level = 23, isPointer = true},
{name = " منحوتة الحب الأبدي", Code = {1701601622, 1852404846, 1701338981, 1601466977, 1701078384, 1818326131, 0, 0}, Level = 24, isPointer = true}
        }
    },
    {
        name = "🍃 زينـات الطبيعـة 🌍",
        items = {
{name = "الينابيع الساخنة 2", Code = {1953458208,1769107539,1834968942,1751348321,1761607731,26478}, Level = 0, isPointer = false},
{name = " قلعة ", Code = {1935762188,6646900,3241567,29696,-368923392,111}, Level = 0, isPointer = false},
{name = "بيت لبلاب", Code = {1970227224,1197434227,1701081697,110,-388697088,111}, Level = 0, isPointer = false},
{name = "بيت الشاي", Code = {1634038800, 1937076072, 2004025445, 0, 0, 0}, Level = 0, isPointer = false},
{name = "لعبة الشلال", Code = {1702125943, 1818322546, 1869438828, 1635020405, 1935634025, 1﻿768321653, 1919248238, 115 }, Level = 29, isPointer = true},
{name = "بحيرة الطبيعة الأم", Code = {1852796962,1869438820,1919248500,1918985567,26740}, Level = 0, isPointer = false},
{name = "عرض توبياري", Code = {1886352422,2037539177,1836016479,1769235824,1852795252,7566336}, Level = 0, isPointer = false},
{name = "عرض فني", Code = {1818322710,2037540204,1953653087,1852732672,1711305317,7536741}, Level = 0, isPointer = false},
{name = "زيارة الأرانب", Code = {1852793634,1952670068,1601138522,166850﻿6994,25973,7536741}, Level = 0, isPointer = false},
{name = "كتاب الطبيعة", Code = {1869570590,17﻿01991531,1969905509,1701603182,1769238016,115}, Level = 0, isPointer = false},
{name = "مستوطنة بدائية ", Code = {1818850844,1701273964,1853188703,6646887,1752393067,2﻿8783}, Level = 0, isPointer = false},
{name = "متعة نار المعسكر", Code = {1835098912,1735289200,1818851167,1936029540,1702297716,29811}, Level = 0, isPointer = false},
{name = "نبع", Code = {1852796936,1717502052,1702326124,845116274}, Level = 0, isPointer = false},
{name = "بئر", Code = {1818588936,1818820716,1694498924,845116274}, Level = 0, isPointer = false},
{name = "بستان الخيزران", Code = {1835098650,1601138530,1852732786,1912631909,1694528000,114}, Level = 0, isPointer = false},
{name = "منزل البحار", C﻿ode = {1801546780,1970235493,175108235﻿5,6647151,7367026,111},﻿ Level = 0, isPointer = false},
{name = "عش العائلة", Code = {1869902616,1935633266,1970561﻿396,6﻿619237,7367026,111}, Level = 0, isPointer = false},
{name = "بئر نفط", Code = {1818849044,1920099652,7037801,1935605874,6644841,0}, Level = 0, isPointer = false},
{name = "فندق الواحة", Code = {1818325010,1953450093,1694526565,1935634021,6644841,0 }, Level = 0, isPointer = false},
{name = "متجر الشعيرية", Code = {1869573654,1600482404,1886349427,6384640,1929404786,0}, Level = 0, isPointer = false},
{name = "بركة البجع", Code = {1852796946,1635210084,1744860014,29813}, Level = 0, isPointer = false},
{name = "بستان التفاح", Code = {1886404888,1197434220,1701081697,1970339950,1912602725,0}, Level = 0, isPointer = false},
{name = "خيمة ملونة", Code = {1634877718, 1600350562, 1953391956, 0, 0, 0}, Level = 0, isPointer = false},
{name = ﻿"جناح الزهور", Code = {1667580960, 1180660335, 1702326124, 1869108082, 112, 0}, Level = 0, isPointer = false},
{name = "الشلال", Code = {1634554652, 1633119340, 1718773108, 7105633, 0, 0}, Level = 0, isPointer = false},
{name = "واحة حضرية", Code = {1634486042, 1852403821, 1631805287, 1845522541, 0, 0}, Level = 0, isPointer = false},
{name = "كشك النزهة", Code = {1667854348, 6515054, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "بحيرة زهور الزئبق الحمراء", Code = {1684369946, 1768712524, 1867543397, 1962959982, 0, 0}, Level = 0, isPointer = false},
{name = "جسر حبال", Code = {1668178204, 1953391977, 1769103967, 6645604, 0, ﻿0}, Level = 0, isPointer = false},
{name = "شرفة الشلال", Code = {1717650204, 1633116005, 1718773108, 7105633, 0, 0}, Level = 0, isPointer = false},
{name = "شرفة مزرعة العنب", Code = {1717650202, 1767268197, 1635345774, 1761633394, 0, 0}, Level = 0, isPointer = false},
{name = "ملاذ الكهف", Code = {1986085652,1817206629,6644577,25959,7499636,111}, Level = 0, isPointer = false},
{name = "مزرعة العنب", Code = {1935754524,1450337652,2036690537,6582881,-368251072,111}, Level = 0, isPointer = false},
{name = "عيد الربيع", Code = {1935762714,1383228788,1868718697,1694528366,1751347809,7565925}, Level = 0, isPointer = false},
{name = "خيمة الجنة", Code = {1935765270,1700754281,1953528167,1634533376,-368868608,111}, Level = 0, isPointer = false},
{name = "الحدائق المعلقة", Code = {1918986012,1936614756,1634885983,6515042,1702196321,0}, Level = 0, isPointer = false},
{name = "بركة المتنزه", Code = {1936028186,1702261349,1597143089,838873462,-419430400,111}, Level = 0, isPointer = false},
{name = "المتنزه الصغير", Code = {1936028186,1702261349,1597143090,838873462,-419430400,111}, Level = 0, isPointer = false},
{name = "المتنزه الكبير", Code = {1936028186,1702261349,1597208627,838873462,-419430400,111}, Level = 0, isPointer = false},
{name = "بئر الأمنيات", Code = {1936291606,1735289192,1819043159,1701338880,7891308,28261}, Level = 0, isPointer = false},
{name = "شاحنة الزهور", Code = {1970238238,1919248500,1869375086,1936876919,1701707776,114}, Level = 0, isPointer = false},
{name =  " بحيرة الغموض", Code = {1918979356,1952409715,1935762802,6648437,6386803,29811}, Level = 0, isPointer = false},
{name = "توبياري شاعري", Code = {1701601622, 1852404846, 1869897573, 1918986608, 1701339001, 1937011297, 0, 0}, Level = 24, isPointer = true},
{name = "المناطق الاستوائية المريحة", Code = {1868787555, 1098151278, 1751346546, 1601333601, 1735292258, 2003790945, 0, 0}, Level = 24, isPointer = true},
{name = "بيت العصر الحجري", Code = {1969317218, 1885305204, 1768449394, 1919906931, 1751081833, 1702065519, 0, 0}, Level = 24, isPointer = true},
{name = "نبات آكل للحوم", Code = {1634034216,1601795189,1970169206,1818648435,1634890873,112}, Level = 0, isPointer = false},
{name = "هرم من المشروبات", Code = {1634034216,1601795189,1634892144,1600416109,1718185579,101}, Level = 0, isPointer = false},
{name = "تشكيلة فواكه", Code = {1634034206,1717528675,1953068402,2020175199,0,0}, Level = 0, isPointer = false},
{name = "جبل الحلوى", Code = {1634034210,1601795189,1701148531,1768447860,27756,0}, Level = 0, isPointer = false},
{name = "منزل الحلوى", Code = {1634034212,1601795189,1684955491,1869111161,6648693,0}, Level = 0, isPointer = false},
{name = "جزيرة المرح الصيفي", Code = {1634034212,1601795189,2054316404,1952411233,6645106,0}, Level = 0, isPointer = false},
{name = "بوابة المدينة المفقودة", Code = {1634034216,1601795189,1768124001,1601465957,1836413540,115}, Level = 0, isPointer = false},
{name = "موقع المدينة القديمة", Code = {1634034214,1601795189,1768124001,1601465957,1853321076,0}, Level = 0, isPointer = false},
{name = "كهف الغابة", Code = {1634034218,1601795189,1702256995,1601071455,1735292266,25964}, Level = 0, isPointer = false},
{name = "جذع عيش الغراب", Code = {1634034214,1601795189,1953718629,1935635045,1886221684,0}, Level = 0, isPointer = false},
{name = "الوحش الثلجي", Code = {1634034198,1601795189,1769235833,0,0,0}, Level = 0, isPointer = false},
{name = "الاتصال الأول", Code = {1634034196,1601795189,7300725,0,0,0}, Level = 0, isPointer = false}

        }
    },
    {
        name = "🏙️ زينـات المديـنة 🌃",
        items = {
{name = "القرية الأوليمبية", Code = {2037149482,1667854445,1819044182,1600481121,1852732786,29285}, Level = 0, isPointer = false},        	
{name = "منصة الكاميرا", Code = {1935762803, 1766026863, 1633903982, 1634887021, 1852400479, 6384997}, Level = 23, isPointer = true},
{name = "برج فلكي", Code = {1969317218, 1633646964, 1869771891, 1701670766, 1869897586, 7497079}, Level = 23, isPointer = true},
{name = "برج المعرفة", Code = {1969317218, 1700755828, 1919250552, 1852140905, 1852530548, 1701607279, 1952802660, 1919252335}, Level = 32, isPointer = true},
{name = "برج المياه", Code = {1667592275, 1114399081, 1953849701, 1633116025, 1416783220, 1919252335, 0, 0}, Level = 24, isPointer = true},
{name = "حانة الكمثرى", Code = {1667592275, 1114399081, 1953849701, 1917214585, 1265920373, 1802727273, 0, 0}, Level = 24, isPointer = true},
{name = "قريباً", Code = {1634625862, 2003128940, 1600418401, 1685217639, 1766026853, 1634559342, 0, 0}, Level = 24, isPointer = true},
{name = "منزل منسق الأزهار", Code = {1634034212,1601795189,2003790950,1869116005,6648693,0}, Level = 0, isPointer = false},
{name = "منزل راق", Code = {1634034214,1601795189,1970828652,1751087474,1702065519,0}, Level = 0, isPointer = false},
{name = "عربة الخضراوات", Code = {1634034214,1601795189,1701147239,1869768558,2037540195,0}, Level = 0, isPointer = false},
{name = "مقهى 2", Code = {1634034202,1601795189,1869373811,28271,0,0}, Level = 0, isPointer = false},
{name = "منطقة الفنون", Code = {1634034218,1601795189,1769239137,1902081139,1953653109,29285}, Level = 0, isPointer = false},
{name = "شارع الحلوى", Code = {1634034214,1601795189,1953787747,1600481121,1852993384,0}, Level = 0, isPointer = false},
{name = "قاطع صور الأصدقاء الخارقون", Code = {1634034218,1601795189,1701868883,1919248498,1635013487,25710}, Level = 0, isPointer = false},
{name = "متجر التذكارات", Code = {1634034216,1601795189,1987407731,1919512165,1869116255,112}, Level = 0, isPointer = false},
{name = "الحي الصيني", Code = {1634034210,1601795189,1852401763,1869897569,28279,0}, Level = 0, isPointer = false},
{name = "مطعم بيتزا ف الهواء الطلق", Code = {1634034218,1601795189,2054842736,1634300517,1935765599,24948,0}, Level = 0, isPointer = false},
{name = "مقهى المكوك", Code = {1634034216,1601795189,1667330163,1752391525,1819571317,101}, Level = 0, isPointer = false},
{name = "متحف أطلانتس", Code = {1937075486,1601008997,1634497633,1936290926,1769238016,115}, Level = 0, isPointer = false},
{name = "سينما خارجية", Code = {1920234282,1131701605,1835363945,1633902433,1752393067,28783}, Level = 0, isPointer = false},
{name = "متعة التسوق", Code = {1918985000,1667322484,1818386277,1718313825,16﻿33970546﻿,121}, Lev﻿el = 0, i﻿sPointer =﻿ false},
{name = "مقهى القراصنه ", Code = {1970426918,1601399651,1634888016,1765959028,1869771891,25856}, Level = 0, isPointer = false},
{name = "منشأة إنسومانيا", Code = {1936607530,1819042164,1869182049,1850302318,1852665715,24937}, Level = 0, isPointer = false},
{name = "توربينات الرياح", Code = {1952806414,1801550194,1734304768,1700950629,1929404786,0} , Level = 0, isPointer = false},
{name = "ورشة الكاتب", Code = {1919120168,1869901929,1836411250,1684368735,1635149161,108}, Level = 0, isPointer = false},
{name = "ورشة النحات", Code = {1969451808,1869901932,1851875186,1852139875,-368902028,111}, Level = 0, isPointer = false},
{name = "مولف ضخم ", Code = {1937067286,1398760297,1701733731,0,-388697088,111}, Level = 0, isPointer = false},
{name = "عربة نقانق", Code = {1969320740,1701273971,1936028255,1634889588,7499636,111}, Level = 0, isPointer = false},
{name = "الإبرة الفضائية", Code = {1634759452, 1701733731, 1701602405, 3241567, 0, 0}, Level = 0, isPointer = false},
{name = "بطولة الجرافيتي ", Code = {1969317218,1734310260,1717985650,1600746601,1886220131,1953068133,7237481}, Level = 27, isPointer = true},
{name = "بيت التوابل", Code = {1851877492,1768387435,1735289206,1734702687,1650553957,1867015532,6648693}, Level = 27, isPointer = true},
{name = "ساحة الحصاد الكبيرة", Code = {1851877492,1768387435,1735289206,1734702687,1650553957,1817208172,6644577}, Level = 27, isPointer = true},
{name = "لوحة الغوص", Code = {1969317218,1147107700,1852405353,2003784807,1868526181,1886222700,6578537}, Level = 27, isPointer = true},
{name = "حشد ﻿متحمس﻿", Code = {1920291604,1698979686,7499619,1768714096,1694524782,0}, Level = 0, isPointer = false},
{name = "مسرح مفتوح", Code = {1920291602,1632853862,25964,1768714096,1694524782,0}, Level = 0, isPointer = false},
{name = "موقع التخييم", Code = {1667592275, 1114399081, 1953849701, 1866620793, 1919510126, 1835090789, 1701052528, 0}, Level = 25, isPointer = true},
{name = "مدينة راعي البقر", Code = {1667592275, 1114399081, 1953849701, 1750359929, 1214604658, 1702065519, 115, 0}, Level = 25, isPointer = true},
{name = "كوخ صانع الطعوم", Code = {1969317218,1935636852,1869111653,1600484213,1868784996,1769234802,28271}, Level = 26, isPointer = true},
{name = "عربة بيتزا ساخنة", Code = {1667592275,1114399081,1953849701,1918132089,1131111285,1768975713,50358126}, Level = 26, isPointer = true},
{name = "مقهى آيس كريم", Code = {1667592275, 1114399081, 1953849701, 1667850105, 1919115109, 1601003877, 1701208419, 0}, Level = 28, isPointer = true},
{name = "أصدقاء متمرسون في الطيران", Code = {1667592275, 1114399081, 1953849701, 1968332665, 2036430702, 1886546241, 1701732716, 0}, Level = 28, isPointer = true},
{name = "مركز أبحاث", Code = {1969317218, 1700755828, 1919250552, 1852140905, 1634492276, 1634889570, 2037542772, 0}, Level = 28, isPointer = true},
{name = "حصاد عملاق", Code = {1851877492, 1768387435, 1735289206, 1734702687, 1650553957, 1631741﻿﻿292, 19528﻿03699, 0}, Level = 28, isPointer = true},
{name = "الحانة", Code = {1667592275, 1114399081, 1953849701, 1699569529, 1986357604, 1632922729, 1852990838, 1049231457 }, Level = 29, isPointer = true},
{name = "البرج الفلكي", Code = {1667592275, 1114399081, 1953849701, 1933664121, 1819243﻿124, 1919248239, 1702326100, 1040187506 }, Level = 29, isPointer = true}, 
{name = "طاحونة الشوكولاتة", Code = {1869103914, 1634496355, 1632003444, 1919906915, 1667581049, 29295}, Level = 0, isPointer = false},
{name = "منطقة التخفيضات", Code = {1818317588, 1970361189, 6648417, 1919906816, 1667581049, 29295}, Level = 0, isPointer = false},
{name = "وضع علامة", Code = {1634493960, 103, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "المسرح رباعي الأبعاد", Code = {1869576724,1852400479,6384997,111,878968932,0}, Level = 0, isPointer = false},
{name = "قاعة المشاهير", Code = {1818314770,1632001900,25965,1818321529,7471212,111}, Level = 0, isPointer = false},
{name = "مقهى 1", Code = {1869576722,1717658463,25958,111,878968932,0}, Level = 0, isPointer = false},
{name = "متجر الآيس كريم", Code = {1869576738,1701013855,1634038371,1752391533,872444015,0}, Level = 0, isPointer﻿ = ﻿false},
{name = "متجر الهدايا", Code = {1869576720,1869116255,1634009200,1752391533,872444015,0}, Level = 0, isPointer = false},
{name = "المطعم 1", Code = {1869576732,1936028255,1920295284,7630433,872444015,0} , Level = 0, isPointer = false},
{name = "مصنع المشروبات", Code = {1869576740,1668244319,1767994475,1953718124,6648431,0}, Level = 0, isPointer = false},
{name = "المطعم 2", Code = {1801546258,1851880033,1694523748,0,0,0}, Level = 0, isPointer = false},
{name = "مركز الفنون", Code = {1852133406,1215064419,1702065519,1953653087}, Level = 0, isPointer = false},
{name = "مركز المملكة", Code = {1852394266,1836016743,195﻿339193﻿9,1761633650,1761607800,26478}, Level = 0, isPointer = false},
{name = "كشك الهاتف", Code = {1869115410,1650419054,1912633455,7209075}, Level = 0, isPointer = false},
{name = "برنامج طهي", Code = {1869571614,1869116260,1969381239,1919﻿248242}, Level = 0, isPointer = false},
{name = "حديقة المصغرات", Code = {1852394776,2003784809,1768452974,1912602736,1694528000,114}, Level = 0, isPointer = false},
{name = "مجموعة الأفلام الغربية", Code = {1818851102,1936029540,1768120180,1634559342}, Level = 0, isPointer = false},
{name = "مقهى صيفي", Code = {1836405526,1601332589,1701208387,0}, Level = 0, isPointer = false},
{name = "منجم ذهب", Code = {1819232024,1766088548,1919248231,115}, Level = 0, isPointer = false},
{name = "محطة الاتصالات", Code = {1852785438,1952671086,1635013471,1852795252,1912602624,0}, Level = 0, isPointer = false},
{name = "متجر الكتب", Code = {1869562388,1951620971,6648431,116}, Level = 0, isPointer = false},
{name = "متجر زهور ", Code = {1869366808,1601332599,1919906899,101}, Level = 0, isPointer = false},
{name = "مسار الحبال", Code = {1667580956, 1381986927, 1885696111, 7041633, 0, 0}, Level = 0, isPointer = false},
{﻿name = "السوق المتنقل", Code = {1651461402, 1600482409, 1802658125, 1845523557, 0, 0}, Level = 0, isPointer = fal﻿se},
{name = "متجر منتجات عضوية", Code = {1735544600, 1667853921, 1869108063, 1851850864, 0, 0}, Level = 0, isPointer = false},
{name = "استديو تغيير المظهر", Code = {1818317600,1601073007,2036429383,1937076045,7471205,111}, Level = 0, isPointer = false},
{name = "منزل المأمور", Code = {1634488342, 1147104110, 1919902565, 0, 0, 0}, Level = 0, isPointer = false},
{name = "سفاري حضرية", Code = {1634488340, 1247767406, 7365989, 1667329399, 1701734760, 0}, Level = 0, isPointer = false},
{name = "عرض الخضراوات", Code = {1634297644, 1700164718, 1635018087, 1936026722, 1936028255, 6649187}, Level = 0, isPointer = false},
{name = "مقهى الروبوت", Code = {1651470882, 1717658479, 1633902437, 1752393067, 1929408623, 29440}, Level = 0, isPointer = false},
{name = "قاعدة إطلاق المركبات الفضائية", Code = {1634751254, 1867670883, 1952803683, 0, 0, 0}, Level = 0, isPointer = false},
{name = "الحياة على الطريق", Code = {1634890794, 1768711542, 1918134126, 1600873333, 1668506994,﻿ 25973}, ﻿Level = 0, isPointer = false},
{name = "رادار الأطباق الطائرة", Code = {1684107786, 1644196449, 0, 0, 0, 0}, Level = 0, isPointer = false},
{name = "متجر ورق البردي", Code = {1634886444, 1836282982, 1868000865, 1852402546, 1734696807, 7630969}, Level = 0, isPointer = false},
{name = "طقم الفيلم", Code = {1634038572, 1433300851, 1951625062, 1869177973, 1852400479, 6384997}, Level = 0, isPointer = false},
{name = "مدرج مكشوف", Code = {1701344296, 1919251553, 1868915791, 1851875182, 1852139875, 7602292}, Level = 0, isPointer = false},
{name = "ملعب الرجبي", Code = {1735750170, 1935636834, 1768186228, 28021, 0, 0}, Level = 0, isPointer = false},
{name = "برج الحراسة", Code = {1718184986, 1635084133, 1751082098, 29813, 0, 0}, Level = 0, isPointer = false},
{name = "عازف الأرجن", Code = {1735552790, 1834970721, 1667855221, 0, 0, 0}, Level = 0, isPointer = false},
{name = "مطعم على الطريق", Code = {1717658390, 1701994341, 1702191987, 0, 0, 0}, Level = 0, isPointer = false},
{name = "سوق المزارعين", Code = {1767990806, 1701994354, 1702191987, 0, 0, 0}, Level = 0, isPointer = false},
{name = "عرض متنقل", Code = {1919501084,1601402211,1886216515,6778473,1694524672,0}, Level = 0, isPointer = false},
{name = "معرض الأزياء", Code = {1935754784,1852795240,1970225759,1970366836,1912602725,0,-387072416,111}, Level = 0, isPointer = false},
{name = "قرن الوفرة", Code = {1919895576,1632132974,1936029298,1970339956,1912602725,0} , Level = 0, isPointer = false},
{name = "بلازا باريسية", Code = {1918980120,1398764393,1701147252,116,-388697088,111}, Level = 0, isPointer = false},
{name = "منزل المصريين", Code = {1970227226,1732601203,1769238649,1929408097,7368552,6357102}, Level = 0, isPointer = false},
{name = "متجر الموسيقى ", Code = {1936607524,1836413556,1467248229,1936421487,7368552,6357102}, Level = 0, isPointer = false},
{name = "جرامافون دوار", Code = {1937067292,1631806313,1937076082,6646885,-368902043,111}, Level = 0, isPointer = false},
{name = "مطبخ ميداني", Code = {1953065754,1852139619,1634496607,1845521262,1711305317,7536741}, Level = 0, isPointer = false},
{name = "منطقة موسيقية", Code = {1937075492,1968268137,1702130273,1970102130,6515059,7536741}, Level = 0, isPointer = false},
{name =" مدرسة البستاني", Code = {1970239774,1734305646,1701081697,1936876910,3670016,7566444}, Level = 0, isPointer = false},
{name = "بيت بحوض سمك", Code = {1970364714,1969844833,1970227309,1717527923,1768452969,26478}, Level = 0, i﻿sPointer = false},
{name = "قرية الفاكهة ", Code = {1970431518,1632662633,1801415538,1701210478,1752392960,28783}, Level = 0, isPointer = false},
{name = "تجارب مجموعة الطيران", Code = {1952803354,1801675120,1634496607,1694524782,1752392960,28783}, Level = 0, isPointer = false},
{name = "بيت المعكرونة", Code = {1936020000,1634889588,1114795892,1684826485,3276850,3748974}, Level = 0, isPointer = false},
{name = "حي الديسكو", Code = {1936278564,1698983779,1634889571,1852795252,3690579,7566444}, Level = 0, isPointer = false},
{name = "متحف الأفلام ", Code = {1987013910,1968006505,1836410227,1953652992,-388697088,111}, Level = 0, isPointer = false},
{name = "الأضواء الكاميرا الحركة ", Code = {1987013914,1867343209,1701672302,1694528622,1852732672,29285}, Level = 0, isPointer = false},
{name = "دراجة القهوة", Code = {1667592275, 1114399081, 1953849701, 1869438841, 1701603682, 1718575967, 1600480614, 1668641396, 854589547}, Level = 33, isPointer = true},
{name = "العرش القديم", Code = {1919448102,1214606959,1600941153,1768187245,1818326629,0}, Level = 0, isPointer = false}
        }
    },
    {
        name = "⚓ زينـات ساحليـة وبحريـة 🏖️",
        items = {
{name = "ممر الانتظار", Code = {1﻿634890762, 805333859, 7234816, 1701999711, 875585381, 0}, Level = 0, isPointer = false},
{name = "مقاعد في الشمس", Code = {1634496532, 1597205358, 7235942, 17﻿019700﻿30, 875585381, 0}, Level = 0, isPointer = false},
{name = "مقاعد ف الشمس", Code = {163449653﻿2, 1597074286, 7235942, 3307569, 875585381﻿, 0}, Level = 0, isPointer = false},
{name = "قارب على الشاطئ", Code = {1634689556, 1596993652, 7235942, 3307569, 875585381, 0}, Level = 0, isPointer = false},
{name = "حانة تيكي", Code = {1918984718, 1852401247, 1768316672, 3276910, 875585381, 0}, Level = 0, isPointer = false},
{name = "حمام سباحة", Code = {1869574152, 1952383084, 1835365487, 3276800, 875585381, 0}, Level = 0, isPointer = false},
{name = "برج المراقبة", Code = {1869573146,1953853291,1768910943,29806,-416496384,111}, Level = 0, isPointer = false},
{name = "مقهى مشروبات شاطئي", Code = {1802064912,1631739753,1952514162,1694524789,7340133,111}, Level = 0, isPointer = false},
{name = "أرجوحة زهرية", Code = {1853178400,1869373799,1634230135,1668246893,7340139,111}, Level = 0, isPointer = false},
{name = "الكرة الطائرة الشاطئية", Code = {1634026016, 1985964131, 1701604463, 1818321529, 7471212, 0}, Level = 0, isPointer = false},
{name = "طاهي السلطعون", Code = {1634878226, 1866686306, 1912630127﻿, 0﻿, 0,﻿ 0}﻿, L﻿﻿evel = 0, isPointer = false},
{name = "كوخ شاطئي", Code = {1634486044, 1852403821, 1867013991, 6648693, 0, 0}, Level = 0, isPointer = false},
{name = "الواحة", Code = {1634885912, 1600350562, 1769169263, 1852113011, 0, 0}, Level = 0, isPointer = false},
{name = "جادة قصيرة", Code = {1918988306,828322411,12664,1701999711,875585381,0}, Level = 0, isPointer = false},
{name = "جادة طويلة", Code = {1918988306,828322155,12920,3307569,875585381,0}, Level = 0, isPointer = false},
{name = "اللوح الأول", Code = {1920291606,1699897190,1818326126,1694524672,7340133,111}, Level = 0, isPointer = false},
{name = "كنز بالداساري", Code = {1919512614,1399157857,1601202536,1634038388,1701999987,0}, Level = 0, isPointer = false},
{name = "مدفع الفاكهة", Code = {1970431524,1817408617,1852400489,1852530535,6645353,28783}, Level = 0, isPointer = false},
{name = "مدفع بحري", Code = {1701860138,1818323299,1969317186,1398765940,1198549352,28277}, Level = 0, isPointer = false},
{name = "مرساة الأميرالية", Code = {1701860134,1818323299,1969317186,1633646964,1919902574,0}, Level = 0, isPointer = false},
{name = "فرس البحر", Code = {1701860140,1818323299,1969317186,1935636852,1869111653,6648690}, Level = 0, isPointer = false},
{name = "صيد الأخطبوط", Code = {1701860138,1818323299,1969317186,1868527988,1886352483,29557}, Level = 0, isPointer = false},
{name = "الجسر الأحمر", Code = {1667592275, 1114399081, 1953849701, 1701994361, 1769095780, 6645604}, Level = 23, isPointer = true},
{name = "السرطان الناسك", Code = {1634034216,1601795189,1668178275,1751085669,1768780389,116}, Level = 0, isPointer = false},
{name = "نادي الغواصة الصفراء", Code = {1634034220,2036295779,1869376613,1970495351,1918987618,6647401}, Level = 0, isPointer = false},
{name = "مقهى عصير شجرة النخيل", Code = {1634034206,1885300835,2037674593,1918984799,0,0}, Level = 0, isPointer = false},
{name = "معسكر القراصنة", Code = {1634034216,1601795189,1953653104,1768972153,1702125938,115}, Level = 0, isPointer = false},
{name = "القائد الأسطوري", Code = {1667592275, 1114399081, 1953849701, 1631805305, 1767994480, 1635013486, 1399158132, 1869832549, 853606510}, Level = 33, isPointer = true},
{name = "الحق بجولة ركوب الأمواج", Code = {1634034208,1601795189,1718773107,1869574239,108,0}, Level = 0, isPointer = false},
{name = "أرجوحة الشاطئ", Code = {1634034210,1601795189,1852405619,1634754407,28012,0}, Level = 0, isPointer = false},
{name = "حانة عصير جوز الهند", Code = {1634034212,1601795189,1868787523,1601467758,7496034,0}, Level = 0, isPointer = false}
        }
    },
    {
        name﻿ = ﻿" 🌼 ز﻿ينات عيد الفصح 🐇 ",
        items = {
{name = "توبياري البيض", Code = {1667592275, 1114399081, 1953849701, 1869897593, 1918986608, 1734696825, 103, 0}, Level = 25, isPointer = true},
{name = "عربة ممتلئة بالهدايا", Code = {1667592275,1114399081,1953849701,163193﻿6377,1919251571,1651341651,1124101231}, Level = 26, isPointer = true},
{name = "تمثال الأرنب الموهوب", Code = {1667592275,1114399081,1953849701,1631936377,1919251571,1650614610,1124103273}, Level = 26, isPointer = true},
{name = "بيضة فابرجي", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1650542175, 1701278309, 6776645 }, L﻿evel = ﻿31, isPointer = true},
{name = "بيض فابرجيه", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1650542175, 1701278309, 1600612165, 1702194274}, Level = 36, isPointer = true},
{name = "توبياري عيد الفصح", Code = {1667592275,1114399081,1953849701,1631936377,1919251571,1768976212,7959137}, Level = 27, isPointer = true}, 
{name = "متجر عيد الفصح", Code = {1819230994,1163883119,1946183527,26368}, Level = 0, isPointer = false},
{name = "متاهة عيد الفصح", Code = {1650551840, 1852404345, 1700751476, 1702130529, 1952514162, 0}, Level = 0, isPointer = false},
{name = "كنز الأرانب", Code = {1935754524,1601332596,1852732770,7562601,1702129249,28274}, Level = 0, isPointer = false},
{name = "بيت الأرانب", Code = {1935754518,1400006004,1886221684,6582784,-368251072,111}, Level = 0, isPointer = false},
{name = "منزل أرنب عيد الفصح", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1650545247, 1215588706, 1702065519}, Level = 32, isPointer = true},
{name = "دمية أرنب", Code = {1667592275, 1114399081, 1953849701, 1631936377, 1919251571, 1935754591, 1114793332, 2037280373}, Level = 32, isPointer = true},
{name = "أرجوحة عيد الفصح", Code = {1935762714,1215456628,1869442401,27491,-368251072,111}, Level = 0, isPointer = false},
{name = "سكة حديد عيد الفصح", Code = {1935762716,1383228788,1919707489,6578543,-368251072,111}, Level = 0, isPointer = false},
{name = "ورشة عيد الفصح", Code = {1935762716,1601332596,1952670054,7959151,-368251072,111}, Level = 0, isPointer = false},
{name = "متعة عيد الفصح", Code = {1935762720,1752327540,1702065519,1701999711,7340133,111} , Level = 0, isPointer = false},
{name = "قرية الآرانب", Code = {1935754526,846357876,1144467760,1919902565,3289344,3748974}, Level = 0, isPointer = false},
{name = "رشاش مياه عيد الفصح", Code = {1952544548,1852404325,1851868007,1935762783,7497076,101}, Level = 0, isPointer = false}
        }
    },
    {
        name = "🎉 زينـات الأحداث 🎊",
        items = {
{name = "طاحونة هواء الهالوين", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3289710}, Level = 0, isPointer = false},
{name = "قرية سانتا", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3486318}, Level = 0, isPointer = false},
{name = "بوابة سايبر سيتي", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3421038}, Level = 0, isPointer = false},
{name = "مكتب المأمور", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3617646}, Level = 0, isPointer = false},
{name = "نادي الجاز", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3683182}, Level = 0, isPointer = false},
{name = "العربية المشؤومة", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3748718}, Level = 0, isPointer = false},
{name = "بوابة الفايكنج", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3159150}, Level = 0, isPointer = false},
{name = "ديك الحبش الوفير", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3224686}, Level = 0, isPointer = false},
{name = "شاليه جبلي", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3355758}, Level = 0, isPointer = false},
{name = "مذبح باستيت", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3421294}, Level = 0, isPointer = false},
{name = "الريشة الذهبية", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3486830}, Level = 0, isPointer = false},
{name = "دراكار الفايكنج ", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3552366}, Level = 0, isPointer = false},
{name = "منطقة تصوير القراصنة", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3748974}, Level = 0, isPointer = false},
{name = "مسرح خارجي", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3683438}, Level = 0, isPointer = false},
{name = "نافورة المياه الحية", Code = {1886930220,1953064037,1148088169,1919902565,1869182049,3617902}, Level = 0, isPointer = false}
        }
    }
}

local Decors = {
{Name = "أبطال الحديقة القديمة (القاعدة)", Code = {1886930216, 1953064037, 1148088169, 1919902565, 1869182049, 110}, Level = 0, isPointer = false},
{Name = "أبطال الحديقة القديمة ( الجزء الأول)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1935761955, 101, 0}, Level = 26, isPointer = true},
{Name = "أبطال الحديقة القديمة (الجزء الثاني)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1918988323, 12916, 0}, Level = 27, isPointer = true},
{Name = "أبطال الحديقة القديمة (الجزء الثالث)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1918988323, 12660, 0}, Level = 27, isPointer = true},
{Name = "ملكة جزيرة السلحفاة (القاعدة)", Code = {1886930218, 1953064037, 1148088169, 1919902565, 1869182049, 12910}, Level = 0, isPointer = false},
{Name = "ملكة جزيرة السلحفاة (كاملة)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738994, 3372146, 0}, Level = 27, isPointer = true},
{Name = "حارس الشمال (القاعدة)", Code = {1886930218, 1953064037, 1148088169, 1919902565, 1869182049, 13166}, Level = 0, isPointer = false},
{Name = "حارس الشمال (كامل)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738995, 3241074, 0}, Level = 27, isPointer = true},
{Name = "أوديسة القراصنة (القاعدة)", Code = {1886930218, 1953064037, 1148088169, 1919902565, 1869182049, 13422}, Level = 0, isPointer = false},
{Name = "أوديسة القراصنة (كاملة)", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738996, 3241074, 0}, Level = 27, isPointer = true},
{Name = "سنترال بارك", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738993, 3372146, 0, 0}, Level = 23, isPointer = true},
{Name = "مركز المجتمع الصيني", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738994, 3372146, 0, 0}, Level = 23, isPointer = true},
{Name = "حديقة بيئية بطابع قوس قزح", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738995, 3372146, 0, 0}, Level = 23, isPointer = true},
{Name = "جولة الذواقة", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738996, 3372146, 0, 0}, Level = 23, isPointer = true},
{Name = "المعرض الزراعي", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738997, 3306610, 0, 0}, Level = 23, isPointer = true},
{Name = "مجمع رياضي", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738998, 3306610, 0, 0}, Level = 23, isPointer = true},
{Name = "عالم البطاريق", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634738999, 3306610, 0, 0}, Level = 23, isPointer = true},
{Name = "صالة ديسكو", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634739000, 3241074, 0, 0}, Level = 23, isPointer = true},
{Name = "معرض الفنون والحرف اليدوية", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1634739001, 3241074, 0, 0}, Level = 23, isPointer = true},
{Name = "موقع مخيم مريح", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1881354289, 829715041, 0, 0}, Level = 24, isPointer = true},
{Name = "حفل شاطئي", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1881354545, 829715041, 0, 0}, Level = 24, isPointer = true},
{Name = "قلب إيطاليا", Code = {1735550285, 1698968165, 1634889571, 1852795252, 1881354801, 829715041, 0, 0}, Level = 24, isPointer = true},
{Name = "ميجاليث الوحش الثلجي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738997, 3241074, 0}, Level = 27, isPointer = true},
{Name = "منتجع فندقي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738998, 3241074, 0}, Level = 27, isPointer = true},
{Name = "منتزه ترفيهي نباتي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634738999, 3241074, 0}, Level = 27, isPointer = true},
{Name = "متحف مملكة بوسيدون", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634739000, 3241074, 0}, Level = 27, isPointer = true},
{Name = "مركز ابحاث الحالات الشاذه الطبيعة", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1634739001, 3241074, 0}, Level = 27, isPointer = true},
{Name = "قصر ذكي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881354289, 829715041, 0}, Level = 28, isPointer = true},
{Name = "منزل الغزال الذهبي الريفي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881354545, 829715041}, Level = 28, isPointer = true},
{Name = "نافورة اللوتس المجمدة", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881354801, 829715041, 0}, Level = 28, isPointer = true},
{Name = "مسرح باندورا القديم", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881355057, 829715041, 0}, Level = 28, isPointer = true},
{Name = "صوبة ملكة الدبابير", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881355313, 829715041, 0}, Level = 28, isPointer = true},
{Name = "منشأة أبحاث فضائية", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881355569, 829715041, 0}, Level = 28, isPointer = true},
{Name = "مكتبة الشجرة", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881355825, 829715041, 0}, Level = 28, isPointer = true},
{Name = "قاعدة التخييم وسط الطبيعية", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881356081, 829715041, 0}, Level = 28, isPointer = true},
{Name = "المقهى الكوني", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881356337, 829715041, 0}, Level = 28, isPointer = true},
{Name = "حديقة أرض القرود المائية", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881356593, 829715041, 0}, Level = 28, isPointer = true},
{Name = "ملاذ جبلي", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881354290, 829715041, 0}, Level = 28, isPointer = true},
{Name = "حديقة ترفيهية رائعة", Code = {1701869637, 1769236836, 1698983535, 1634889571, 1852795252, 1881354546, 829715041, 0}, Level = 28, isPointer = true}
}
   
local skin_searches = {
    TRAIN = {code = "1768641318;1918132078;1953719654;1768649482;29550::125", refine = 1768641318},
    HELICOPTER = {code = "1768641322;1699241838;1768641322;1683976805;1868788585::89", refine = 1768641322},
    PLANE = {code = "1768641322;1765891950;1768641322;1935763039;1852795240::89", refine = 1768641322},
    TRAIN_STATION = {code = "1768641322;1399744865;1852795252;944788319;1768649482;29550::125", refine = 1768641322},
    HELICOPTER_PAD = {code = "49;24;1600480097;7300693;1768649482;29550::125", refine = 49},
    AIRPORT = {code = "1768641320;1765891950;1752392038;7237481;1768649482;29550::125", refine = 1768641320},
    SHIP = {code = "1768641310;1784639593;1768641320;1885432415;28257::85", refine = 1768641310},
    PORT = {code = "1768641314;1632132974;1885432415;28257;1768649482;29550::125", refine = 1768641314},
    COW = {code = "1768641314;1866686318;1986622579;27745;1768649482;29550::125", refine = 1768641314},
    CHICKEN = {code = "1768641322;1749245806;808612722;13618;1768649482;29550::125", refine = 1768641322},
    SHEEP = {code = "49;23;808614241;13618;1768649482;29550::125", refine = 49},
    PIG = {code = "1768641304;1766874990;5852739;1768649482;29550::125", refine = 1768641304},
    ISLAND = {code = "49;28;1886930214;1953064037;1768649482;29550::125", refine = 49}
}

local skins = {
    TRAIN = {
    {name = "قطار الزهور", offset = 0}, {name = "القطار الاسطوري", offset = 0xB8},
    {name = "قطار غاتسبي", offset = 0xB8 * 2}, {name = "القطار الفرنسي", offset = 0xB8 * 3},
    {name = "قطار المشاهير", offset = 0xB8 * 4}, {name = "قطار مستقبلي", offset = 0xB8 * 5},
    {name = "قطار الصيف", offset = 0xB8 * 6}, {name = "قطار عيد الميلاد", offset = 0xB8 * 7},
    {name = "قطار الهالوين", offset = 0xB8 * 8}, {name = "الترام السريع", offset = 0xB8 * 9},
    {name = "قطار الفرسان", offset = 0xB8 * 10}, {name = "قطار الموسيقى السريع", offset = 0xB8 * 11},
    {name = "العربة الخشبية", offset = 0xB8 * 12}, {name = "مسبار المريخ", offset = 0xB8 * 13},
    {name = "قطار التنين", offset = 0xB8 * 14}, {name = "قطار مسرحي سريع", offset = 0xB8 * 15},
    {name = "قطار بدائي سريع", offset = 0xB8 * 16}, {name = "قطار عيد الفصح السريع", offset = 0xB8 * 17},
    {name = "قطار الكريسماس", offset = 0xB8 * 18}, {name = "قطار رعاة البقر", offset = 0xB8 * 19},
    {name = "قطار الديسكو", offset = 0xB8 * 20}, {name = "قطار الأشباح", offset = 0xB8 * 21},
    {name = "القطار المستقبلي السريع", offset = 0xB8 * 22}
},
    HELICOPTER = {
    {name = "هليكوبتر الديسكو", offset = 0}, {name = "هليكوبتر الفضاء", offset = 0xB8},
    {name = "هليكوبتر رول آند روك", offset = 0xB8 * 2}, {name = "هليكوبتر مروحية الكريسماس", offset = 0xB8 * 3},
    {name = "هليكوبتر مروحية الربيع", offset = 0xB8 * 4}, {name = "هليكوبتر مروحية إيطالية", offset = 0xB8 * 5},
    {name = "مروحية أعماق البحار", offset = 0xB8 * 6}, {name = "هليكوبتر قاعة الرقص", offset = 0xB8 * 7},
    {name = "هليكوبتر الاحتفالية", offset = 0xB8 * 8}, {name = "هليكوبتر القراصنة", offset = 0xB8 * 9},
    {name = "هليكوبتر ريشة", offset = 0xB8 * 10}, {name = "هليكوبتر المرجل الطائر", offset = 0xB8 * 11},
    {name = "هليكوبتر سفينة المراقبة الهوائية", offset = 0xB8 * 12}, {name = "هليكوبتر قرع العسل", offset = 0xB8 * 13},
    {name = "هليكوبتر دراجة", offset = 0xB8 * 14}, {name = "هليكوبتر السفينة الطائرة", offset = 0xB8 * 15},
    {name = "هليكوبتر طائرة على شكل أريكة", offset = 0xB8 * 16}, {name = "هليكوبتر بساط طائر", offset = 0xB8 * 17},
    {name = "هليكوبتر الباذنجانة", offset = 0xB8 * 18}, {name = "هليكوبتر خاصة", offset = 0xB8 * 19},
    {name = "هليكوبتر مزلقة مساعد سانتا", offset = 0xB8 * 20}, {name = "هليكوبتر موصل آلي", offset = 0xB8 * 21},
    {name = "هليكوبتر الطبق الطائر", offset = 0xB8 * 22}
},
    PLANE = {
        {name = "طائرة الموضة", offset = 0}, {name = "الطائرة العربية", offset = 0xB8},
        {name = "طائرة مصاص الدماء", offset = 0xB8 * 2}, {name = "طائرة الكرنفال", offset = 0xB8 * 3},
        {name = "طائرة الطهي", offset = 0xB8 * 4}, {name = "طائرةالسيمفونية", offset = 0xB8 * 5},
        {name = "طائرة مائية", offset = 0xB8 * 6}, {name = "طائرة شبح", offset = 0xB8 * 7},
        {name = "طائرة الحظ", offset = 0xB8 * 8}, {name = "زلاجة هوائية", offset = 0xB8 * 9},
        {name = "طائرة الإكلير", offset = 0xB8 * 10}, {name = "طائرة على شكل طائر", offset = 0xB8 * 11},
        {name = "طائرة الأعياد", offset = 0xB8 * 12}, {name = "طائرة النجوم", offset = 0xB8 * 13},
        {name = "طائرة روك", offset = 0xB8 * 14}, {name = "مركبة إطلاق", offset = 0xB8 * 15},
        {name = "طائرة الأشباح", offset = 0xB8 * 16}, {name = "طائرة إستوائية", offset = 0xB8 * 18},
        {name = "طائرة إستوائية", offset = 0xB8 * 19}, {name = "تنين خارق", offset = 0xB8 * 20},
        {name = "الطائرة الضخمة", offset = 0xB8 * 21}
    },
    TRAIN_STATION = {
    {name = "رعاة البقر", offset = -0xB8}, {name = "محطة الكريسماس", offset = -0xB8 * 2},
    {name = "محطة عيد الفصح", offset = -0xB8 * 3}, {name = "مستوطنة قديمة", offset = -0xB8 * 4},
    {name = "محطة مسرحية", offset = -0xB8 * 5}, {name = "محطة صينية", offset = -0xB8 * 6},
    {name = "محطة فضاء", offset = -0xB8 * 7}, {name = "معسكر تدريب", offset = -0xB8 * 8},
    {name = "مركز التسجيل", offset = -0xB8 * 9}, {name = "محطة القلعة", offset = -0xB8 * 10},
    {name = "محطة رومانية", offset = -0xB8 * 11}, {name = "محطة الهالوين", offset = -0xB8 * 12},
    {name = "محطة عيد الميلاد", offset = -0xB8 * 13}, {name = "محطة الصيف", offset = -0xB8 * 14},
    {name = "قطار مستقبلية", offset = -0xB8 * 15}, {name = "محطة مشاهير", offset = -0xB8 * 16},
    {name = "محطة الفرنسية", offset = -0xB8 * 17}, {name = "محطة قطار غاتسبي", offset = -0xB8 * 18},
    {name = "محطة الاسطورية", offset = -0xB8 * 19}, {name = "محطة الزهور", offset = -0xB8 * 20}
},
    HELICOPTER_PAD = {
    {name = "حظيرة الطبق الطائر", offset = 0}, {name = "محطة رسو السفن", offset = -0xB8},
    {name = "موقف المزلقة", offset = -0xB8 * 2}, {name = "مهبط طائرات هليكوبتر خاص", offset = -0xB8 * 3},
    {name = "مهبط الطائرة الهليكوبتر النباتي", offset = -0xB8 * 4}, {name = "قصر السلطان", offset = -0xB8 * 5},
    {name = "مهبط طائرة هليكوبتر خمس نجوم", offset = -0xB8 * 6}, {name = "ميناء المتجولين", offset = -0xB8 * 7},
    {name = "مهبط رياضي", offset = -0xB8 * 8}, {name = "البرج المسكون", offset = -0xB8 * 11},
    {name = "منصة الكرنفال", offset = -0xB8 * 12}, {name = "مهبط طائرات الفصح", offset = -0xB8 * 13},
    {name = "قصر الأعماق", offset = -0xB8 * 14}, {name = "مهبط الطائرة الهليكوبتر للقراصنة", offset = -0xB8 * 15},
    {name = "مهبط الطائرة الهليكوبتر الاحتفالي", offset = -0xB8 * 16}, {name = "مهبط طائرة هليكوبتر لقاعة الرقص", offset = -0xB8 * 17},
    {name = "حظيرة أعماق البحار", offset = -0xB8 * 18}, {name = "حظيرة طائرات إيطالية", offset = -0xB8 * 19},
    {name = "مهبط الربيع", offset = -0xB8 * 20}, {name = "مهبط طائرة هليكوبترالكريسماس", offset = -0xB8 * 21},
    {name = "مهبط طائرة هليكوبتر الروك آند رول", offset = -0xB8 * 22}
},
    AIRPORT = {
        {name = "مطار الموضة", offset = 0}, {name = "مطار عربي", offset = 0xB8},
        {name = "مطار دراكولا", offset = 0xB8 * 2}, {name = "مطار الكرنفال", offset = 0xB8 * 3},
        {name = "مطار الطهي", offset = 0xB8 * 4}, {name = "مطار السيمفونية", offset = 0xB8 * 5},
        {name = "مطار خمس نجوم", offset = 0xB8 * 6}, {name = "قاعدة سرية", offset = 0xB8 * 7},
        {name = "مطار قوس قزح", offset = 0xB8 * 8}, {name = "مطار الفصح", offset = 0xB8 * 11},
        {name = "مسكن سانتا", offset = 0xB8 * 12}, {name = "مطار سينمائي", offset = 0xB8 * 13},
        {name = "مطار الروك", offset = 0xB8 * 14}, {name = "مطار فضائي", offset = 0xB8 * 15},
        {name = "مطار الأشباح", offset = 0xB8 * 16}, {name = "مطار استوائي", offset = 0xB8 * 17},
       {name = "مطار المهرجان ", offset = 0xB8 * 18}, {name = "البوابة الجوية", offset = 0xB8 * 19}
    },
    SHIP = {
    {name = "سفينة العطلة ", offset = -0xB8}, {name = "سفينة اليابانية ", offset = 0},
    {name = "سفينة الفارس", offset = 0xB8}, {name = "سفينة برودواي", offset = 0xB8 * 2},
    {name = "سفينة عيد الفصح", offset = 0xB8 * 3}, {name = "سفينة الرحلة", offset = 0xB8 * 4},
    {name = "سفينة الحصاد", offset = 0xB8 * 5}, {name = "سفينة القطب الشمالي", offset = 0xB8 * 6},
    {name = "سفينة ذات طابع المصري ", offset = 0xB8 * 7}, {name = "قارب الحلوى ", offset = 0xB8 * 8},
    {name = "باخرة نهرية", offset = 0xB8 * 9}, {name = "سفينة يونانية", offset = 0xB8 * 10},
    {name = "قارب التنين", offset = 0xB8 * 11}, {name = "قارب الهدايا", offset = 0xB8 * 12},
    {name = "سفينة سياحية", offset = 0xB8 * 13}, {name = "سفينة قوية", offset = 0xB8 * 14},
    {name = "قارب الحب", offset = 0xB8 * 15}, {name = "سفينة الاشباح ", offset = 0xB8 * 16},
    {name = "جندول", offset = 0xB8 * 17}, {name = "عبارة كرواسون", offset = 0xB8 * 18},
    {name = "سفينة سياحية ", offset = 0xB8 * 19}, {name = "سفينة القراصنة", offset = 0xB8 * 20}
},
    PORT = {
    {name = "ميناء العطلة", offset = -0xB8}, {name = "ميناء الياباني ", offset = 0},
    {name = "ميناء الفارس", offset = 0xB8}, {name = "ميناء برودواي", offset = 0xB8 * 2},
    {name = "ميناء عيد الفصح", offset = 0xB8 * 3}, {name = "ميناء الرحلة", offset = 0xB8 * 4},
    {name = "ميناء الحصاد", offset = 0xB8 * 5}, {name = "ميناء القطب الشمالي ", offset = 0xB8 * 6},
    {name = "ميناء ذو طابع المصري", offset = 0xB8 * 7}, {name = "ميناء  الحلوى ", offset = 0xB8 * 8},
    {name = "ثالون على الماء", offset = 0xB8 * 9}, {name = "ميناء قديم ", offset = 0xB8 * 10},
    {name = "ميناء الفوانيس", offset = 0xB8 * 11}, {name = "ميناء الكريسماس", offset = 0xB8 * 12},
    {name = "ميناء الغابة", offset = 0xB8 * 13}, {name = "ميناء الفايكنج", offset = 0xB8 * 14},
    {name = "ميناء الرومانسية", offset = 0xB8 * 15}, {name = "ميناء الأهوال", offset = 0xB8 * 16},
    {name = "رصيف اللورد", offset = 0xB8 * 17}, {name = "ميناء جميل", offset = 0xB8 * 18},
    {name = "ميناء استوائي", offset = 0xB8 * 19}, {name = "ميناء القرصان ", offset = 0xB8 * 20}
},
 COW = {
    {name = "بقرة الزهور", offset = 0}, {name = "بقرة عربية", offset = 0xB8},
    {name = "البقرة اليابانية", offset = 0xB8 * 2}, {name = "نظارات شمسية الروك آند رول للأبقار", offset = 0xB8 * 3},
    {name = "البقرة الفرنسية", offset = 0xB8 * 4}, {name = "بقرة الكرنفال", offset = 0xB8 * 5},
    {name = "بقرة المشاهير", offset = 0xB8 * 6}, {name = "بقرة مستقبلية", offset = 0xB8 * 7},
    {name = "بقرة الصيف", offset = 0xB8 * 8}, {name = "بقرة السيمفونية", offset = 0xB8 * 9},
    {name = "بقرة القطب الشمالي ", offset = 0xB8 * 10}, {name = "بقرة القراصنة المعتمدين ", offset = 0xB8 * 11},
    {name = "بقرة احتفالية", offset = 0xB8 * 12}, {name = "بقرة أنيقة", offset = 0xB8 * 13},
    {name = "ملكة أطلانتس", offset = 0xB8 * 14}, {name = "بقرة جاسوسة", offset = 0xB8 * 15},
    {name = "بقرة الفصح", offset = 0xB8 * 16}, {name = "بقرة احتفالية", offset = 0xB8 * 17},
    {name = "بقرة جبلية", offset = 0xB8 * 18}, {name = "مو-سفيراتو", offset = 0xB8 * 19},
    {name = "البقرة صانعة الحلويات ", offset = 0xB8 * 20}, {name = "بقرة عيد الميلاد", offset = 0xB8 * 21},
    {name = "بقرة الاحتفالات ", offset = 0xB8 * 22}, {name = "البقرة رائدة الفضاء", offset = 0xB8 * 23},
    {name = "بقرة مغازلة ", offset = 0xB8 * 24}, {name = "بقرة القزمة", offset = 0xB8 * 25},
    {name = "بقرة سينمائية", offset = 0xB8 * 26}
},
    CHICKEN = {
    {name = "دجاجة الفضاء", offset = 0}, {name = "نظارات شمسية الروك آند رول للدحاج", offset = 0xB8},
    {name = "دجاجة الروك آند رول", offset = 0xB8 * 2}, {name = "دجاجة الفارس", offset = 0xB8 * 3},
    {name = "دجاجة الكريسماس", offset = 0xB8 * 4}, {name = "دجاجة برودواي", offset = 0xB8 * 5},
    {name = "دجاجة عيد الفصح", offset = 0xB8 * 6}, {name = "دجاجة الطهي", offset = 0xB8 * 7},
    {name = "دجاجة الرحلة", offset = 0xB8 * 8}, {name = "دجاجة الحصاد", offset = 0xB8 * 9},
    {name = "الدجاجة الاحتفالية", offset = 0xB8 * 10}, {name = "دجاجة الهالوين", offset = 0xB8 * 11},
    {name = "دجاجة الحفلات", offset = 0xB8 * 12}, {name = "دجاجة احتفالية", offset = 0xB8 * 13},
    {name = "دجاجة في إجازة", offset = 0xB8 * 14}, {name = "دجاجة بثوب يوناني", offset = 0xB8 * 15},
    {name = "دجاجة جنيّة", offset = 0xB8 * 16}, {name = "مساعد سانتا الصغير", offset = 0xB8 * 17},
    {name = "دجاجة عيد الميلاد", offset = 0xB8 * 18}, {name = "دجاجة المستكشفة", offset = 0xB8 * 19},
    {name = "الدجاجة الخيالية", offset = 0xB8 * 20}, {name = "الدجاجة المشجعة", offset = 0xB8 * 21},
    {name = "الدجاج المهرج", offset = 0xB8 * 22}, {name = "دجاج طيارة", offset = 0xB8 * 23}
},
    SHEEP = {
    {name = "الخروف نجم الروك ", offset = 0}, {name = "خروف العطلة", offset = 0xB8},
    {name = "الخروف الأسطوري", offset = 0xB8 * 2}, {name = "نظارات شمسية الروك آند رول للاخراف", offset = 0xB8 * 3},
    {name = "خروف مصاص الدماء", offset = 0xB8 * 4}, {name = "خروف غاتسبي", offset = 0xB8 * 5},
    {name = "خروف الربيع", offset = 0xB8 * 6}, {name = "خروف إيطالي", offset = 0xB8 * 7},
    {name = "خاروف أعماق البحار", offset = 0xB8 * 8}, {name = "خراف قاعة الرقص", offset = 0xB8 * 9},
    {name = "خروف عيد الميلاد", offset = 0xB8 * 10}, {name = "الخراف المصرية", offset = 0xB8 * 11},
    {name = "خروف احتفالي", offset = 0xB8 * 12}, {name = "بيلي بونكا", offset = 0xB8 * 13},
    {name = "عصابة الخرفان", offset = 0xB8 * 14}, {name = "الخروف المقاتل", offset = 0xB8 * 15},
    {name = "خروف الروك آند رول", offset = 0xB8 * 16}, {name = "خروف السامبا", offset = 0xB8 * 17},
    {name = "بانديت النبيلة", offset = 0xB8 * 18}, {name = "خروف عيد الميلاد", offset = 0xB8 * 19},
    {name = "الخروف المحقق", offset = 0xB8 * 20}, {name = "خروف شمالي", offset = 0xB8 * 21},
    {name = "نعجة الفصح", offset = 0xB8 * 22}, {name = "نعجة مهرجان الربيع", offset = 0xB8 * 23},
    {name = "النعجة الساحرة", offset = 0xB8 * 24}
},
    PIG = {
        {name = "خنزير احتفالي", offset = 0}, {name = "خنزير الكيوبيد", offset = 0xB8 * 2}
        
    },
    ISLAND = {
        {name = "جزيرة العطلات", offset = 0}, {name = "جزيرة الآزتك", offset = 0xB8},
        {name = "جزيرة الإنسان البدائي", offset = 0xB8 * 2}, {name = "قرية عيد الفصح", offset = 0xB8 * 3},
        {name = "باريس الصغيرة", offset = 0xB8 * 4}, {name = "القلعة الجليدية", offset = 0xB8 * 5},
        {name = "منزل الساحرة", offset = 0xB8 * 6}, {name = "قصر الساحرة", offset = 0xB8 * 7},
        {name = "قلعة الساحرة", offset = 0xB8 * 8}, {name = "منزل الجزيرة", offset = 0xB8 * 9},
        {name = "قصر جزيرة", offset = 0xB8 * 10}, {name = "مسكن الجزيرة", offset = 0xB8 * 11},
        {name = "كوخ القراصنة", offset = 0xB8 * 12}, {name = "مركز القراصنة", offset = 0xB8 * 13},
        {name = "حصن القراصنة", offset = 0xB8 * 14}        
    }
}


local eve_searchs = {
    ["Event 54"] = {
        name = "جزيرة الهلاك",
        code = {
            [1] = "65537;1886930212;1953064037;1601073001;808466483;3421535::188",
            [2] = "1886930212;1953064037;1601073001;808466483;3421535;1787302800;1789117200::73"
        },
        refine = {
            [1] = "1886930212;1953064037;1601073001;808466483;3421535",
            [2] = "1787302800;1789117200"
        },
        id = 54
    },

    ["Event 55"] = {
        name = "ضيف من الفضاء",
        code = {
            [1] = "65537;1886930212;1953064037;1601073001;808466483;3487071::188",
            [2] = "1886930212;1953064037;1601073001;808466483;3487071;1789117200;1790931600::73"
        },
        refine = {
            [1] = "1886930212;1953064037;1601073001;808466483;3487071",
            [2] = "1789117200;1790931600"
        },
        id = 55
    },

    ["Event 56"] = {
        name = "لا يوجد حتى الان",
        code = {
            [1] = "65537;1886930212;1953064037;1601073001;808466739;3552607::188",
            [2] = "1886930212;1953064037;1601073001;808466739;3552607;1790931600;1792746000::73"
        },
        refine = {
            [1] = "1886930212;1953064037;1601073001;808466739;3552607",
            [2] = "1790931600;1792746000"
        },
        id = 56
    }
}



local tickets_id = {
    { name = "تذكرة الصيف", id = 780 },
    { name = "تذكرة أعماق البحار", id = 790 },
    { name = "تذكرة الحصاد", id = 800 }
}

local ov_gifts = {
    {name = "🚂 ملأ عربة القطار", Code = "1734440714;28271;1701995030;2002742113::157", refine = "2002742113"},
    {name = "🎉 اجتز المستويات من المحاولة الأولى", Code = "1852405540;1835099999;1701995050;2002742113::85", refine = "2002742113"},
    {name = "🎵 النغمات الموسيقية", Code = "1936286754;1667198819;1601009448;1668508004::85", refine = "1668508004"},
    {name = "🎮 معززات الهليكوبتر", Code = "1701995300;1600484449;1601009450;1634038371::85", refine = "1634038371"},
    {name = "📅 سجل الدخول", Code = "1936291346;1683977321;1601009434;1768386412::157", refine = "1768386412"},
    {name = "💵 انفق كاش", Code = "1701868308;1667196014;1601009434;1852141683::157", refine = "1852141683"},
    {name = "🧧 افتح حزم كروت", Code = "1701867302;1633902446;1601009452;1852141679::85", refine = "1852141679"},
    {name = "🛒 نفذ عملية شراء", Code = "1634625810;1633644656;1601009432;1885433449::85", refine = "1885433449"},
    {name = "🟩 دمر قطع خضراء", Code = "1835364900;1600484975;1601009450;1869440370::85", refine = "1869440370"},
    {name = "🃏 احصل ع بطاقات", Code = "1819239212;1952671084;33~49;0;25::89", refine = "0"},
    {name = "🚁 طلبات الهليكوبتر", Code = "1685221132;7565925;25;0;23::161", refine = "0"}
}
local bre_event = {
    {name = "🏁 اجتياز مهام المطابقة", Code = "1852405540;1835099999;1701995050;2002742113::85", refine = "2002742113"},
    {name = "🌈 اصنع كرات قوس قزح", Code = "1701995308;1600484449;33~49;0;28::89", refine = "0"},
    {name = "⚡ انفاق نقاط الطاقة", Code = "1701868318;1700750446;1701995050;1935633249::85", refine = "1935633249"},
    {name = "⛏️ مهام سباق الحفر", Code = "1634759462;1834968419;1701995046;1935633249::85", refine = "1935633249"},
    {name = "🚂 مهام عربة القطار", Code = "1734440714;28271;1701995030;2002742113;1852794721::161", refine = "1852794721"},
    {name = "💎 اكمل مراحل الكنز", Code = "1935762218;1701077347;33~49;0;27::89", refine = "0"},
    {name = "🧭 مهام الرحلة الاستكشافية", Code = "1702257942;1868526702;1919247474;33~49;25;33~49;0;31::161", refine = "0"}
}

local resources = {
    {
        section = "💵 الكاش و الفلوس 💰",
        items = {
            {name = "💵 زيادة الكاش", Code = {1935762184,104,0,0,0,0}},
            {name = "💰 زيادة الفلوس", Code = {1635021594,1600484724,1953067639,29285,0,0}},
            {name = "💠 اكس بي رفع المستوى", Code = {1886938374,0,0,0,0,0}}
        }
    },

    {
        section = "🎟️ القسائم 🎫",
        items = {
            {name = "🎟️ قسيمة الدعم", Code = {1970225964,1282305904,1415864687,1852399986,1886546241,7631471}},
            {name = "🏕️ قسيمة الشونة", Code = {1701996056,1651327333,1850307169,99,1701996056,1651327333}},
            {name = "🗺️ قسيمة التوسيع", Code = {1701996058,1886930277,1769172577,28271,1701996058,1886930277}},
            {name = "🚂 قسيمة ترقية القطار", Code = {1970225956,1433300848,1634887536,1918133604,7235937,0}},
            {name = "🏭 قسيمة ترقية المصانع", Code = {1970225960,1433300848,1634887536,1632003428,1919906915,121}},
            {name = "🏝️ قسيمة الجزيرة", Code = {1970225958,1433300848,1634887536,1934189924,1684955500,0}},
            {name = "🏪 قسيمة موزع السوق", Code = {1970225952,1215197040,1147499113,1701601637,114,0}}
        }
    },

    {
        section = "🧩 معززات المطابقة الثلاثية 🎮",
        items = {
            {name = "⏰ معزز ديناميت بوقت (معزز خارجي)", Code = {1668571469,1866609512,1866621549,1601467247,1415999081,6647145}, Level=23, isPointer=true},
            {name = "⏰ معزز متفجر خط بوقت(معزز خارجي)", Code = {1668571469,1766601576,1866622318,1601467247,1415999081,6647145}, Level=23, isPointer=true},
            {name = "⏰ معزز كرة ديسكو بوقت(معزز خارجي)", Code = {1668571469,1766601576,1853122663,1114074729,1953722223,1718511967,1701669204}, Level=28, isPointer=true},
            {name = "🚀معزز متفجر خط(معزز خارجي)", Code = {1278438668,6647401,0,0,0,0}},
            {name = "💣معزز ديناميت(معزز خارجي)", Code = {1110666508,6450543,0,0,0,0}},
            {name = "🪩معزز كرة ديسكو(معزز خارجي)", Code = {1379101978,1651403105,1631745903,27756,0,0}},
            {name = "🔨معزز المطرقة(معزز داخلي)", Code = {1295215888,1701604449,1835073652,7497069,295108729,120}},
            {name = "🔩معزز المثقاب(معزز داخلي)", Code = {1211329824,2053730927,1635020399,1852394604,295108709,120}},
            {name = "🧰معزز الثقل(معزز داخلي)", Code = {1446210844,1769239141,1282171235,6647401,295108709,120}},
            {name = "🌀معزز المروحة(معزز داخلي)", Code = {1379101974,1969779557,1701602918,6647296,295108709,120}},
            {name = "❤️ قلوب المطابقة بوقت", Code = {1952533798,1278437475,1936029289,1718511967,1701669204,0}},
            {name = "✌🏻 المضاعف الاصفر( ×2)", Code = {1835619372,1850041445,2037672308,1635214674,1816224882,3299436}},
            {name = "✌🏻 المضاعف البنفسج( ×2)", Code = {1701669204,1953383780,1383691369,1918990181,1819033956,1950429784,1886217588,29556}, Level=30, isPointer=true}
        }
    },

    {
        section = "🧪 معززات المختبر 🔬",
        items = {
            {name = "🔮 معزز هليو بنفسج", Code = {1869562402,1884517491,1432642917,1685213040,29285,0}},
            {name = "🌱 معزز زراعة أسرع", Code = {1869562406,1884517491,1432642917,1918978160,1953719670,0}},
            {name = "🚂 معزز قطارات", Code = {1869562404,1884517491,1432642917,1634882672,7564905,0}},
            {name = "🦁 معزز حديقة الحيوانات", Code = {1869562396,1699247219,1937011297,7303002,0,0}},
            {name = "✈️ معزز طيارة ضعف الجولد", Code = {1869562402,1765897331,1919905906,1768899444,29550,0}},
            {name = "🤝 معزز الساعد", Code = {1869562404,1866757235,1701601909,1952670022,7959151,0}},
            {name = "⛏️ معزز منجم", Code = {1869562400,1632400499,1919251566,1852394862,101,0}},
            {name = "⚡ معزز تسريع الإنتاج", Code = {1869562400,1767142515,1632003437,1919906915,121,0}},
            {name = "🌾 معزز ضعف الزرع", Code = {1869562406,1917875315,1668637807,1918978164,1953719670,0}},
            {name = "🚢 معزز السفن", Code = {1869562402,1884517491,1432642917,1768444784,29552,0}},
            {name = "🥛 معزز زيادة إنتاج الحيوانات", Code = {1869562400,1917875315,1668637807,1918977652,109,0}},
            {name = "📦 معزز الشونة", Code = {1869562408,1951626355,1734439535,1885422437,1953063777,121}},
            {name = "🚁 معزز هيلوكيوبتر ضعف العملات", Code = {1869562398,1867347059,1333355886,1919247474,0,0}},
            {name = "🏪 معزز السوق النشط", Code = {1869562398,1767142515,1632462189,1952803698,0,0}},
            {name = "💼 التجارة النشطة", Code = {1869562404,1884517491,1432642917,1634026608,7497068,0}},
            {name = "📈 الطلب الكبير", Code = {1869562396,1632466035,1852785784,6648929,0,0}},
            {name = "2️⃣ معزز ضعف فعالية السبيكة للسفينه", Code = {1936682818,1869762676,1768055138,2037672300,1634497353,7562350}, Level = 23, isPointer = true},
            {name = "♨️ معزز إذابة فعالة", Code = {1869562402,1767142515,1834181997,1702128741,31090,0}}           
        }
    },
    
    {
        section = "💎 المجوهرات 👑",
        items = {
            {name = "💛 التوباز الأصفر", Code = {1835362056,49,0,0,0,0}},
            {name = "❤️ الياقوت الأحمر", Code = {1835362056,51,0,0,0,0}},
            {name = "💚 زمرد أخضر", Code = {1835362056,50,0,0,0,0}}
        }
    },
    
    {
        section = "⛏️ مواد المنجم 💥",
        items = {
            {name = "🧨 أصابع الديناميت", Code = {3370244,0,0,0,0,0 }},
            {name = "💥 متفجرات", Code = {3239172,0,0,0,0,0}},
            {name = "⛏️ معول", Code = {3304708,0,0,0,0,0 }},
            {name = "مضاعف المنجم(2x)", Code = {1835619372,1850041445,2037672308,1635214674,1766679666,3237230}}
           
        }
    },
    
       {
       section = "🧱 مواد البناء 🏗️",
       items = {
           {name = "🧱 طوب أحمر", Code = {1769095690,1107323747,1768713333,1866690159,1702129269,114}},
           {name = "⬜ بلاط", Code = {1768706058,1107321204,1768713333,1866690159,1702129269,114}},
           {name = "🪟 زجاج", Code = {1634486026,29555,0,0,0,0}},
           {name = "🪣 طلاء أحمر", Code = {1767993366,1699902574,1952533860,0,0,0}},
           {name = "🔨 مطرقة", Code = {1835100178,1299342701,29793,0,0,0}},
           {name = "📌 مسمار", Code = {1767992846,1952533868,0,0,0,0}},
           {name = "منشار كهربائي 🪚🔌", Code = {2003791888,1634955877,119,0,0,0 }},
           {name = "مثقاب 🪛 ", Code = {1769104394,27756,0,0,0,0}},
           {name = "مطرقة ثاقبة 🔨⚙️", Code = {1667328532,1835100267,7497069,0,0,0}},
           {name = "معول ⛏️", Code = {1667854344,107,0,0,0,0}},
           {name = "منشار 🪚", Code = {1414419462,0,0,0,0,0}},
           {name = "فاس 🪓", Code = {1702387974,0,0,0,0,0}}
         }
     },
   
    {
        section = "🪙 سبائك 🔗",
        items = {
            {name = "🟫 سبيكة البرونز", Code = {1869759002,1113946734,1768713333,28271,0,0}},
            {name = "⬜ سبيكة الفضة", Code = {1818841896,1114793334,1768713333,1866690159,1702129269,114}},
            {name = "🟨 سبيكة الذهب", Code = {1819232036,1819624036,1852795244,1853189955,7497076,0}},
            {name = "💿 سبيكة البلاتين", Code = {1634488364,1970170228,1819624045,1852795244,1853189955,7497076 }}
        }
    },

    {
        section = "🪨 الخام 🪵",
        items = {
            {name = "🟫 خام النحاس", Code = {3239684,0,0,0,0,0}},
            {name = "⬜ خام الفضة", Code = {3370756,0,0,0,0,0}},
            {name = "🟨 خام الذهب", Code = {3305220,0,0,0,0,0}},
            {name = "🪨 خام البلاتين", Code = {3436292,0,0,0,0,0 }}
        }
    },
    
    {
        section = "🏕️الشونة وتقليل الوقت⏰️",
        items = {
            {name = "🏕️ زيادة حجم الشونة المؤقت", Code = {1113542739,1953722223,1919906899,1130719073,1667330145,7959657,0}, Level=23, isPointer=true},
            {name = "⏰️ تقليل وقت البناء", Code = {1113542739,1953722223,1701146707,1114658148,1684826485,1936158313, 0}, Level=24, isPointer=true},
            {name = "⏰️ تقليل وقت الزراعة", Code = {1599099692,1936682818,1701860212,1884644453,1987207496,7631717}},
            {name = "⏰️ تقليل وقت رجوع الطائرة", Code = {1599099684,1936682818,1701860212,1884644453,7498049,0}},
            {name = "⏰️ تقليل وقت انتاج مزارع الحيوانات", Code = {1599099688,1936682818,1701860212,1884644453,1836212550,115}}
        }
    },
    
    {
        section = "💵 عملات أحداث 💰",
        items = {
            {name = "🪙 عملات حمراء", Code = {1953055520,1935754105,1701077347,1701539668,110,0}},
            {name = "🪙 عملات حدث الاسم", Code = {1634882594,1867148905,1701737077,1802458233,28261,0}},
            {name = "🪙 عملات حدث الإطار", Code = {1634878494,1315860327,1416917861,1852140399,0,0}},
            {name = "🧪 زجاجة ملونة", Code = {1734438184,1667195753,1684829537,1601073010,1852399984,116}},
            {name = "🪙 عملات السباق", Code = {1869759002,1113946734,1768713333,28271,0,0 }},
            {name = "⚡️طاقة الرحلة الاستكشافيه الزرقاء", Code = {1886938400,1953064037,1164865385,1735550318,121,0}},
            {name = "☘️ برسيم بيت الحظ", Code = {1869374220,7497078,0,0,0,0}}
        }
    }, 
    
    {
    section = "🖼️ الصور 📸",
    items = {
        {name = "بقرة فضائية", Code = {1635148044,14130,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل الثلج", Code = {1635148044,14386,0,0,0,0}, Level = 0, isPointer = false},
{name = "طيار", Code = {1635148044,14642,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير 21", Code = {1635148044,12339,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف البناء", Code = {1635148044,12595,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف الطرود", Code = {1635148044,12851,0,0,0,0}, Level = 0, isPointer = false},
{name = "صبي الطائره ", Code = {1635148044,13107,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف العلم", Code = {1635148044,13363,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة المال", Code = {1635148044,13619,0,0,0,0}, Level = 0, isPointer = false},
{name = "الأصدقاء ", Code = {1635148044,13875,0,0,0,0}, Level = 0, isPointer = false},
{name = "القطار", Code = {1635148044,14131,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف الدراجة", Code = {1635148044,14387,0,0,0,0}, Level = 0, isPointer = false},
{name = "خندق ", Code = {1635148044,14643,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف الكريسماس", Code = {1635148044,12596,0,0,0,0}, Level = 0, isPointer = false},
{name = "تنين", Code = {1635148044,12852,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاه صينيه", Code = {1635148044,3486769,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة البرسيم", Code = {1635148044,13876,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة الملاحة", Code = {1635148044,14132,0,0,0,0}, Level = 0, isPointer = false},
{name = "البقرة الثرية", Code = {1635148044,14644,0,0,0,0}, Level = 0, isPointer = false},
{name = "الخروف التمثال", Code = {1635148044,12341,0,0,0,0}, Level = 0, isPointer = false},
{name = "الكلب البني", Code = {1635148044,3355953,0,0,0,0}, Level = 0, isPointer = false},
{name = "السمكة الذهبية", Code = {1635148044,12853,0,0,0,0}, Level = 0, isPointer = false},
{name = "الاخطبوط", Code = {1635148044,13109,0,0,0,0}, Level = 0, isPointer = false},
{name = "سائق", Code = {1635148044,13621,0,0,0,0}, Level = 0, isPointer = false},
{name = "نورس", Code = {1635148044,3683633,0,0,0,0}, Level = 0, isPointer = false},
{name = "نبيل", Code = {1635148044,14133,0,0,0,0}, Level = 0, isPointer = false},
{name = "هيلوكوبتر", Code = {1635148044,12342,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة طيارة", Code = {1635148044,12598,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجال وسيم", Code = {1635148044,12854,0,0,0,0}, Level = 0, isPointer = false},
{name = "مرأه بسعر بني مع نظاره", Code = {1635148044,13622,0,0,0,0}, Level = 0, isPointer = false},
{name = "شرطية", Code = {1635148044,13878,0,0,0,0}, Level = 0, isPointer = false},
{name = "اطفائية", Code = {1635148044,14134,0,0,0,0}, Level = 0, isPointer = false},
{name = "مهندسة", Code = {1635148044,12343,0,0,0,0}, Level = 0, isPointer = false},
{name = "سبايدر وومن", Code = {1635148044,12599,0,0,0,0}, Level = 0, isPointer = false},
{name = "النسر", Code = {1635148044,12855,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب هدية", Code = {1635148044,13111,0,0,0,0}, Level = 0, isPointer = false},
{name = "دولفين", Code = {1635148044,13367,0,0,0,0}, Level = 0, isPointer = false},
{name = "ارنب الفصح", Code = {1635148044,13623,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة شمسية ", Code = {1635148044,13879,0,0,0,0}, Level = 0, isPointer = false},
{name = "صورة ارنوبة رياضية", Code = {1635148044,14135,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة بالفاس ", Code = {1635148044,14391,0,0,0,0}, Level = 0, isPointer = false},
{name = "المستكشفة", Code = {1635148044,14647,0,0,0,0}, Level = 0, isPointer = false},
{name = "بابانويل", Code = {1635148044,12344,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة الملك", Code = {1635148044,12344,0,0,0,0}, Level = 0, isPointer = false},
{name = "جمعة ارانب ", Code = {1635148044,12856,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة الام ", Code = {1635148044,13112,0,0,0,0}, Level = 0, isPointer = false},
{name = "اسم الزينة", Code = {1635148044,13368,0,0,0,0}, Level = 0, isPointer = false},
{name = "فضائي", Code = {1635148044,13624,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة طباخة", Code = {1635148044,13880,0,0,0,0}, Level = 0, isPointer = false},
{name = "نحلة البيتزا", Code = {1635148044,14136,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة اولى ", Code = {1635148044,3748145,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة ثانيه", Code = {1635148044,3158577,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة ثالثه", Code = {1635148044,3224113,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة رابعة", Code = {1635148044,3289649,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة خامسة", Code = {1635148044,3355185,0,0,0,0}, Level = 0, isPointer = false},
{name = "كوالا القارئ", Code = {1635148044,3420721,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشبح", Code = {1635148044,3486257,0,0,0,0}, Level = 0, isPointer = false},
{name = " ثعلب رياضي", Code = {1635148044,3551793,0,0,0,0}, Level = 0, isPointer = false},
{name = "البومة ", Code = {1635148044,3617329,0,0,0,0}, Level = 0, isPointer = false},
{name = "دب الصيد", Code = {1635148044,3682865,0,0,0,0}, Level = 0, isPointer = false},
{name = "غزال الكريسماس", Code = {1635148044,3748401,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة الكريسماس", Code = {1635148044,3158833,0,0,0,0}, Level = 0, isPointer = false},
{name = "راكون", Code = {1635148044,3224369,0,0,0,0}, Level = 0, isPointer = false},
{name = "الغواص", Code = {1635148044,3289905,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة متفجرات", Code = {1635148044,3355441,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير صيني", Code = {1635148044,3355441,0,0,0,0}, Level = 0, isPointer = false},
{name = "كتاكيت", Code = {1635148044,3486513,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل الفصح", Code = {1635148044,3552049,0,0,0,0}, Level = 0, isPointer = false},
{name = "الاسد ", Code = {1635148044,3617585,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة الرحله", Code = {1635148044,3683121,0,0,0,0}, Level = 0, isPointer = false},
{name = "امرآه استوائية ", Code = {1635148044,3748657,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة العصير ", Code = {1635148044,3159089,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف الياسمين", Code = {1635148044,3224625,0,0,0,0}, Level = 0, isPointer = false},
{name = "جنية ", Code = {1635148044,3290161,0,0,0,0}, Level = 0, isPointer = false},
{name = "نحلة العصير", Code = {1635148044,3355697,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير الأناناس ", Code = {1635148044,3421233,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة العلكة", Code = {1635148044,3486769,0,0,0,0}, Level = 0, isPointer = false},
{name = "قندس المال", Code = {1635148044,3552305,0,0,0,0}, Level = 0, isPointer = false},
{name = "شمبانزي اللطيف", Code = {1635148044,3617841,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة مستكشفة", Code = {1635148044,3683377,0,0,0,0}, Level = 0, isPointer = false},
{name = "شاحنة قمح", Code = {1635148044,3748913,0,0,0,0}, Level = 0, isPointer = false},
{name = "صورة قندس و دجاجة", Code = {1635148044,3159345,0,0,0,0}, Level = 0, isPointer = false},
{name = "طائرة ", Code = {1635148044,3224881,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة المرح", Code = {1635148044,3290417,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف الاحتفال ", Code = {1635148044,3355953,0,0,0,0}, Level = 0, isPointer = false},
{name = "السنة السادسة", Code = {1635148044,3421489,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف غزل البنات", Code = {1635148044,3487025,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة منتوفة", Code = {1635148044,3552561,0,0,0,0}, Level = 0, isPointer = false},
{name = "سمكة المصباح", Code = {1635148044,3618097,0,0,0,0}, Level = 0, isPointer = false},
{name = "فرس النهر", Code = {1635148044,3683633,0,0,0,0}, Level = 0, isPointer = false},
{name = "خفاش", Code = {1635148044,3749169,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة محبة اللبان", Code = {1635148044,3159601,0,0,0,0}, Level = 0, isPointer = false},
{name = "شيف الخروف مبدع", Code = {1635148044,3225137,0,0,0,0}, Level = 0, isPointer = false},
{name = "نسر العيد", Code = {1635148044,3290673,0,0,0,0}, Level = 0, isPointer = false},
{name = "ارنب الفائز", Code = {1635148044,3356209,0,0,0,0}, Level = 0, isPointer = false},
{name = "القندس الفائز", Code = {1635148044,3421745,0,0,0,0}, Level = 0, isPointer = false},
{name = "الخروف سانتا", Code = {1635148044,3487281,0,0,0,0}, Level = 0, isPointer = false},
{name = "ارنب الهدية", Code = {1635148044,3552817,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير المهندس ", Code = {1635148044,3618353,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة الصيانه", Code = {1635148044,3683889,0,0,0,0}, Level = 0, isPointer = false},
{name = "الخنزير الصيني ", Code = {1635148044,3749425,0,0,0,0}, Level = 0, isPointer = false},
{name = "فار صيني", Code = {1635148044,3159857,0,0,0,0}, Level = 0, isPointer = false},
{name = "قندس اطلانتس", Code = {1635148044,3225393,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير على دراجة هوائية", Code = {1635148044,3290929,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير متنكر في بطيخه", Code = {1635148044,3356465,0,0,0,0}, Level = 0, isPointer = false},
{name = "ثعلب المشروبات", Code = {1635148044,3422001,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة الكشافة", Code = {1635148044,3487537,0,0,0,0}, Level = 0, isPointer = false},
{name = "ثعلب مسترخي", Code = {1635148044,3553073,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة الفصح", Code = {1635148044,3618609,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف المراعي", Code = {1635148044,3684145,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب البزنس", Code = {1635148044,3749681,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة الحقل", Code = {1635148044,3160113,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف التنزه", Code = {1635148044,3225649,0,0,0,0}, Level = 0, isPointer = false},
{name = "صورة جنبري", Code = {1635148044,3291185,0,0,0,0}, Level = 0, isPointer = false},
{name = "فار السباغيتي", Code = {1635148044,3356721,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة المثلجات", Code = {1635148044,3422257,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة رشيقة", Code = {1635148044,3487793,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب الاستجمام ", Code = {1635148044,3553329,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير المرح", Code = {1635148044,3618865,0,0,0,0}, Level = 0, isPointer = false},
{name = "الفزاعة", Code = {1635148044,3684401,0,0,0,0}, Level = 0, isPointer = false},
{name = "كوالا ياكل نقانق", Code = {1635148044,3749937,0,0,0,0}, Level = 0, isPointer = false},
{name = "كوالا المغامر", Code = {1635148044,3160369,0,0,0,0}, Level = 0, isPointer = false},
{name = "سنة السابعة", Code = {1635148044,3225905,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة الأفعوانية ", Code = {1635148044,3291441,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف العاب الخفة", Code = {1635148044,3356977,0,0,0,0}, Level = 0, isPointer = false},
{name = "صقر المعرض", Code = {1635148044,3422513,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطريق حاصل على ذهبية", Code = {1635148044,3488049,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة عيد الميلاد", Code = {1635148044,3553585,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير البالونات", Code = {1635148044,3619121,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة تلهو في الملاهي", Code = {1635148044,3684657,0,0,0,0}, Level = 0, isPointer = false},
{name = "فأر يعد الحلويات", Code = {1635148044,3750193,0,0,0,0}, Level = 0, isPointer = false},
{name = "شجرة كريسماس ", Code = {1635148044,3158066,0,0,0,0}, Level = 0, isPointer = false},
{name = "راكون مسترخي", Code = {1635148044,3223602,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب الحقل", Code = {1635148044,3289138,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة الجائزة", Code = {1635148044,3354674,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف مساعد سانتا ", Code = {1635148044,3420210,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة تحمل بالون", Code = {1635148044,3485746,0,0,0,0}, Level = 0, isPointer = false},
{name = "شاحنة حمراء", Code = {1635148044,3551282,0,0,0,0}, Level = 0, isPointer = false},
{name = "حصان أبيض ", Code = {1635148044,3616818,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة ثرية", Code = {1635148044,3682354,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة تحمل فانوس", Code = {1635148044,3747890,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة سينمائية ", Code = {1635148044,3158322,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة الكشافة", Code = {1635148044,3223858,0,0,0,0}, Level = 0, isPointer = false},
{name = "القرصان ", Code = {1635148044,3289394,0,0,0,0}, Level = 0, isPointer = false},
{name = "ابقرة تقود", Code = {1635148044,3354930,0,0,0,0}, Level = 0, isPointer = false},
{name = "نحلة الحلوى ", Code = {1635148044,3420466,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة العوم", Code = {1635148044,3486002,0,0,0,0}, Level = 0, isPointer = false},
{name = "ارنبة رسامة", Code = {1635148044,3551538,0,0,0,0}, Level = 0, isPointer = false},
{name = "ببغاء القرصان", Code = {1635148044,3617074,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة متسابقة", Code = {1635148044,3682610,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطة الاستجمام ", Code = {1635148044,3748146,0,0,0,0}, Level = 0, isPointer = false},
{name = "النادل القط", Code = {1635148044,3158578,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطريق متزلج", Code = {1635148044,3224114,0,0,0,0}, Level = 0, isPointer = false},
{name = "طفل ياكل الحلوى", Code = {1635148044,3355698,0,0,0,0}, Level = 0, isPointer = false},
{name = "طباخ يمسك سمك", Code = {1635148044,3421234,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشقراء الفضائيه", Code = {1635148044,3486770,0,0,0,0}, Level = 0, isPointer = false},
{name = "طفله تاكل مثلجات", Code = {1635148044,3552306,0,0,0,0}, Level = 0, isPointer = false},
{name = "طفل يلعب", Code = {1635148044,3617842,0,0,0,0}, Level = 0, isPointer = false},
{name = "بك فود", Code = {1635148044,3683378,0,0,0,0}, Level = 0, isPointer = false},
{name = "رسام", Code = {1635148044,3748914,0,0,0,0}, Level = 0, isPointer = false},
{name = "السلطان", Code = {1635148044,3159346,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت الشعر الاحمر", Code = {1635148044,3224882,0,0,0,0}, Level = 0, isPointer = false},
{name = "الحمامه البيضاء", Code = {1635148044,3224882,0,0,0,0}, Level = 0, isPointer = false},
{name = "اسم الزينة", Code = {1635148044,3355954,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت حامله زهور", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت تاخذ سيلفي", Code = {1635148044,3487026,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت الرياضيه", Code = {1635148044,3552562,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت شعر الطويل", Code = {1635148044,3618098,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت شعر الاصفر", Code = {1635148044,3683634,0,0,0,0}, Level = 0, isPointer = false},
{name = "قرصانه", Code = {1635148044,3749170,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل لابس اخضر", Code = {1635148044,3159602,0,0,0,0}, Level = 0, isPointer = false},
{name = "كوالا", Code = {1635148044,3225138,0,0,0,0,}, Level = 0, isPointer = false},
{name = "الخنزير الاحمر", Code = {1635148044,3290674,0,0,0,0}, Level = 0, isPointer = false},
{name = "التمساح يحمل ازهار", Code = {1635148044,3356210,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل عجوز", Code = {1635148044,3421746,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت لابسه القبعه بنفسجيه", Code = {1635148044,3487282,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت تشرب قهوه", Code = {1635148044,3618354,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف بيده خارطه", Code = {1635148044,3683890,0,0,0,0}, Level = 0, isPointer = false},
{name = "عروس", Code = {1635148044,3749426,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل كبير يحمل بطاقات", Code = {1635148044,3159858,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقره رومانسيه", Code = {1635148044,3225394,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير يلبس نظارات", Code = {1635148044,3290930,0,0,0,0}, Level = 0, isPointer = false},
{name = "شاب بيده نجوم", Code = {1635148044,3356466,0,0,0,0}, Level = 0, isPointer = false},
{name = "دب بيده كيتار", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "امره شريره", Code = {1635148044,3487538,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت جميله", Code = {1635148044,3553074,0,0,0,0}, Level = 0, isPointer = false},
{name = "سلحفاه خضراء", Code = {1635148044,3618610,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجه مهرجه", Code = {1635148044,3684146,0,0,0,0}, Level = 0, isPointer = false},
{name = "حوت الازرق", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشبح الاكتروني", Code = {1635148044,3160114,0,0,0,0}, Level = 0, isPointer = false},
{name = "احتفال سنه التساعه", Code = {1635148044,3225650,0,0,0,0}, Level = 0, isPointer = false},
{name = "البقره محتفله", Code = {1635148044,3291186,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت تلبس سماعات", Code = {1635148044,3356722,0,0,0,0}, Level = 0, isPointer = false},
{name = "صقر", Code = {1635148044,3422258,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل الاشقر", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "اخروف الفطائر", Code = {1635148044,3553330,0,0,0,0}, Level = 0, isPointer = false},
{name = "البقره المبتسه", Code = {1635148044,3618866,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاه القرصنه", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "بغباء صغير", Code = {1635148044,3749938,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجه بيديها مضرب", Code = {1635148044,3160370,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف سمائي", Code = {1635148044,3225906,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت تلبس نظارات", Code = {1635148044,3225906,0,0,0,0}, Level = 0, isPointer = false},
{name = "ثعلب", Code = {1635148044,3356978,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت شعر البني", Code = {1635148044,3422514,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقره الفضاء", Code = {1635148044,3488050,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت بيدها لعبه", Code = {1635148044,3553586,0,0,0,0}, Level = 0, isPointer = false},
{name = "فرعون", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتى صغير", Code = {1635148044,3684658,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتى صغيره", Code = {1635148044,3750194,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجه الساحره", Code = {1635148044,3158067,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف مثقف", Code = {1635148044,3354675,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب بني", Code = {1635148044,3420211,0,0,0,0}, Level = 0, isPointer = false},
{name = " خروف مستكشف", Code = {1635148044,3485747,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقره سيده البحار", Code = {1635148044,3551283,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجه المستكشفه", Code = {1635148044,3616819,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل مستكشف", Code = {1635148044,3682355,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاه طباخه", Code = {1635148044,3747891,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقره طباخه", Code = {1635148044,3158323,0,0,0,0}, Level = 0, isPointer = false},
{name = "ببغاء ", Code = {1635148044,3355186,0,0,0,0}, Level = 0, isPointer = false},
{name = "قطة بنظارات", Code = {1635148044,3486258,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير ثري", Code = {1635148044,3551794,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف متفاخر", Code = {1635148044,3617330,0,0,0,0}, Level = 0, isPointer = false},
{name = "المرآه السرك", Code = {1635148044,3682866,0,0,0,0}, Level = 0, isPointer = false},
{name = "امرأة اسيوية ", Code = {1635148044,3748402,0,0,0,0}, Level = 0, isPointer = false},
{name = "االخروف العمدة", Code = {1635148044,3158834,0,0,0,0}, Level = 0, isPointer = false},
{name = "اارنبة لطيفة", Code = {1635148044,3224370,0,0,0,0}, Level = 0, isPointer = false},
{name = "حمار مكسيكي ", Code = {1635148044,3289906,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير استوائي مسترخي", Code = {1635148044,3355442,0,0,0,0}, Level = 0, isPointer = false},
{name = "دراكولا ", Code = {1635148044,3420978,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة الهالووين ", Code = {1635148044,3486514,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير المومياء", Code = {1635148044,3552050,0,0,0,0}, Level = 0, isPointer = false},
{name = "شاب الكابتن صورة زرقاء", Code = {1635148044,3617586,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة الاحتفال", Code = {1635148044,3683122,0,0,0,0}, Level = 0, isPointer = false},
{name = "السنة الثامنة", Code = {1635148044,3748658,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة زومبي", Code = {1635148044,3159090,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشاب المزارع", Code = {1635148044,3224626,0,0,0,0}, Level = 0, isPointer = false},
{name = "الرجل الفائز", Code = {1635148044,3290162,0,0,0,0}, Level = 0, isPointer = false},
{name = "اخنزير بحتفل بالعام العاشر ", Code = {1635148044,3289395,0,0,0,0}, Level = 0, isPointer = false},
{name = "السنة العاشرة ", Code = {1635148044,3354931,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشاب اليقطين", Code = {1635148044,3420467,0,0,0,0}, Level = 0, isPointer = false},
{name = "الشبح", Code = {1635148044,3486003,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة مصاص دماء", Code = {1635148044,3551539,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف روبين هود", Code = {1635148044,3682611,0,0,0,0}, Level = 0, isPointer = false},
{name = "حدث مستكشف الغزلان", Code = {1635148044,3748147,0,0,0,0}, Level = 0, isPointer = false},
{name = "الغزال ", Code = {1635148044,3158579,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة متنكرة", Code = {1635148044,3224115,0,0,0,0}, Level = 0, isPointer = false},
{name = "لاعب تنس", Code = {1635148044,3289651,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل كبير ", Code = {1635148044,3355187,0,0,0,0}, Level = 0, isPointer = false},
{name = "نمر ثلجي ابيض", Code = {1635148044,3420723,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة متزلجة", Code = {1635148044,3486259,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف استعراض", Code = {1635148044,3551795,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطريق لطيف", Code = {1635148044,3617331,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف اسطوري", Code = {1635148044,3682867,0,0,0,0}, Level = 0, isPointer = false},
{name = "غزال قديم", Code = {1635148044,3748403,0,0,0,0}, Level = 0, isPointer = false},
{name = "خنزير الفانوس", Code = {1635148044,3158835,0,0,0,0}, Level = 0, isPointer = false},
{name = "عجوز الاحتفال ", Code = {1635148044,3224371,0,0,0,0}, Level = 0, isPointer = false},
{name =  "بنت مع لعبه ارنب", Code = {1635148044,3289907,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة الحظ ", Code = {1635148044,3355443,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة الفصح ", Code = {1635148044,3420979,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف روك آند رول", Code = {1635148044,3486515,0,0,0,0}, Level = 0, isPointer = false},
{name = "قائد الكشافة", Code = {1635148044,3552051,0,0,0,0}, Level = 0, isPointer = false},
{name = "مغامر ", Code = {1635148044,3617587,0,0,0,0}, Level = 0, isPointer = false},
{name = "امرأة الذهبية", Code = {1635148044,3683123,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة اغريقية تاكل العنب", Code = {1635148044,3748659,0,0,0,0}, Level = 0, isPointer = false},
{name = " بنت استوائية تحتفل", Code = {1635148044,3159091,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة انيقة", Code = {1635148044,3224627,0,0,0,0}, Level = 0, isPointer = false},
{name = "بومة زرقاء", Code = {1635148044,3290163,0,0,0,0}, Level = 0, isPointer = false},
{name = "ثعلب ساحر", Code = {1635148044,3355699,0,0,0,0}, Level = 0, isPointer = false},
{name = "المحققة", Code = {1635148044,3421235,0,0,0,0}, Level = 0, isPointer = false},
{name = "شبح الكتروني يغمز", Code = {1635148044,3486771,0,0,0,0}, Level = 0, isPointer = false},
{name = "شيف البيتزا", Code = {1635148044,3552307,0,0,0,0}, Level = 0, isPointer = false},
{name = "الخروف الفارس", Code = {1635148044,3617843,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاة العلم", Code = {1635148044,3683379,0,0,0,0}, Level = 0, isPointer = false},
{name = "راكون ياكل البسكويت", Code = {1635148044,3748915,0,0,0,0}, Level = 0, isPointer = false},
{name = "بقرة هرقل", Code = {1635148044,3159347,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاه مستكشفة", Code = {1635148044,3290419,0,0,0,0}, Level = 0, isPointer = false},
{name = "القرد الذهبي", Code = {1635148044,3355955,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف العمدة", Code = {1635148044,3421491,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة مصيفه تشرب عصير", Code = {1635148044,3487027,0,0,0,0}, Level = 0, isPointer = false},
{name = "فضائي أخضر ", Code = {1635148044,3552563,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل مسن غاضب", Code = {1635148044,3618099,0,0,0,0}, Level = 0, isPointer = false},
{name =" بقرة تاكل باستا", Code = {1635148044,3683635,0,0,0,0}, Level = 0, isPointer = false},
{name = "وسيم مهندس", Code = {1635148044,3749171,0,0,0,0}, Level = 0, isPointer = false},
{name = "نبات آكل لحوم", Code = {1635148044,3159603,0,0,0,0}, Level = 0, isPointer = false},
{name = "كلب يحمل رقم 11", Code = {1635148044,3225139,0,0,0,0}, Level = 0, isPointer = false},
{name = "السنة الحادي عشر", Code = {1635148044,3290675,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل مسن خبيث", Code = {1635148044,3421747,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاة تذاكر", Code = {1635148044,3487283,0,0,0,0}, Level = 0, isPointer = false},
{name = "دجاجة مشعوذة", Code = {1635148044,3552819,0,0,0,0}, Level = 0, isPointer = false},
{name = "المشعوذة", Code = {1635148044,3618355,0,0,0,0}, Level = 0, isPointer = false},
{name = "التنين", Code = {1635148044,3683891,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف فرعوني", Code = {1635148044,3749427,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل شبح ", Code = {1635148044,3159859,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل مكتشف تحت القمر", Code = {1635148044,3225395,0,0,0,0}, Level = 0, isPointer = false},
{name = "بنت تاكل كيك", Code = {1635148044,3290931,0,0,0,0}, Level = 0, isPointer = false},
{name = "سانتا كلوز", Code = {1635148044,3356467,0,0,0,0}, Level = 0, isPointer = false},
{name = "البقره البحاره", Code = {1635148044,3422003,0,0,0,0}, Level = 0, isPointer = false},
{name = "البحار ", Code = {1635148044,3487539,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل الغامض", Code = {1635148044,3553075,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل سانتا", Code = {1635148044,3618611,0,0,0,0}, Level = 0, isPointer = false},
{name = "غزال كبير", Code = {1635148044,3684147,0,0,0,0}, Level = 0, isPointer = false},
{name = "صورة بقرة", Code = {1635148044,3749683,0,0,0,0}, Level = 0, isPointer = false},
{name = "صورة خروف", Code = {1635148044,3160115,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف سانتا بجرس", Code = {1635148044,3225651,0,0,0,0}, Level = 0, isPointer = false},
{name = "الافعى ", Code = {1635148044,3291187,0,0,0,0}, Level = 0, isPointer = false},
{name = "الجاسوسة", Code = {1635148044,3356723,0,0,0,0}, Level = 0, isPointer = false},
{name = "الكتروني مبتسم", Code = {1635148044,3422259,0,0,0,0}, Level = 0, isPointer = false},
{name = "قرصان شرير", Code = {1635148044,3487795,0,0,0,0}, Level = 0, isPointer = false},
{name = "حورية", Code = {1635148044,3553331,0,0,0,0}, Level = 0, isPointer = false},
{name = "خروف القرص ", Code = {1635148044,3618867,0,0,0,0}, Level = 0, isPointer = false},
{name = "الجني", Code = {1635148044,3684403,0,0,0,0}, Level = 0, isPointer = false},
{name = "الفارس", Code = {1635148044,3749939,0,0,0,0}, Level = 0, isPointer = false},
{name = "فرس اشقر", Code = {1635148044,3160371,0,0,0,0}, Level = 0, isPointer = false},
{name = "راعية", Code = {1635148044,3225907,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاة صيفيه", Code = {1635148044,3291443,0,0,0,0}, Level = 0, isPointer = false},
{name = "عجوز صيني", Code = {1635148044,3356979,0,0,0,0}, Level = 0, isPointer = false},
{name = "فتاة مرتبة", Code = {1635148044,3422515,0,0,0,0}, Level = 0, isPointer = false},
{name = "رجل الفطائر ", Code = {1635148044,3488051,0,0,0,0}, Level = 0, isPointer = false},
{name = " رجل الالعاب", Code = {1635148044,3553587,0,0,0,0}, Level = 0, isPointer = false},
{name = " خروف الفايكنج ", Code = {1635148044,3619123,0,0,0,0}, Level = 0, isPointer = false},
{name = "بطريق كيوت", Code = {1635148044,3684659,0,0,0,0}, Level = 0, isPointer = false}
       }
    },
    
    {
    section = "🎭 الملصقات 🎭",
    items = {
{name = "🐑 خروف يخرج من الهدية 🐑", Code = {1869440274,1935632746,12656,0,0,0}},
{name = "🐑 خروف يغمز 🐑", Code = {1869440276,1935632746,3289456,0,0,0}},
{name = "🐑 خروف يرسم قلب 🐑", Code = {1869440276,1935632746,3551600,0,0,0}},
{name = "🐑 خروف يصفق 🐑", Code = {1869440276,1935632746,3355248,0,0,0}},
{name = "🐑 خروف يفكر 🐑", Code = {1869440276,1935632746,3356020,0,0,0}},
{name = "🐑 خروف عصير برتقال 🐑", Code = {1869440274,1935632746,13428,0,0,0}},
{name = "🐑 خروف الرعد 🐑", Code = {1869440276,1935632746,3290484,0,0,0}},
{name = "🐑 خروف التنين 🐑", Code = {1869440276,1935632746,3552372,0,0,0}},
{name = "🐑 خروف المزمار 🐑", Code = {1869440276,1935632746,3617396,0,0,0}},
{name = "🐑 خروف فرعوني 🐑", Code = {1869440276,1935632746,3422068,0,0,0}},
{name = "🐑 خروف بقوس وسهم 🐑", Code = {1869440276,1935632746,3618164,0,0,0}},
{name = "🐑 خروف ب بوكيه ورد 🐑", Code = {1869440276,1935632746,3748980,0,0,0}},
{name = "🐑 خروف الكهف 🐑", Code = {1869440276,1935632746,3486580,0,0,0}},
{name = "🐑 خروف كريسماس يمشي بهدوء 🐑", Code = {1869440276,1935632746,3553140,0,0,0}},
{name = "🐑 خروف يمرح ف الثلج 🐑", Code = {1869440276,1935632746,3617140,0,0,0}},
{name = "🐑 خروف حرامي 🐑", Code = {1869440276,1935632746,3289460,0,0,0}},
{name = "🐑 خروف يرقص 🐑", Code = {1869440276,1935632746,3159668,0,0,0}},
{name = "🐑 خاروف ب جيتار 🐑", Code = {1869440276,1935632746,3159668,0,0,0}},

{name = "🐄 بقرة ترقص 🐄", Code = {1869440274,1935632746,13684,0,0,0}},
{name = "🐄 بقرة ب جيتار 🐄", Code = {1869440276,1935632746,3224436,0,0,0}},
{name = "🐄 بقرة تاكل فشار 🐄", Code = {1869440274,1935632746,3422064,0,0,0}},
{name = "🐄 بقرة فشار تخاف 🐄", Code = {1869440276,1935632746,3159156,0,0,0}},
{name = "🐄 بقرة بوسه قلوب 1 🐄", Code = {1869440276,1935632746,3617908,0,0,0}},
{name = "🐄 بقرة بوسة قلوب 2 🐄", Code = {1869440274,1935632746,3420784,0,0,0}},
{name = "🐄 بقرة زيوس 🐄", Code = {1869440276,1935632746,3683956,0,0,0}},
{name = "🐄 بقرة تشرب شاي 🐄", Code = {1869440276,1935632746,3618676,0,0,0}},
{name = "🐄 بقرة قرصان بخريطة 🐄", Code = {1869440276,1935632746,3487604,0,0,0}},
{name = "🐄 بقرة دراكولا 🐄", Code = {1869440276,1935632746,3552628,0,0,0}},
{name = "🐄 بقرة فضاء 🐄", Code = {1869440276,1935632746,3289716,0,0,0}},
{name = "🐄 بقرة الكيك 🐄", Code = {1869440276,1935632746,3487092,0,0,0}},
{name = "🐄 بقرة تشغل نار 🐄", Code = {1869440276,1935632746,3552116,0,0,0}},
{name = "🐄 بقرة فضاء تمسك علم 🐄", Code = {1869440276,1935632746,3159412,0,0,0}},
{name = "🐄 بقرة تتزلج 🐄", Code = {1869440276,1935632746,3749236,0,0,0}},
{name = "🐄 بقرة عيد الفصح 🐄", Code = {1869440276,1935632746,3356276,0,0,0}},
{name = "🐄 بقرة تصور ب كاميرا 🐄", Code = {1869440276,1935632746,3552884,0,0,0}},
{name = "🐄 بقرة كريسماس ترقص 🐄", Code = {1869440276,1935632746,3486836,0,0,0}},
{name = "🐄 بقرة تتذكر 🐄", Code = {1869440276,1935632746,3617136,0,0,0}},
{name = "🐄 بقرة تغطي وجهها وتضحك 🐄", Code = {1869440276,1935632746,3481968,0,0,0}},

{name = "🐔 دجاجة تحمل أصقال 🐔", Code = {1869440276,1935632746,3683444,0,0,0}},
{name = "🐔 دجاجة دايخة 🐔", Code = {1869440276,1935632746,3617392,0,0,0}},
{name = "🐓 ديك يحمل مسدس 🐓", Code = {1869440274,1935632746,14196,0,0,0}},
{name = "🐓 ديك بمدفع 🐓", Code = {1869440274,1935632746,12660,0,0,0}},
{name = "🐔 دجاجة بردانة تشرب قهوة 🐔", Code = {1869440276,1935632746,3744112,0,0,0}},
{name = "🐔 دجاجة متزلجة 🐔", Code = {1869440276,1935632746,3682676,0,0,0}},
{name = "🐔 دجاجة خباز 🐔", Code = {1869440276,1935632746,3420788,0,0,0}},
{name = "🐔 دجاجة ساحرة 🐔", Code = {1869440276,1935632746,3158388,0,0,0}},
{name = "🐔 دجاجة تحتفل 🐔", Code = {1869440276,1935632746,3683700,0,0,0}},
{name = "🐔 دجاجة تسمع أغاني 🐔", Code = {1869440276,1935632746,3683188,0,0,0}},
{name = "🐔 دجاجة فراشة ساحرة 🐔", Code = {1869440276,1935632746,3224948,0,0,0}},
{name = "🐔 دجاجة لابسة أخضر 🐔", Code = {1869440276,1935632746,3290740,0,0,0}},
{name = "🐓 ديك مغامر 🐓", Code = {1869440276,1935632746,3421556,0,0,0}},
{name = "🐔 دجاجة تهرب 🐔", Code = {1869440276,1935632746,3224692,0,0,0}},
{name = "🐔 دجاجة تعزف 🐔", Code = {1869440276,1935632746,3487348,0,0,0}},
{name = "🐔 دجاجة تلون بيض 🐔", Code = {1869440276,1935632746,3748468,0,0,0}},
{name = "🐓 ديك يعمل لايك 🐓", Code = {1869440274,1935632746,3421296,0,0,0}},

{name = "🐷 خنزير بمنظار 🐷", Code = {1869440274,1935632746,13172,0,0,0}},
{name = "🐷 خنزير يمسك حبل 🐷", Code = {1869440274,1935632746,14452,0,0,0}},
{name = "🐷 خنزيرة بفستان أحمر 🐷", Code = {1869440276,1935632746,3748724,0,0,0}},
{name = "🐷 خنزيرة بنظارة ترقص 🐷", Code = {1869440276,1935632746,3223920,0,0,0}},
{name = "🐷 خنزيرة يابانية 🐷", Code = {1869440276,1935632746,3158640,0,0,0}},
{name = "🐷 خنزير بقارب 🐷", Code = {1869440276,1935632746,3421044,0,0,0}},
{name = "🐷 خنزير الصاروخ 🐷", Code = {1869440276,1935632746,3355252,0,0,0}},
{name = "🐷 خنزير يعطي لايك 🐷", Code = {1869440276,1935632746,3420532,0,0,0}},
{name = "🐷 خنزير ياباني ب براد وفنجان 🐷", Code = {1869440276,1935632746,3225204,0,0,0}},
{name = "🐷 خنزيرة نايمة ع ورد 🐷", Code = {1869440274,1935632746,13680,0,0,0}},
{name = "🐷 خنزيرة بطوق ورد بترقص 🐷", Code = {1869440276,1935632746,3482480,0,0,0}},

{name = "🦆 بطتين الحب 🦆", Code = {1869440272,1985960298,50,0,0,0}},
{name = "🦆 بطة تمسك هدية 🦆", Code = {1869440276,1935632746,3744112,0,0,0}},
{name = "🦆 بطة تنعس (تنام) 🦆", Code = {1869440276,1935632746,3158384,0,0,0}},
{name = "🦆 بطة تلتقط سيلفي 🦆", Code = {1869440274,1935632746,14704,0,0,0}},
{name = "🦆 بطة مصاص دماء 🦆", Code = {1869440276,1935632746,3354992,0,0,0}},
{name = "🦆 بطة بتعمل لأ 🦆", Code = {1869440276,1935632746,3420784,0,0,0}},
{name = "🦆 بطة متنكرة 🦆", Code = {1869440276,1935632746,3355508,0,0,0}},
{name = "🦆 بطة اليقطين تعطي بوسة 🦆", Code = {1869440276,1935632746,3290228,0,0,0}},
{name = "🦆 بطة ب قبعة حمراء 🦆", Code = {1869440276,1935632746,3486324,0,0,0}},
{name = "🦆 بطة ب عضلات 🦆", Code = {1869440276,1935632746,3486068,0,0,0}},

{name = "🦭 كلب البحر الشرير 🦭", Code = {1869440274,1935632746,13168,0,0,0}},
{name = "🦭 كلب البحر يحضن قلب 🦭", Code = {1869440272,1985960298,51,0,0,0}},
{name = "🦭 كلب البحر الرابح 🦭", Code = {1869440276,1935632746,3224176,0,0,0}},
{name = "🦭 كلب البحر الساحر 🦭", Code = {1869440276,1935632746,3416432,0,0,0}},
{name = "🦭 كلب البحر يرقص بكرشه 🦭", Code = {1869440276,1935632746,3289968,0,0,0}},
{name = "🦭 كلب البحر يطبل 🦭", Code = {1869440276,1935632746,3289972,0,0,0}},
{name = "🦭 كلب البحر يخرج من مصباح سحري 🦭", Code = {1869440276,1935632746,3682932,0,0,0}},

{name = "🐝 النحلة الضاحكة 🐝", Code = {1869440274,1935632746,13936,0,0,0}},
{name = "🐝 نحلة ساحرة 🐝", Code = {1869440276,1935632746,3355764,0,0,0}},
{name = "🐝 نحلة راقصة 🐝", Code = {1869440276,1935632746,3223924,0,0,0}},
{name = "🐝 نحلة تخرج من سلة بيض 🐝", Code = {1869440276,1935632746,3158900,0,0,0}},
{name = "🐝 نحلة على شكل مهرج 🐝", Code = {1869440276,1935632746,3551860,0,0,0}},
{name = "🐝 نحلة معاها هدية 🐝", Code = {1869440276,1935632746,3551604,0,0,0}},
{name = "🐝 نحلة تعزف بمزمار 🐝", Code = {1869440274,1935632746,13940,0,0,0}},
{name = "🐝 نحلة نايمة ف عوامة 🐝", Code = {1869440276,1935632746,3617652,0,0,0}},

{name = "🐿️ سنجاب يتلقى تحية 🐿️", Code = {1869440276,1935632746,3421300,0,0,0}}
    }
  }
}

local products = {
            {name = "قمح", Code = {1701345034,29793,0,0,0,0}},
            {name = "تاج", Code = {1634296844,7169380,0,0,0,0}}
}
            
-- نظام حفظ الحالة

local stateFile = gg.EXT_CACHE_DIR .. "/last_state.txt"
os.remove(stateFile) 

function saveState(state, idx)
    local f = io.open(stateFile, "w")
    if f then 
        f:write(state .. "|" .. tostring(idx)) 
        f:close() 
    end
end

function loadState()
    local f = io.open(stateFile, "r")
    if f then
        local content = f:read("*a")
        f:close()
        local s, i = content:match("([^|]+)|(.+)")
        return s or "MAIN", i or "0"
    end
    return "MAIN", "0"
end

local memoryRangeFile = gg.EXT_CACHE_DIR .. "/memory_range.txt"

function saveMemoryRange(value)
    local f = io.open(memoryRangeFile, "w")
    if f then
        f:write(value)
        f:close()
    end
end

function loadMemoryRange()
    local f = io.open(memoryRangeFile, "r")
    if f then
        local value = f:read("*a")
        f:close()
        return value
    end
    return nil
end
-----------------------------------------------------------
-- [2] الوظائف البرمجية
-----------------------------------------------------------
local cachedResult = nil
local baseAddresses = {TRAIN = nil, HELICOPTER = nil, PLANE = nil, TRAIN_STATION = nil, HELICOPTER_PAD = nil, AIRPORT = nil, SHIP = nil, PORT = nil, COW = nil, CHICKEN = nil, SHEEP = nil, PIG = nil, ISLAND = nil}
local tableA = nil
local basePointer = nil
local unique_cachedGiftResults = nil
local unique_tableA = nil
local unique_cachedPointerResults = nil
local cachedTrainResults = nil
local cachedLandResults = nil
local cachedAddFriendResults = nil
local cachedFlipTilesResults = nil
local cardsEnabled = false
local cardsCached = false
local cardsBackup = {
    freezeItems = {},
    values1 = {},
    values2 = {}
}
local cloverEnabled = false
clanAchievementsCached = false
clanAchievementsResults = nil
local cloverFreezeItems = {}
local stateFile = gg.EXT_CACHE_DIR .. "/pointer_results.txt"
os.remove(stateFile)


function savePointerResults(results)
    local f = io.open(stateFile, "w")
    if f then
        for _, r in ipairs(results) do
            f:write(tostring(r.address) .. "\n")
        end
        f:close()
    end
end

-- دالة تحميل النتائج
function loadPointerResults()
    local results = {}
    local f = io.open(stateFile, "r")
    if f then
        for line in f:lines() do
            table.insert(results, {address = tonumber(line), flags = 4})
        end
        f:close()
        return #results > 0 and results or nil
    end
    return nil
end

function selectAll()

    local menu = {}

    for i, v in ipairs(resources) do
        table.insert(menu, v.section)
    end

    table.insert(menu, "⬅️ رجوع")

    local choice = gg.choice(menu, nil, "📦 اختر القسم الذي تريد تطبيق جميع عناصره")

    if not choice or choice == #menu then
        return
    end

    local sectionData = resources[choice]

    if not sectionData or not sectionData.items or #sectionData.items == 0 then
        gg.alert("لا توجد عناصر في هذا القسم ❌")
        return
    end

    -- رسالة موحدة لإدخال القيمة لجميع عناصر القسم
    local promptMsg = "اكتب الرقم الذي تريد تطبيقه على جميع عناصر قسم (" .. sectionData.section .. ") :"
    local userInput = gg.prompt({promptMsg}, nil, {"number"})
    if not userInput then
        return
    end

    local countVal = tonumber(userInput[1])
    if userInput[1] == "" or countVal == nil then
        gg.alert("لم يتم إدخال عدد صحيح .. حاول مجدداً 😁")
        return
    end

    -- تهيئة نتائج الهدية الأساسية إن لم تكن موجودة
    if unique_cachedGiftResults == nil then
        gg.toast("🇦 🇭 🇲 🇪 🇩")
        gg.clearResults()
        gg.searchNumber("65538;1;1;12546::113", 4)
        gg.refineNumber("65538", 4)
        unique_cachedGiftResults = gg.getResults(gg.getResultCount())
        
        if #unique_cachedGiftResults == 0 then 
            gg.alert("لم يتم العثور على الهدية 29!") 
            gg.setVisible(true)
            return 
        end
    end

    -- تجهيز المؤشرات إن وجدت (مرة واحدة لتوفير الوقت)
    local hasPointer = false
    for _, item in ipairs(sectionData.items) do
        if item.isPointer then hasPointer = true break end
    end

    if hasPointer then
        if unique_tableA == nil then
            gg.clearResults()
            gg.searchNumber("1768641320;1918132078;1601071457;1768058738;33;27::57", 4)
            gg.refineNumber("33", 4)
            local res = gg.getResults(1)
            if #res == 0 then 
                gg.alert("لم يتم العثور ع كود استبدال المؤشر") 
                gg.setVisible(true) 
                return 
            end
            unique_tableA = {}
            for i = 0, 5 do table.insert(unique_tableA, gg.getValues({{address = res[1].address + (i * 4), flags = 4}})[1].value) end
        end

        if unique_cachedPointerResults == nil then
            unique_cachedPointerResults = loadPointerResults()
        end
        
        if unique_cachedPointerResults == nil then         
            gg.clearResults()
            gg.searchNumber("1852402515;1634882655;1951624809;1869182049;1869766510;1215195490;6582127::25", 4)
            gg.refineNumber("1852402515", 4)
            local count = gg.getResultCount()
            if count == 0 then 
                gg.alert("لم يتم العثور ع المؤشر الاساسي") 
                gg.setVisible(true) 
                return 
            end
            unique_cachedPointerResults = gg.getResults(count)
            savePointerResults(unique_cachedPointerResults)
        end
    end

    -- إخفاء القائمة لتسهيل الضغط على الهدية
    gg.setVisible(false)
    gg.toast("⏳ جاهز.. اضغط على الهدية 29 لتطبيق العناصر تباعاً")

    -- التكرار التتابعي المعتمد على تفاعل المستخدم مع اللعبة
    for index, item in ipairs(sectionData.items) do
        
        -- 1. تطبيق العنصر الحالي وجعل القيمة 2
        if item.isPointer then
            local unique_editList = {}
            for _, r in ipairs(unique_cachedGiftResults) do
                table.insert(unique_editList, {address = r.address + 100, value = 2, flags = 4})                
                table.insert(unique_freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
                table.insert(unique_freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
                for i = 0, 5 do table.insert(unique_editList, {address = r.address + 40 + (i * 4), value = unique_tableA[i+1], flags = 4}) end
                table.insert(unique_editList, {address = r.address + 48, value = item.Level, flags = 4})
                table.insert(unique_editList, {address = r.address + 76, value = 0, flags = 4})
                table.insert(unique_editList, {address = r.address + 80, value = countVal, flags = 4})
            end

            local codeCount = #item.Code
            for _, ptr in ipairs(unique_cachedPointerResults) do
                for i = 0, codeCount - 1 do
                    table.insert(unique_editList, {
                        address = ptr.address + (i * 4), 
                        value = item.Code[i+1], 
                        flags = 4
                    })
                end
            end
            gg.setValues(unique_editList)

        else
            local unique_editList = {}
            for _, r in ipairs(unique_cachedGiftResults) do
                    table.insert(unique_editList, {address = r.address + 100, value = 0, flags = 4})
                    for j, h in ipairs(item.Code) do table.insert(unique_editList, {address = r.address + 40 + (j * 4), value = h, flags = 4}) end
                    table.insert(unique_editList, {address = r.address + 76, value = 0, flags = 4})
                    table.insert(unique_editList, {address = r.address + 80, value = countVal, flags = 4})
                
            end
            gg.setValues(unique_editList)
        end

        -- إعلام المستخدم بالعنصر الحالي الذي ينتظر الاستلام
        gg.toast("📦 في انتظار استلام: " .. item.name)

        -- 2. حلقة انتظار ذكية: تراقب القيمة في الذاكرة حتى يتحول الحماس إلى 1 (دليل ضغط المستخدم على الهدية)
        local waitingForClaim = true
        while waitingForClaim do
            gg.sleep(300) -- فحص كل 300 جزء من الثانية لعدم الضغط على المعالج
            
            if unique_cachedGiftResults and #unique_cachedGiftResults > 0 then
                local currentValObj = gg.getValues({{address = unique_cachedGiftResults[1].address + 12, flags = 4}})
                if currentValObj and currentValObj[1] then
                    -- إذا تحولت القيمة إلى 1، فهذا يعني أن المستخدم أخذ الهدية
                    if currentValObj[1].value == 1 then
                        waitingForClaim = false
                    end
                end
            end
        end

        -- إشعار سريع بأن العنصر تم استلامه بنجاح
        gg.toast("✅ تم استلام: " .. item.name)
        gg.sleep(500) -- مهلة قصيرة جداً قبل الانتقال للعنصر التالي
    end

    gg.alert("🎉 تم الانتهاء من تطبيق واستلام جميع عناصر قسم (" .. sectionData.section .. ") بنجاح!")
end



local cachedGiftResults = nil
function applyUnified(item)
    if cachedGiftResults == nil then
        gg.toast("​🇦 🇭 🇲 🇪 🇩")
        gg.clearResults()
        gg.searchNumber("65538;1;1;12546::113", 4)
        gg.refineNumber("65538", 4)
        cachedGiftResults = gg.getResults(gg.getResultCount())
        
        if #cachedGiftResults == 0 then 
            gg.alert("لم يتم العثور على الهدية 29!") 
            return 
        end
    end

    if item.isPointer then
        if tableA == nil then
            gg.clearResults()
            gg.searchNumber("1768641320;1769105507;1634563187;1634882584;33;27::57", 4)
            gg.refineNumber("33", 4)
            local res = gg.getResults(1)
            if #res == 0 then gg.alert("لم يتم العثور ع كود استبدال المؤشر") return end
            tableA = {}
            for i = 0, 5 do table.insert(tableA, gg.getValues({{address = res[1].address + (i * 4), flags = 4}})[1].value) end
        end

        if cachedPointerResults == nil then
            cachedPointerResults = loadPointerResults()
        end
        
        if cachedPointerResults == nil then         
            gg.clearResults()
            gg.searchNumber("1852402515;1634882655;1951624809;1869182049;1751342958;1953720690;7561581::25", 4)
            gg.refineNumber("1852402515", 4)
            local count = gg.getResultCount()
            if count == 0 then gg.alert("لم يتم العثور ع المؤشر الاساسي") return end
            cachedPointerResults = gg.getResults(count)
            savePointerResults(cachedPointerResults)
        end

        local editList, freezeList = {}, {}
        for _, r in ipairs(cachedGiftResults) do
            table.insert(freezeList, {address = r.address + 100, value = 0, flags = 4, freeze = true})
            table.insert(freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
            table.insert(freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
            for i = 0, 5 do table.insert(editList, {address = r.address + 40 + (i * 4), value = tableA[i+1], flags = 4}) end
            table.insert(editList, {address = r.address +48, value = item.Level, flags = 4})
        end

        local codeCount = #item.Code
        for _, ptr in ipairs(cachedPointerResults) do
            for i = 0, codeCount - 1 do
                table.insert(editList, {
                    address = ptr.address + (i * 4), 
                    value = item.Code[i+1], 
                    flags = 4
                })
            end
        end
        
        gg.setValues(editList)
        gg.addListItems(freezeList)
        gg.alert("تم الاستبدال بنجاح ✅️\n\nاذهب واضغط ع الهدية 29 🎁")

    else
      local editList, freezeList = {}, {}
        for _, r in ipairs(cachedGiftResults) do
                table.insert(freezeList, {address = r.address + 100, value = 0, flags = 4, freeze = true})
                table.insert(freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
                table.insert(freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
                for j, h in ipairs(item.Code) do table.insert(editList, {address = r.address + 36 + (j * 4), value = h, flags = 4}) end
                table.insert(editList, {address = r.address + 76, value = 0, flags = 4})
                table.insert(editList, {address = r.address + 80, value = 1, flags = 4})
          
        end
        gg.setValues(editList)
        gg.addListItems(freezeList)
        gg.alert("تم الاستبدال بنجاح ✅️\n\nاذهب واضغط ع الهدية 29 🎁")
    end
    gg.setVisible(false)
end


function applySkins(skinData, typeKey)
    if cachedGiftResults == nil then
        gg.toast("❤️ صلي على النبي ❤️")
        gg.clearResults()
        gg.searchNumber("65538;1;1;12546::113", 4)
        gg.refineNumber("65538", 4)
        local count = gg.getResultCount()
        if count == 0 then gg.alert("لم يتم العثور على الهدية 29!") return end
        cachedGiftResults = gg.getResults(count)
    end
    if baseAddresses[typeKey] == nil then
        gg.clearResults()
        local search = skin_searches[typeKey]
        gg.searchNumber(search.code, 4)
        gg.refineNumber(search.refine, 4)
        local results = gg.getResults(1)
        if #results == 0 then gg.alert("لم يتم العثور على " .. typeKey) return end
        baseAddresses[typeKey] = results[1].address
    end
    local currentBase = baseAddresses[typeKey] + skinData.offset
    local values = gg.getValues({{address = currentBase, flags = 4}, {address = currentBase+4, flags = 4}, {address = currentBase+8, flags = 4}, {address = currentBase+12, flags = 4}, {address = currentBase+16, flags = 4}, {address = currentBase+20, flags = 4}})
    local editList, freezeList = {}, {}
    for _, r in ipairs(cachedGiftResults) do
        table.insert(freezeList, {address = r.address + 100, value = 0, flags = 4, freeze = true})
        table.insert(freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
        table.insert(freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
        for j = 0, 5 do table.insert(editList, {address = r.address + 40 + (j * 4), value = values[j+1].value, flags = 4}) end
    end
    gg.setValues(editList)
    gg.addListItems(freezeList)
    gg.toast("تم حقن " .. skinData.name .. " بنجاح ✅")
    gg.alert("تم الاستبدال بنجاح ✅️\n\nاذهب واضغط ع الهدية 29 🎁")
end

function applyTicket()
    gg.setVisible(false) 
    gg.toast("🇦 🇭 🇲 🇪 🇩")   
    gg.clearResults() 
    gg.searchNumber("1634038552;1937011470;700~10000::121", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("700~10000", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local results = gg.getResults(100) 
    local count = #results
    
    if count == 0 then
        gg.alert("لم يتم العثور على نتائج!")
        return
    end

    local modifications = {}
    for i = 1, count do
        local baseAddress = results[i].address
        table.insert(modifications, {address = baseAddress + 0xD0, value = 0, flags = gg.TYPE_DWORD})
        table.insert(modifications, {address = baseAddress + 0xD0 + 4, value = 700, flags = gg.TYPE_DWORD})
        table.insert(modifications, {address = baseAddress + 0xD0 + 16, value = 1, flags = gg.TYPE_DWORD})
    end
    
    gg.setValues(modifications)
    gg.toast("تم فتح التصريح بنجاح ✅️")
    saveState("TICKET_MENU", "0")
    gg.setVisible(false)
return
end

function getTicketID(input)
    local num = tonumber(input)
    if num then return num end
    for _, v in ipairs(tickets_id) do
        if v.name == input then return v.id end
    end
    return nil
end

function changeTicket(srcInput, destInput)
    local idSrc = getTicketID(srcInput)
    local idDest = getTicketID(destInput)

    if not idSrc or not idDest then
        gg.alert("تأكد من كتابة ارقام التصريح 🫠")
        return
    end
    gg.toast(" ❤️ صلي على النبي ❤️ ")
    gg.clearResults()
    gg.searchNumber("1634038552;1937011470;700~10000::121", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("700~1000", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local results = gg.getResults(100)
    local srcAddress = nil
    local destAddresses = {}

    for _, v in ipairs(results) do
        if v.value == idSrc and srcAddress == nil then srcAddress = v.address end
        if v.value == idDest then table.insert(destAddresses, v.address) end
    end

    if not srcAddress or #destAddresses == 0 then
        gg.alert("ارقام التصريح الذي ادخلتها خاطئة ❌️ ، راجع إرشادات التصريحات 📖")
        return
    end

    local sourceValues = {}
    for i = 0, 255 do
        sourceValues[i + 1] = {address = srcAddress - 0x1E8 + (i * 4), flags = gg.TYPE_DWORD}
    end
    
    local data = gg.getValues(sourceValues)
    
    local allTargetValues = {}
    for _, dAddr in ipairs(destAddresses) do
        for i = 0, 255 do
            table.insert(allTargetValues, {
                address = dAddr - 0x1E8 + (i * 4), 
                flags = gg.TYPE_DWORD, 
                value = data[i + 1].value
            })
        end
    end
    
    gg.setValues(allTargetValues)
    gg.clearResults()
    gg.alert("✅️ تم تبديل التصريح بنجاح!\n\n⚠️ يجب عليك إغلاق اللعبة وإعادة فتحها لمشاهدة التغييرات.")
    saveState("TICKET_MENU", "0")
    gg.setVisible(false)
end


function searchByName(defaultChoice, lastQuery)
    local userInput = lastQuery
    if not userInput then
        local input = gg.prompt({" أدخل اسم الشيء الذي تريده : "}, nil, {"text"})
        if not input or trim(input[1]) == "" then 
            mainMenu() 
            return 
        end
        userInput = trim(input[1]):lower()
    end
    
    local matches = {}
    for _, sect in ipairs(config) do 
        for _, item in ipairs(sect.items) do 
            if trim(item.name):lower():find(userInput) then table.insert(matches, {data = item, type = "U"}) end 
        end 
    end
    for _, item in ipairs(Decors) do
        if trim(item.Name):lower():find(userInput) then table.insert(matches, {data = item, type = "U"}) end
    end
    for k, cat in pairs(skins) do
        for _, item in ipairs(cat) do
            if trim(item.name):lower():find(userInput) then table.insert(matches, {data = {item = item, key = k}, type = "S"}) end
        end
    end
    
    if #matches == 0 then
        gg.alert("لا يوجد شيء بهذا الاسم ❌️")
        mainMenu()
    else
        local names = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة", "🔍 البحث عن شيء آخر"}
        for _, m in ipairs(matches) do
            table.insert(names, m.data.name or m.data.Name or m.data.item.name)
        end
        table.insert(names, "🔍 البحث عن شيء آخر")
        table.insert(names, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")
        
        saveState("SEARCH_MENU", userInput .. "|" .. tostring(defaultChoice or 1))
        
        local choice = gg.choice(names, tonumber(defaultChoice) or 3, "نتائج البحث التي تحتوي على: " .. userInput)

        
        if choice == nil then 
            gg.setVisible(false)
        elseif choice == 1 or choice == #names then 
            saveState("SEARCH_MENU", "0")
            mainMenu()
        elseif choice == 2 or choice == #names - 1 then
            saveState("SEARCH_MENU", "0")
            searchByName()
        else 
            saveState("SEARCH_MENU", userInput .. "|" .. tostring(choice))
            local sel = matches[choice - 2]
            if sel.type == "U" then applyUnified(sel.data)
            elseif sel.type == "S" then applySkins(sel.data.item, sel.data.key) end
            gg.setVisible(false)
        end
    end
end


local cachedResults = nil
function finishEventMenu()
    local choice = gg.choice({"إنجاز الجزء الأول", "إنجاز الجزء الثاني", "⬅️ عودة"}, nil, "قائمة إنجاز الحدث")
    
    if choice == 1 then
        performFinish(1)
    elseif choice == 2 then
        performFinish(10000)
    elseif choice == 3 then
        expEventMenu()
    end
end

function performFinish(val)
    if not cachedResults or #cachedResults == 0 then
        gg.toast("❤️ صلي على النبي ❤️")
        gg.clearResults()
        gg.searchNumber("1886930200;1953064037;256::121", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
        gg.refineNumber("256", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
        cachedResults = gg.getResults(100)
    end
    
    if cachedResults and #cachedResults > 0 then
        local edits = {}
        local resultsToGet = gg.getValues(cachedResults)
        
        for i, v in ipairs(cachedResults) do
            local addr1 = v.address + 0xC
            local addr2 = v.address + 0xC - 4
            
            local val1 = gg.getValues({{address = addr1, flags = gg.TYPE_DWORD}})[1].value
            local val2 = gg.getValues({{address = addr2, flags = gg.TYPE_DWORD}})[1].value
            
            if val1 == 0 then
                table.insert(edits, {address = addr1, value = val, flags = gg.TYPE_DWORD})
            end
            
            if val2 == 0 then
                table.insert(edits, {address = addr2, value = val, flags = gg.TYPE_DWORD})
            end
        end
        
        if #edits > 0 then
            gg.setValues(edits)
            if val == 1 then
                gg.alert("تم إنجاز الجزء الأول بنجاح")
            else
                gg.alert("تم إنجاز الجزء الثاني بنجاح")
            end
        else
            gg.alert("حدث خطأ في إنجاز الحدث ⚠️")
        end
    else
        gg.alert("لم يتم العثور على نتائج")
        cachedResults = nil
    end
end

function changeEvent(currentId, targetId)
    local currentEv = eve_searchs["Event " .. currentId]
    local targetEv = eve_searchs["Event " .. targetId]

    if not currentEv or not targetEv then
        gg.alert("حدث غير موجود في الجدول، تأكد من الـ ID ف الإرشادات 📖")
        return
    end

    -- البحث الأول والصقل والتعديل للحدث الحالي
    gg.toast(" ❤️ صلي على النبي ❤️ ")
    gg.clearResults()
    gg.searchNumber(currentEv["code"][1], gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber(currentEv["refine"][1], gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local res1 = gg.getResults(1000)
    for i, v in ipairs(res1) do
        v.value = 0
    end
    gg.setValues(res1)

    -- البحث الثاني والصقل والتعديل للحدث المستهدف
    
    gg.clearResults()
    gg.searchNumber(targetEv["code"][2], gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber(targetEv["refine"][2], gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local res2 = gg.getResults(1)
    if #res2 > 0 then
        res2[1].value = 1782464400
        gg.setValues(res2)
    end
    gg.clearResults()
    gg.toast("تم تبديل الحدث بنجاح ✅️")
    saveState("EVENT_MENU", "0") 
    gg.setVisible(false)
end



function restartEvent()
    gg.toast("❤️ صلي على النبي ❤️")
    gg.clearResults()
    gg.searchNumber("1886930212;1953064037;1601073001::9", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local results = gg.getResults(1000)
    if #results > 0 then
        local edits = {}
        for i, v in ipairs(results) do
            table.insert(edits, {address = v.address, value = 0, flags = gg.TYPE_DWORD})
        end
        gg.setValues(edits)
        gg.toast("تمت إعادة ضبط الحدث بنجاح ✅")
    else
        gg.alert("لم يتم العثور على نتائج لإعادة الضبط")
    end
    gg.clearResults()
end


function trim(s)
    return s:match("^%s*(.-)%s*$")
end


local cachedReceiveCardsResults = nil
function receiveCards()
    local userInput = gg.prompt(
        {"اكتب عدد أكياس الكروت الذهبية التي تريدها:"},
        nil,
        {"number"}
    )

    if not userInput or userInput[1] == "" then
        return
    end

    local targetVal = tonumber(userInput[1])
    if targetVal == nil then
        gg.alert("لم يتم إدخال عدد صحيح .. حاول مجدداً 😁")
        return
    end

    gg.toast("🇦 🇭 🇲 🇪 🇩")

    -- البحث يتم مرة واحدة فقط ويتم حفظ النتائج مؤقتاً
    if cachedReceiveCardsResults == nil then
        gg.clearResults()
        gg.searchNumber("65538;1;1;12546::113", 4)
        gg.refineNumber("65538", 4)

        local count = gg.getResultCount()
        if count == 0 then
            gg.alert("لم يتم العثور ع هدية رقم 1 في متجر سباق الزوارق ❌")
            gg.setVisible(true)
            return
        end
        cachedReceiveCardsResults = gg.getResults(count)
    end

    local editList = {}
    local freezeList = {}

    for _, r in ipairs(cachedReceiveCardsResults) do
        local baseAddress = r.address

        table.insert(editList, {address = baseAddress + 40, value = 1918976790, flags = 4})
        table.insert(editList, {address = baseAddress + 44, value = 1348420452, flags = 4})
        table.insert(editList, {address = baseAddress + 48, value = 896230241, flags = 4})
        table.insert(editList, {address = baseAddress + 52, value = 0, flags = 4})
        table.insert(editList, {address = baseAddress + 56, value = 0, flags = 4})
        table.insert(editList, {address = baseAddress + 60, value = 0, flags = 4})

        table.insert(freezeList, {address = baseAddress + 100, value = 0, flags = 4, freeze = true})

        table.insert(editList, {address = baseAddress + 76, value = 0, flags = 4})

        table.insert(editList, {address = baseAddress + 80, value = targetVal, flags = 4})

        table.insert(freezeList, {address = baseAddress + 84, value = 0, flags = 4, freeze = true})
        table.insert(freezeList, {address = baseAddress + 88, value = 0, flags = 4, freeze = true})
    end

    gg.setValues(editList)
    gg.addListItems(freezeList)

    gg.alert("اذهب الى متجر سباق الزوارق واضغط ع الهدية رقم 1 لاستلام اكياس الكروت الذهبية ✅️")
    gg.clearResults()
end


function upCards()
    gg.clearResults()
    gg.searchNumber("1918984974~1918984976;1~20::29", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("1~20", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local res = gg.getResults(1000)
    if #res == 0 then
       gg.alert("لم يتم العثور ع نتايج ❌️\n\nتأكد من وجود كروت بالفعل حتى يتم زيادتها ✅️\n\nأو تأكد من انك اخترت اللعبه قبل بدأ الاسكريبت ✅️")
    
        return
    end
    
    local prompt = gg.prompt({"اكتب العدد الذي تريده"}, {[1] = 1}, {"number"})
    if prompt == nil then return end
    
    local val = tonumber(prompt[1])
    for i, v in ipairs(res) do
        res[i].value = val
    end
    
    gg.setValues(res)
    gg.clearResults()
    gg.toast("تم زيادة عدد الكروت بنجاح ✅️")
    saveState("CARDS_MENU", "0")
    gg.setVisible(false)
end

function sendCards()
    if cardsEnabled then gg.alert("⚠️ إرسال الكروت مفعل بالفعل."); return end

    gg.toast("❤️ صلي على النبي ❤️")

    if cardsCached then
        local freezeItems, edit1, edit2 = {}, {}, {}

        for _, v in ipairs(cardsBackup.freezeItems) do table.insert(freezeItems, {address = v.address, flags = v.flags, value = 0, freeze = true}) end
        if #freezeItems > 0 then gg.setValues(freezeItems); gg.addListItems(freezeItems) end

        for _, v in ipairs(cardsBackup.values1) do table.insert(edit1, {address = v.address, flags = v.flags, value = 2003790951}) end
        if #edit1 > 0 then gg.setValues(edit1) end

        for _, v in ipairs(cardsBackup.values2) do table.insert(edit2, {address = v.address, flags = v.flags, value = 0}) end
        if #edit2 > 0 then gg.setValues(edit2) end

        cardsEnabled = true
        gg.alert("يمكنك الآن إرسال الكروت بنجاح ✅️\n\n⚠️ لا ترسل الكثير من الكروت دفعة واحدة، حتى لا تتعرض أنت ولمن ترسل له للحظر 🚫")
        saveState("CARDS_MENU", "0")
        gg.setVisible(false)
        return
    end

    cardsBackup = {freezeItems = {}, values1 = {}, values2 = {}}

    -- تجميد القيم
    gg.clearResults()
    gg.searchNumber("65535;3;86400::37", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("86400", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

    local res = gg.getResults(1)

    if #res > 0 then
        local addr = res[1].address


        for i = 0, 5 do
            local item = {address = addr + 0x20 + (i * 4), flags = gg.TYPE_DWORD, value = 0, freeze = true}
            table.insert(cardsBackup.freezeItems, item)
            gg.setValues({item})
            gg.addListItems({item})
        end

        local extraItems = {}
        for i = 0, 3 do table.insert(extraItems, {address = addr + 80 + (i * 4), flags = gg.TYPE_DWORD, value = 0, freeze = true}) end

        for _, item in ipairs(extraItems) do table.insert(cardsBackup.freezeItems, item) end

        gg.setValues(extraItems)
        gg.addListItems(extraItems)
    end

    -- حفظ وإرسال المجموعة الأولى
    gg.clearResults()
    gg.searchNumber("4;1684828007;0;0::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

    local res2 = gg.getResults(1000)

    for _, v in ipairs(res2) do
        if v.value == 1684828007 then
            table.insert(cardsBackup.values1, {address = v.address, flags = v.flags, value = v.value})
            v.value = 0
        end
    end

    if #res2 > 0 then gg.setValues(res2) end

    -- حفظ وإرسال المجموعة الثانية
    gg.clearResults()
    gg.searchNumber("1701274988;1918985326;121::9", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

    local res3 = gg.getResults(100)

    for _, v in ipairs(res3) do
        table.insert(cardsBackup.values2, {address = v.address, flags = v.flags, value = v.value})
        v.value = 0
    end

    if #res3 > 0 then gg.setValues(res3) end

    cardsCached = true
    cardsEnabled = true

    gg.clearResults()
    gg.alert("يمكنك الآن إرسال الكروت بنجاح ✅️\n\n⚠️ لا ترسل الكثير من الكروت دفعة واحدة، حتى لا تتعرض أنت ولمن ترسل له للحظر 🚫")
    saveState("CARDS_MENU", "0")
    gg.setVisible(false)
end

function cancelSendCards()
    if not cardsEnabled then
        gg.alert("⚠️ لا توجد عملية إرسال كروت مفعلة.")
        return
    end

    gg.toast("⏳ جاري إلغاء إرسال الكروت...")

    -- إزالة جميع التجميدات المحفوظة
    if cardsBackup and cardsBackup.freezeItems and #cardsBackup.freezeItems > 0 then
        gg.removeListItems(cardsBackup.freezeItems)
    end

    -- استرجاع المجموعة الأولى
    if cardsBackup and cardsBackup.values1 and #cardsBackup.values1 > 0 then
        gg.setValues(cardsBackup.values1)
    end

    -- استرجاع المجموعة الثانية
    if cardsBackup and cardsBackup.values2 and #cardsBackup.values2 > 0 then
        gg.setValues(cardsBackup.values2)
    end

    -- إلغاء التفعيل مع الاحتفاظ بالكاش
    cardsEnabled = false

    gg.clearResults()
    gg.alert("✅ تم إلغاء إرسال الكروت بنجاح.")
    saveState("CARDS_MENU", "0")
    gg.setVisible(false)
end

function applyStars()
    local userInput = gg.prompt(
        {
            "⭐ اكتب عدد النجوم التي لديك حالياً في الحدث:",
            "🎁 اكتب عدد النجوم التي تريد وضعها:"
        },
        nil,
        {"number", "number"}
    )

    if not userInput or userInput[1] == "" or userInput[2] == "" then
        return
    end

    local currentStars = tonumber(userInput[1])
    local targetStars = tonumber(userInput[2])

    if currentStars == nil or currentStars == 0 then
        gg.alert("يجب أن يكون لديك نجوم بالفعل ❌\n(لا يمكن أن يكون العدد 0 أو فارغاً)")
        return
    end

    if targetStars == nil then
        gg.alert("لم يتم إدخال عدد صحيح .. حاول مجدداً 😁")
        return
    end

    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()
    
    local searchQuery = "256;" .. currentStars .. ";0;" .. currentStars .. "::101"
    gg.searchNumber(searchQuery, 4)

    local refineQuery1 = currentStars .. ";0;" .. currentStars .. "::9"
    gg.refineNumber(refineQuery1, 4)

    gg.refineNumber("0", 4)

    local resultsCount = gg.getResultCount()
    
    if resultsCount == 1 then
        local res = gg.getResults(1)
        local baseAddress = res[1].address

        local editList = {
            {address = baseAddress - 8, value = targetStars, flags = 4},
            {address = baseAddress - 4, value = targetStars, flags = 4},
            {address = baseAddress + 4, value = targetStars, flags = 4}
        }

        gg.setValues(editList)
        gg.clearResults()
        gg.toast("تم تعديل عدد النجوم بنجاح ✅️")

    elseif resultsCount > 1 then
        local allResults = gg.getResults(resultsCount)
        local validAddress = nil

        for _, r in ipairs(allResults) do
            local checkVal = gg.getValues({{address = r.address + 144, flags = 4}})
            if checkVal and checkVal[1] and checkVal[1].value == 3 then
                validAddress = r.address
                break
            end
        end

        if validAddress then
            local editList = {
                {address = validAddress - 8, value = targetStars, flags = 4},
                {address = validAddress - 4, value = targetStars, flags = 4},
                {address = validAddress + 4, value = targetStars, flags = 4}
            }

            gg.setValues(editList)
            gg.clearResults()
            gg.toast("تم تعديل عدد النجوم بنجاح ✅️")
        else
            gg.alert("❌ لم يتم العثور على النتيجة الصحيحة من ضمن النتائج المتعددة.\n\nتأكد من نطاقات الذاكرة، واغلق اللعبة واعد تشغيلها.")
            gg.setVisible(true)
        end

    else
        gg.alert("❌ لم يتم العثور على النتيجة.\n\nتأكد من نطاقات الذاكرة، واغلق اللعبة واعد تشغيلها.")
        gg.setVisible(true)
    end
end



function changeCards()
    gg.toast("❤️ صلي على النبي ❤️")
    gg.clearResults()
    gg.searchNumber("1918976802;1819231076;1952671084;1936617321;1789117200::73", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("1789117200", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local results1 = gg.getResults(100)
    
    gg.clearResults()
    gg.searchNumber("1789117200;1918976802;1819231076;1952671084;1936617321::213", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    gg.refineNumber("1789117200", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
    
    local results2 = gg.getResults(100)
    local allResults = {}
    
    for i, v in ipairs(results1) do
        table.insert(allResults, v)
    end
    
    for i, v in ipairs(results2) do
        table.insert(allResults, v)
    end
    
    if #allResults > 0 then
        for i, v in ipairs(allResults) do
            v.value = 1782464400
            v.flags = gg.TYPE_DWORD
        end
        gg.setValues(allResults)
        gg.toast("تم الاستبدال حدث الكروت بنجاح ✅️️")
    else
        gg.alert("لم يتم العثور نتايج ، قد لا يكون هناك حدث كروت قادم في الوقت الحالي 💁🏻‍♂️")
    end
    saveState("CARDS_MENU", "0")
    gg.setVisible(false)
end

function applyBreak(selectedItems)
    local confirm = gg.alert("سيتم تنفيذ المهام المحددة، هل تريد الإكمال؟", "نعم", "لا")
    
    if confirm == 1 then
        for _, item in ipairs(selectedItems) do
            processBreak(item)
        end
    else
        gg.setVisible(true)
        return
    end
    gg.setVisible(false)
end

function processBreak(item)
    gg.clearResults()
    gg.searchNumber(item.Code, 4)
    gg.refineNumber(item.refine, 4)
    
    local count = gg.getResultsCount()
    if count == 0 then return end
    
    local results = gg.getResults(count)
    local editList = {}
    
    for _, r in ipairs(results) do
        table.insert(editList, {address = r.address + 36, value = 0, flags = 4})
        table.insert(editList, {address = r.address + 40, value = 50000, flags = 4})
    end    
    gg.setValues(editList)    
    gg.toast("تم إنجاز مهمة " .. item.name .. " بنجاح 🥰✅️")
end

function applyOv_gifts(selectedItems)
    local confirm = gg.alert("سيتم تنفيذ المهام المحددة، هل تريد الإكمال؟", "نعم", "لا")
    
    if confirm == 1 then
        for _, item in ipairs(selectedItems) do
            processGift(item)
        end
    else
        gg.setVisible(true)
        return
    end
    gg.setVisible(false)
end

function processGift(item)
    gg.clearResults()
    gg.searchNumber(item.Code, 4)
    gg.refineNumber(item.refine, 4)
    
    local count = gg.getResultsCount()
    if count == 0 then return end
    
    local results = gg.getResults(count)
    local editList = {}
    
    for _, r in ipairs(results) do
        table.insert(editList, {address = r.address + 36, value = 0, flags = 4})
        table.insert(editList, {address = r.address + 40, value = 50000, flags = 4})
    end    
    gg.setValues(editList)    
    gg.toast("تم إنجاز مهمة " .. item.name .. " بنجاح 🥰✅️")
end

local isMatch3SearchDone = false
local match3Results = {}

function applyShow(choice)
    if not isMatch3SearchDone then
        gg.clearResults()
        gg.searchNumber("100;15;86400::29", gg.TYPE_DWORD)
        gg.refineNumber("100", gg.TYPE_DWORD)
        match3Results = gg.getResults(100)
        
        if #match3Results == 0 then
            gg.alert([[
❌ لم يتم العثور على النتائج.

يرجى التأكد من:
• ربط مدينتك بالاسكريبت.
• اختيار نطاقات الذاكرة المناسبة.


ثم أعد المحاولة.
]])
            return
        end
        isMatch3SearchDone = true
    end

    if choice == 4 then
        local t = {}
        for i, v in ipairs(match3Results) do
            table.insert(t, {address = v.address + 8, flags = gg.TYPE_DWORD, value = 300})
        end
        gg.setValues(t)
        gg.clearResults()
        gg.toast("تم التعديل بنجاح ✅️")

    elseif choice == 2 then
        local input = gg.prompt({"ما عدد الحركات التي تريد زيادتها"}, {[1] = 1}, {"number"})
        if not input then return end
        
        local t = {}
        for i, v in ipairs(match3Results) do
            table.insert(t, {address = v.address + 24, flags = gg.TYPE_DWORD, value = input[1], freeze = true})
        end
        gg.setValues(t)
        gg.addListItems(t)
        gg.clearResults()
        gg.toast("تم التعديل بنجاح ✅️")
    end
end


function showDragonNest()
    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()
    
    gg.searchNumber("1634878484~1634878506;1315860327::5", 4)
    gg.refineNumber("1634878484~1634878506", 4)
    
    local count = gg.getResultCount()
    
    if count > 0 then
        local results = gg.getResults(count)
        local editList = {}
        for _, r in ipairs(results) do
            table.insert(editList, {address = r.address, value = 0, flags = 4})
        end
        
        gg.setValues(editList)
        gg.toast("تم التعديل بنجاح ✅️")
        gg.clearResults()
    else
        gg.alert("❌ لم يتم العثور على النتيجة.\n\nتأكد من نطاقات الذاكرة، واغلق اللعبة واعد تشغيلها.")
        gg.setVisible(true)
    end
end

function showTrainJourney()
    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()
    
    gg.searchNumber("1634882550~1634882610;1867148905::5", 4)
       
    local count = gg.getResultCount()
    
    if count > 0 then
        local results = gg.getResults(count)
        local editList = {}
        for _, r in ipairs(results) do
            table.insert(editList, {address = r.address, value = 0, flags = 4})
        end
        
        gg.setValues(editList)
        gg.toast("تم التعديل بنجاح ✅️")
        gg.clearResults()
    else
        gg.alert("❌ لم يتم العثور على النتيجة.\n\nتأكد من نطاقات الذاكرة، واغلق اللعبة واعد تشغيلها.")
        gg.setVisible(true)
    end
end


function upMatch3()
    local userInput = gg.prompt(
        {
            "🎯 اكتب مستوى المطابقة الحالي:",
            "🚀 اكتب مستوى المطابقة الذي تريده:"
        },
        nil,
        {"number", "number"}
    )

    if not userInput or userInput[1] == "" or userInput[2] == "" then
        return
    end

    local currentMatch = tonumber(userInput[1])
    local targetMatch = tonumber(userInput[2])

    if currentMatch == nil or targetMatch == nil then
        gg.alert("لم يتم إدخال عدد صحيح .. حاول مجدداً 😁")
        return
    end

    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()

    local searchQuery = "65537;-1;" .. currentMatch .. ";2::217"
    gg.searchNumber(searchQuery, 4)

    gg.refineNumber("2", 4)

    local resultsCount = gg.getResultCount()
    local targetAddress = nil

    if resultsCount == 1 then
        local res = gg.getResults(1)
        targetAddress = res[1].address
    elseif resultsCount > 1 then
        local allResults = gg.getResults(resultsCount)
        for _, r in ipairs(allResults) do
            local checkVal = gg.getValues({{address = r.address - 4, flags = 4}})
            if checkVal and checkVal[1] then
                local val = checkVal[1].value
                if val == currentMatch  then
                    targetAddress = r.address
                    break
                end
            end
        end
    end

    if targetAddress then
        local editList = {
            {address = targetAddress - 4, value = targetMatch, flags = 4}
        }
        gg.setValues(editList)
        gg.clearResults()
        gg.alert("✅ تم تعديل مستوى المطابقة بنجاح\n\n🎯 اذهب وقم بإنجاز مستوى حتى يتم تثبيت التغييرات.")
    else
        gg.alert("❌ لم يتم العثور على النتيجة.\n\nتأكد من نطاقات الذاكرة، واغلق اللعبة واعد تشغيلها.")
        gg.setVisible(true)
    end
end


function flipTiles()
    local choice = gg.choice({
        "⭐ عدد النجوم",
        "🏁 تخطي المرحلة",
        "⬅️ عــــــــــــــــــــــــــــــــــــــــــــودة"
    }, nil, "🎮 إدارة المراحل والنجوم")

    if not choice or choice == 3 then
        
        return
    end

    gg.toast(" ❤️ صلي ع النبي ❤️ ")

if cachedFlipTilesResults == nil then
    gg.clearResults()
    gg.searchNumber("257;1768703518;1701336176;1701603668;1701998403::109", gg.TYPE_DWORD)
    gg.refineNumber("1768703518", gg.TYPE_DWORD)

    cachedFlipTilesResults = gg.getResults(1000)

    if #cachedFlipTilesResults == 0 then
        cachedFlipTilesResults = nil
        gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 ظبط النطاقات أو قم بغلق اللعبة وأعد تشغيلها وجرب مرة أخرى."
)
        return
    end
end

    local addr = cachedFlipTilesResults[1].address

    if choice == 1 then
        local input = gg.prompt(
            {"اكتب عدد النجوم التي تريد اضافتها"},
            {""},
            {"number"}
        )

        if not input then return end
        local starsCount = tonumber(input[1])
        if not starsCount then return end

        gg.setValues({
            {address = addr + 24, flags = gg.TYPE_DWORD, value = 0},
            {address = addr + 28, flags = gg.TYPE_DWORD, value = starsCount}
        })

        gg.toast("تم زيادة عدد النجوم بنجاح ✅️")

    elseif choice == 2 then
        local input = gg.prompt(
            {"اكتب عدد المرحلة التي تريد الوصول اليها (1-15)"},
            {""},
            {"number"}
        )

        if not input then return end
        local stageLevel = tonumber(input[1])
        if not stageLevel then return end

        gg.setValues({
            {address = addr + 32, flags = gg.TYPE_DWORD, value = 0},
            {address = addr + 36, flags = gg.TYPE_DWORD, value = stageLevel}
        })

        gg.toast("تم الوصول للمرحلة بنجاح ✅️")
    end
    gg.clearResults()
    gg.setVisible(false)
end


function bugsMenu()
    gg.alert("🚧 قريبًا...")
    eventsMenu()
end

function dutyMenu()
    gg.alert("🚧 قريبًا...")
    eventsMenu()
end


function applyResource(item, sectionIndex, currentChoice)
    if item.name == "💰 زيادة الفلوس" then
        gg.alert([[
💰 زيــادة الـفـلـوس الـذهـبـيـة 💰

📌 بعد استلام الهدية:
• افتح مخزن الزينات.
• قم ببيع "الكاتب الأول".
• ستحصل على الفلوس الذهبية.

🌹 بالتوفيق.
]])
    end
    
    local promptMessage = "ما العدد الذي تريده :"
    if item.name == "⏰ معزز ديناميت بوقت (معزز خارجي)"
    or item.name == "⏰ معزز متفجر خط بوقت(معزز خارجي)"
    or item.name == "⏰ معزز كرة ديسكو بوقت(معزز خارجي)" 
    or item.name == "❤️ قلوب المطابقة بوقت" 
    or item.name == "✌🏻 المضاعف الاصفر( ×2)" then

    promptMessage = [[
⏱️ اكتب وقت المعزز الذي تريده (بالثواني)                                      

📌 أمثلة:                                      
• 86400 = يوم واحد                                     
• 8640000 = 100 يوم                                     
    ]]   
    end
    if item.name == "🏕️ زيادة حجم الشونة المؤقت" then
        promptMessage = [[ اكتب عدد اكتر من سعة الشونة عندك ]]
    end
    if item.name == "⏰️ تقليل وقت البناء"
    or item.name == "⏰️ تقليل وقت الزراعة"
    or item.name == "⏰️ تقليل وقت انتاج مزارع الحيوانات"
    or item.name == "⏰️ تقليل وقت رجوع الطائرة"then
    promptMessage = [[
⏱️ اكتب نسبة تقليل الوقت التي تريدها (%)                                      

📌 أمثلة:                                         
• 100 = إنهاء الوقت بالكامل ماعدا وقت الطائرة اكتب 99                                         
• 50 =  تقليل الوقت إلى النصف                                         
• 25 = تقليل الوقت بنسبة 25%                                         
]]
    end
 

    local countVal

-- قسم الملصقات لا يحتاج إدخال قيمة
local countVal

if resources[sectionIndex].section == "🎭 الملصقات 🎭"
or resources[sectionIndex].section == "🖼️ الصور 📸" then

    countVal = 1

else
    local userInput = gg.prompt({promptMessage}, nil, {"number"})
    if not userInput then
        return
    end

    countVal = tonumber(userInput[1])
    if userInput[1] == "" or countVal == nil then
        gg.alert("لم يتم إدخال عدد .. حاول مجدداً 😁")
        return
    end
end

    if unique_cachedGiftResults == nil then
        gg.toast("🇦 🇭 🇲 🇪 🇩")
        gg.clearResults()
        gg.searchNumber("65538;1;1;12546::113", 4)
        gg.refineNumber("65538", 4)
        unique_cachedGiftResults = gg.getResults(gg.getResultCount())
        
        if #unique_cachedGiftResults == 0 then 
            gg.alert("لم يتم العثور على الهدية 29!") 
            gg.setVisible(true)
            return 
        end
    end

    if item.isPointer then
        if unique_tableA == nil then
            gg.clearResults()
            gg.searchNumber("1768641320;1918132078;1601071457;1768058738;33;27::57", 4)
            gg.refineNumber("33", 4)
            local res = gg.getResults(1)
            if #res == 0 then gg.alert("لم يتم العثور ع كود استبدال المؤشر") gg.setVisible(true) return end
            unique_tableA = {}
            for i = 0, 5 do table.insert(unique_tableA, gg.getValues({{address = res[1].address + (i * 4), flags = 4}})[1].value) end
        end

        if unique_cachedPointerResults == nil then
            unique_cachedPointerResults = loadPointerResults()
        end
        
        if unique_cachedPointerResults == nil then         
            gg.clearResults()
            gg.searchNumber("1852402515;1634882655;1951624809;1869182049;1869766510;1215195490;6582127::25", 4)
            gg.refineNumber("1852402515", 4)
            local count = gg.getResultCount()
            if count == 0 then gg.alert("لم يتم العثور ع المؤشر الاساسي") gg.setVisible(true) return end
            unique_cachedPointerResults = gg.getResults(count)
            savePointerResults(unique_cachedPointerResults)
        end

        local unique_editList, unique_freezeList = {}, {}
        for _, r in ipairs(unique_cachedGiftResults) do
            table.insert(unique_freezeList, {address = r.address + 100, value = 0, flags = 4, freeze = true})
            table.insert(unique_freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
            table.insert(unique_freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
            for i = 0, 5 do table.insert(unique_editList, {address = r.address + 40 + (i * 4), value = unique_tableA[i+1], flags = 4}) end
            table.insert(unique_editList, {address = r.address + 48, value = item.Level, flags = 4})
            table.insert(unique_editList, {address = r.address + 76, value = 0, flags = 4})
            table.insert(unique_editList, {address = r.address + 80, value = countVal, flags = 4})
        end

        local codeCount = #item.Code
        for _, ptr in ipairs(unique_cachedPointerResults) do
            for i = 0, codeCount - 1 do
                table.insert(unique_editList, {
                    address = ptr.address + (i * 4), 
                    value = item.Code[i+1], 
                    flags = 4
                })
            end
        end
        
        gg.setValues(unique_editList)
        gg.addListItems(unique_freezeList)
        gg.alert("تم الاستبدال بنجاح ✅️\n\nاذهب واضغط ع الهدية 29 🎁")

    else
        local unique_editList, unique_freezeList = {}, {}
        for _, r in ipairs(unique_cachedGiftResults) do
                table.insert(unique_freezeList, {address = r.address + 100, value = 0, flags = 4, freeze = true})
                table.insert(unique_freezeList, {address = r.address + 84, value = 0, flags = 4, freeze = true})
                table.insert(unique_freezeList, {address = r.address + 88, value = 0, flags = 4, freeze = true})
                for j, h in ipairs(item.Code) do table.insert(unique_editList, {address = r.address + 36 + (j * 4), value = h, flags = 4}) end
                table.insert(unique_editList, {address = r.address + 76, value = 0, flags = 4})
                table.insert(unique_editList, {address = r.address + 80, value = countVal, flags = 4})
            
        end
        gg.setValues(unique_editList)
        gg.addListItems(unique_freezeList)
        gg.alert("تم الاستبدال بنجاح ✅️\n\nاذهب واضغط ع الهدية 29 🎁")
    end
    saveState("RES_SUB_MENU", tostring(sectionIndex) .. "|" .. tostring(currentChoice))
    gg.setVisible(false)
end


function applyDevelop(choice)
    if choice == 2 then
    local subChoice = gg.choice({
    "🟩 فتـــــــــح نصـــــــــف الأراضـــــــــي",
    "🟦 فتـــــــــح النصـــــــــف الآخـــــــــر",
    "🏙 فتـــــــــح جميـــــــــع الأراضـــــــــي دفعـــــــــة واحـــــــــدة",
    "⬅️ عــــــــــــــــــــــــــــــــــــــــــــودة"
}, nil, "🏗 توســـــــــيع المدينـــــــــة")

    if not subChoice or subChoice == 4 then
        developMenu()
        return
    end

    gg.toast(" ❤️ صلي ع النبي ❤️ ")

    if not cachedLandResults then
        gg.clearResults()
        gg.searchNumber("1886938386;1113878113;31093;1886938386;4::49", gg.TYPE_DWORD)
        gg.refineNumber("4", gg.TYPE_DWORD)

        cachedLandResults = gg.getResults(1000)

        if #cachedLandResults == 0 then
            cachedLandResults = nil
            gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"📖 أو راجع إرشادات ما قبل الاستخدام."
)
            return
        end
    end

    local results = cachedLandResults
    local t = {}
    local total = #results
    local targetResults = results

    if subChoice == 1 then
        local halfCount = math.floor(total / 2)
        targetResults = {}

        for i = 1, halfCount do
            targetResults[i] = results[i]
        end

    elseif subChoice == 2 then
        local halfCount = math.floor(total / 2)
        targetResults = {}
        local idx = 1

        for i = halfCount + 1, total do
            targetResults[idx] = results[i]
            idx = idx + 1
        end
    end

    for i, v in ipairs(targetResults) do
        t[i] = {
            address = v.address + 344,
            flags = v.flags,
            value = 6
        }
    end

    gg.setValues(t)

    gg.toast("تم فتح " ..
        (subChoice == 1 and "نصف الأراضي"
        or subChoice == 2 and "النصف الآخر"
        or "جميع الأراضي دفعة واحدة") ..
        " بنجاح ✅️")



    elseif choice == 3 then
        gg.toast(" ❤️ صلي ع النبي ❤️ ")
        gg.clearResults()
        gg.searchNumber("1836016402;1768846701;31092;3::49", gg.TYPE_DWORD)
        gg.refineNumber("1836016402", gg.TYPE_DWORD)
        local results = gg.getResults(1000)
        if #results == 0 then
            gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"📖 أو راجع إرشادات ما قبل الاستخدام."
)
            return
        end
        local t = {}
        for i, v in ipairs(results) do t[i] = {address = v.address + 244, flags = v.flags, value = 5} end
        gg.setValues(t)
        gg.alert(
"✅ تم فتح جميع المباني المجتمعية بنجاح.\n\n" ..
"📍 ادخل إلى حدث المغامرة ثم اخرج منه\n" ..
"لمشاهدة التغييرات.\n\n" ..
"🔄 أو قم بإعادة تشغيل اللعبة."
)

        

    elseif choice == 4 then
        gg.toast(" ❤️ صلي ع النبي ❤️ ")
        gg.clearResults()
        gg.searchNumber("1667327503X496", gg.TYPE_DWORD)
        gg.refineNumber("1", gg.TYPE_DWORD)
        local results = gg.getResults(1000)
        if #results == 0 then
            gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"📖 أو راجع إرشادات ما قبل الاستخدام."
)
            return
        end
        local t = {}
        for i, v in ipairs(results) do t[i] = {address = v.address, flags = v.flags, value = 4} end
        gg.setValues(t)
        gg.alert(
"✅ تم فتح جميع المصانع بنجاح.\n\n" ..
"📍 ادخل إلى حدث المغامرة ثم اخرج منه\n" ..
"لمشاهدة التغييرات.\n\n" ..
"🔄 أو قم بإعادة تشغيل اللعبة."
)

    elseif choice == 5 then
        gg.toast(" ❤️ صلي ع النبي ❤️ ")
        gg.clearResults()
        gg.searchNumber("1970235403X336", gg.TYPE_DWORD)
        gg.refineNumber("1", gg.TYPE_DWORD)
        local results = gg.getResults(1000)
        if #results == 0 then
            gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"📖 أو راجع إرشادات ما قبل الاستخدام."
)
            return
        end
        local t = {}
        for i, v in ipairs(results) do t[i] = {address = v.address, flags = v.flags, value = 5} end
        gg.setValues(t)
        gg.alert(
"✅ تم فتح جميع المنازل بنجاح.\n\n" ..
"📍 ادخل إلى حدث المغامرة ثم اخرج منه\n" ..
"لمشاهدة التغييرات.\n\n" ..
"🔄 أو قم بإعادة تشغيل اللعبة."
)
    end
    gg.clearResults()
    gg.setVisible(false)
end

function applyLevel()
    gg.toast("❤️ صلي ع النبي ❤️")
    gg.clearResults()
    gg.searchNumber("1701147414;1701345046;1::109", gg.TYPE_DWORD)
    gg.refineNumber("1", gg.TYPE_DWORD)
    
    local results = gg.getResults(100)
    if #results == 0 then
        gg.alert([[
❌ لم يتم العثور على النتائج.

يرجى التأكد من:
• ربط مدينتك بالاسكريبت.
• اختيار نطاقات الذاكرة المناسبة.


ثم أعد المحاولة.
]])
        return
    end

    local input = gg.prompt({"اكتب كمية ال xp التي تريدها لرفع المستوى"}, {[1] = 1}, {"number"})
    if not input then return end

    local t = {}
    for i, v in ipairs(results) do
        table.insert(t, {address = v.address - 4, flags = gg.TYPE_DWORD, value = 0})
        table.insert(t, {address = v.address + 12, flags = gg.TYPE_DWORD, value = 0})
        table.insert(t, {address = v.address + 16, flags = gg.TYPE_DWORD, value = input[1]})
    end
    gg.setValues(t)
    gg.clearResults()
    gg.alert([[
✅ تم تعديل ال xp بنجاح.

🌾 ازرع قمحًا ثم احصده لزيادة مستوى مدينتك.
]])
    gg.setVisible(false)
end

function upBox()
    gg.toast(" ❤️ صلي ع النبي ❤️ ")
    gg.clearResults()
    gg.searchNumber("1667327502;256::477", gg.TYPE_DWORD)
    gg.refineNumber("256", gg.TYPE_DWORD)
    
    local results = gg.getResults(1000)
    if #results == 0 then
        gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"اغلق اللعبة واعد تشغيلها."
)
        return
    end

    local input = gg.prompt(
        {"اكتب عدد صناديق المصانع التي تريدها ، اقصى عدد هوا 7 (1 - 7)"},
        {""},
        {"number"}
    )

    if not input then
        return
    end

    local count = tonumber(input[1])
    if not count or count < 1 or count > 7 then
        gg.alert("⚠️ عليك كتابة عدد صحيح (1-7)")
        return
    end

    local t = {}
    for i, v in ipairs(results) do
        t[i] = {address = v.address - 4, flags = v.flags, value = count}
    end
    
    gg.setValues(t)
    gg.clearResults()
    gg.toast("تم زيادة عدد صناديق المصانع بنجاح ✅️")
    gg.setVisible(false)
end


function applyMarket()
    gg.toast(" ❤️ صلي ع النبي ❤️ ")
    gg.clearResults()
    gg.searchNumber("1701868320;1953063700;1918987641;11::49", gg.TYPE_DWORD)
    gg.refineNumber("1953063700", gg.TYPE_DWORD)
    
    local results = gg.getResults(1000)
    if #results == 0 then
        gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"📌 تأكد من ضبط نطاقات الذاكرة.\n" ..
"🔗 أو تأكد من ربط اللعبة قبل تشغيل السكريبت.\n" ..
"اغلق اللعبة واعد تشغيلها."
)
        return
    end

    local input = gg.prompt(
        {"اكتب عدد صناديق السوق الذي تريد زيادتها (يجب أن يكون أكبر من 0):"},
        {""},
        {"number"}
    )

    if not input then
        return
    end

    local val = tonumber(input[1])
    if not val or val <= 0 then
        gg.alert("⚠️ عليك كتابة رقم صحيح أكبر من 0")
        return
    end

    local t = {}
    for i, v in ipairs(results) do
        t[i] = {address = v.address + 440, flags = v.flags, value = val}
    end
    
    gg.setValues(t)
    gg.clearResults()
    gg.toast("تم زيادة عدد صناديق السوق بنجاح ✅️")
    gg.setVisible(false)
end


function applyRequest(item, currentChoice)
    gg.toast("🇦 🇭 🇲 🇪 🇩")

    if cachedTrainResults == nil then
        gg.clearResults()
        gg.searchNumber("1801519104;49::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
        gg.refineNumber("49", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

        cachedTrainResults = gg.getResults(100)

        if #cachedTrainResults == 0 then
            cachedTrainResults = nil
            gg.alert("لا يوجد نتايج ❌️\nابحث وانت فاتح القطار ، لو مطلعش نتايج ، ادخل الرحلة الاستكشافيه واخرج تاني ، بعدين افتح القطار وابحث✅️")
            return
        end
    end

    local res = cachedTrainResults

    local productMsg = "أدخل عدد منتج الطلب:"

    if item.name == "تاج" then
        productMsg = "👑 أدخل عدد منتج الطلب\n(أقصى عدد هو 40) (1-40):"
    end

    -- إدخال عدد المنتج
    local input = gg.prompt(
        {productMsg},
        {"1"},
        {"number"}
    )

    if not input then
        return
    end

    local userVal = tonumber(input[1])

    if item.name == "تاج" then
        if userVal < 1 or userVal > 40 then
            gg.alert("❌ عند اختيار التاج يجب أن يكون العدد بين 1 و40 فقط.")
            return
        end
    end

    -- تجهيز خيارات القطارات حسب عدد النتائج
    local trainChoices = {}

    if #res >= 1 then
        table.insert(trainChoices, "🚂 القطار الأول")
    end

    if #res >= 2 then
        table.insert(trainChoices, "🚂 القطار الثاني")
    end

    if #res >= 3 then
        table.insert(trainChoices, "🚂 القطار الثالث")
    end

    table.insert(trainChoices, "🚂 جميع القطارات")

    -- اختيار القطارات
    local choice = gg.multiChoice(
        trainChoices,
        nil,
        "اختر القطار أو القطارات التي تريد تعديل الطلب فيها"
    )

    if not choice then
        return
    end

    local indexes = {}

    -- جميع القطارات
    local allIndex = #trainChoices

    if choice[allIndex] then
        for i = 1, math.min(#res, 3) do
            table.insert(indexes, i)
        end
    else
        for i = 1, math.min(#res, 3) do
            if choice[i] then
                table.insert(indexes, i)
            end
        end
    end

    if #indexes == 0 then
        gg.alert("❌ اختر قطارًا واحدًا على الأقل.")
        return
    end

    local t = {}

    local function addBaseValues(base, uVal)
        for i = 0, 11 do
            table.insert(t, {
                address = base + 232 + (i * 4),
                value = 0,
                flags = gg.TYPE_DWORD,
                freeze = true
            })
        end

        table.insert(t, {address = base, value = item.Code[1], flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 4, value = item.Code[2], flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 8, value = item.Code[3], flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 12, value = item.Code[4], flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 16, value = item.Code[5], flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 20, value = item.Code[6], flags = gg.TYPE_DWORD, freeze = true})

        table.insert(t, {address = base + 24, value = 0, flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 28, value = uVal, flags = gg.TYPE_DWORD, freeze = true})
        table.insert(t, {address = base + 72, value = 1, flags = gg.TYPE_DWORD, freeze = true})
    end

    local function addZeroBlock(base)
        local addr = base + 304

        for i = 0, 40 do
            table.insert(t, {
                address = addr + (i * 4),
                value = 0,
                flags = gg.TYPE_DWORD,
                freeze = true
            })
        end
    end

    for _, i in ipairs(indexes) do
        local v = res[i]

        local base1 = v.address - 0x15C
        local base2 = base1 - 0x130
        local base3 = base2 - 0x130
        local base4 = base3 - 0x130
        local base5 = base4 - 0x130

        addBaseValues(base1, userVal)
        addBaseValues(base2, userVal)
        addBaseValues(base3, userVal)
        addBaseValues(base4, userVal)
        addBaseValues(base5, userVal)
        addZeroBlock(base1)
    end

    gg.setValues(t)

    local freezeList = {}

    for _, v in ipairs(t) do
        if v.freeze then
            table.insert(freezeList, v)
        end
    end

    gg.addListItems(freezeList)
    gg.clearResults()
    saveState("ORDER_MENU", tostring(currentChoice))
    gg.toast("✅ تم تعديل طلب " .. item.name .. " بنجاح")
    gg.setVisible(false)
end

function applyFreezeClover()
    gg.toast("🇦 🇭 🇲 🇪 🇩")

    -- حذف أي تجميد قديم
    if #cloverFreezeItems > 0 then
        gg.removeListItems(cloverFreezeItems)
        cloverFreezeItems = {}
    end

    -- البحث لأول مرة فقط
    if cachedTrainResults == nil then
        gg.clearResults()
        gg.searchNumber("1801519104;49::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
        gg.refineNumber("49", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

        cachedTrainResults = gg.getResults(100)

        if #cachedTrainResults == 0 then
            cachedTrainResults = nil
            gg.alert("لا يوجد نتايج ❌️\nابحث وانت فاتح القطار، ولو مطلعش نتايج ادخل الرحلة الاستكشافية واخرج منها ثم افتح القطار وابحث مرة أخرى ✅️")
            return
        end
    end

    local res = cachedTrainResults

    local choice = gg.multiChoice(
        {
            "🚂 القطار الأول",
            "🚂 القطار الثاني",
            "🚂 القطار الثالث",
            "🚂 جميع القطارات"
        },
        nil,
        "اختر القطار أو القطارات التي تريد تجميد إرسال البرسيم فيها"
    )

    if not choice then
        return
    end

    local indexes = {}

    if choice[4] then
        indexes = {1, 2, 3}
    else
        if choice[1] then table.insert(indexes, 1) end
        if choice[2] then table.insert(indexes, 2) end
        if choice[3] then table.insert(indexes, 3) end
    end

    if #indexes == 0 then
        gg.alert("❌ اختر قطارًا واحدًا على الأقل.")
        return
    end

    if #res < 3 then
        gg.alert("❌ لا توجد نتائج كافية.")
        return
    end

    local t = {}
    cloverFreezeItems = {}

    for _, i in ipairs(indexes) do
        local v = res[i]

        local base1 = v.address - 0x15C
        local base2 = base1 - 0x130
        local base3 = base2 - 0x130
        local base4 = base3 - 0x130
        local base5 = base4 - 0x130

        local items = {
            {address = base1 + 192, value = 0, flags = gg.TYPE_DWORD, freeze = true},
            {address = base2 + 192, value = 0, flags = gg.TYPE_DWORD, freeze = true},
            {address = base3 + 192, value = 0, flags = gg.TYPE_DWORD, freeze = true},
            {address = base4 + 192, value = 0, flags = gg.TYPE_DWORD, freeze = true},
            {address = base5 + 192, value = 0, flags = gg.TYPE_DWORD, freeze = true}
        }

        for _, item in ipairs(items) do
            table.insert(t, item)
            table.insert(cloverFreezeItems, item)
        end
    end

    gg.setValues(t)
    gg.addListItems(t)

    cloverEnabled = true

    gg.clearResults()
    gg.toast("✅ تم تجميد إرسال البرسيم")
    gg.setVisible(false)
end


function applyClover()
    gg.toast("🇦 🇭 🇲 🇪 🇩")

    -- البحث لأول مرة فقط
    if cachedTrainResults == nil then
        gg.clearResults()
        gg.searchNumber("1801519104;49::13", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)
        gg.refineNumber("49", gg.TYPE_DWORD, false, gg.SIGN_EQUAL, 0, -1)

        cachedTrainResults = gg.getResults(100)

        if #cachedTrainResults == 0 then
            cachedTrainResults = nil
            gg.alert("لا يوجد نتايج ❌️\nابحث وانت فاتح القطار ، لو مطلعش نتايج ، ادخل الرحلة الاستكشافيه واخرج تاني ، بعدين افتح القطار وابحث✅️")
            return
        end
    end

    local res = cachedTrainResults

    -- إدخال كود اللاعب
    local input = gg.prompt(
        {"📨 قم بوضع كود اللاعب الذي تريد الإرسال إليه\n(مثال: 123,456,789)"},
        {""},
        {"text"}
    )

    if not input then
        return
    end

    local text = input[1]:gsub(";", ",")
    local code1, code2, code3 = text:match("^(%-?%d+),(%-?%d+),(%-?%d+)$")

    if not code1 then
        gg.alert("❌ صيغة الكود غير صحيحة.")
        return
    end

    code1, code2, code3 = tonumber(code1), tonumber(code2), tonumber(code3)

    -- اختيار القطارات
    local choice = gg.multiChoice(
        {
            "🚂 القطار الأول",
            "🚂 القطار الثاني",
            "🚂 القطار الثالث",
            "🚂 جميع القطارات"
        },
        nil,
        "اختر القطار أو القطارات التي تريد إرسال البرسيم إليها"
    )

    if not choice then
        return
    end

    local indexes = {}

    if choice[4] then
        indexes = {1, 2, 3}
    else
        if choice[1] then table.insert(indexes, 1) end
        if choice[2] then table.insert(indexes, 2) end
        if choice[3] then table.insert(indexes, 3) end
    end

    if #indexes == 0 then
        gg.alert("❌ اختر قطارًا واحدًا على الأقل.")
        return
    end

    if #res < 3 then
        gg.alert("❌ لا توجد نتائج كافية.")
        return
    end

    local t = {}

    -- لا نحذف cloverFreezeItems القديمة
    if cloverFreezeItems == nil then
        cloverFreezeItems = {}
    end

    local function addBaseValues(base)
        table.insert(t, {address = base, value = 1701345034, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 4, value = 29793, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 8, value = 0, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 12, value = 0, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 16, value = 0, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 20, value = 0, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 40, value = 1, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 72, value = 1, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 80, value = code1, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 84, value = code2, flags = gg.TYPE_DWORD})
        table.insert(t, {address = base + 88, value = code3, flags = gg.TYPE_DWORD})

        local freezeItem = {
            address = base + 192,
            value = 0,
            flags = gg.TYPE_DWORD,
            freeze = true
        }

        table.insert(t, freezeItem)
        table.insert(cloverFreezeItems, freezeItem)
    end

    for _, i in ipairs(indexes) do
        local v = res[i]
        local base = v.address - 0x15C

        addBaseValues(base)
        addBaseValues(base - 0x130)
        addBaseValues(base - (0x130 * 2))
        addBaseValues(base - (0x130 * 3))
        addBaseValues(base - (0x130 * 4))
    end

    gg.setValues(t)
    gg.addListItems(cloverFreezeItems)

    cloverEnabled = true

    gg.clearResults()
    gg.toast("✅ تم تعبئة وإرسال البرسيم بنجاح")
    gg.setVisible(false)
end

function cancelFreezeClover()
    if not cloverEnabled then
        gg.alert("⚠️ لا يوجد تجميد لإرسال البرسيم.")
        return
    end

    gg.toast("⏳ جاري إلغاء تجميد إرسال البرسيم...")

    if #cloverFreezeItems > 0 then
        gg.removeListItems(cloverFreezeItems)
    end

    cloverEnabled = false

    gg.clearResults()
    gg.alert("✅ تم إلغاء تجميد إرسال البرسيم بنجاح.")
    gg.setVisible(false)
end

function findCode()
    local input = gg.prompt(
        {
            "ما مستوى المدينة أو المدى\n(مثال: 120 أو 100~200)"
        },
        {""},
        {"text"}
    )

    if not input then
        return
    end

    local levelInput = input[1]
    local rankInput = "1~4"

    -- التحقق من المستوى
    if not levelInput:match("^%d+$") and not levelInput:match("^%d+~%d+$") then
        gg.alert("⚠️ أدخل مستوى صحيح أو مدى مثل 100~200.")
        return
    end

    gg.toast("❤️ صلي على النبي ❤️")
    gg.clearResults()

    local searchQuery = rankInput .. ";" .. levelInput .. ";500~550;0;500~540::29"
    gg.searchNumber(searchQuery, gg.TYPE_DWORD)

    -- الصقل على الرتبة فقط
    gg.refineNumber(rankInput, gg.TYPE_DWORD)

    local results = gg.getResults(1000)

    if #results == 0 then
        gg.alert(
            "⚠️ تأكد من ضبط نطاقات الذاكرة.\n\n" ..
            "🔗 وتأكد بأن اللاعب الذي تريد استخراج كوده موجود في التعاون."
        )
        return
    end

    local function dwordToText(d1, d2, d3)
        local bytes = {}

        for _, v in ipairs({d1, d2, d3}) do
            for i = 0, 3 do
                local b = (v >> (8 * i)) & 0xFF
                if b == 0 then
                    return string.char(table.unpack(bytes))
                end
                if b ~= 0x14 then
                    table.insert(bytes, b)
                end
            end
        end

        return string.char(table.unpack(bytes))
    end

    local selectedResult

    if #results == 1 then
        selectedResult = results[1]
    else
        local menu = {}

        for i, v in ipairs(results) do
            local utf = gg.getValues({
                {address = v.address - 64, flags = gg.TYPE_DWORD},
                {address = v.address - 60, flags = gg.TYPE_DWORD},
                {address = v.address - 56, flags = gg.TYPE_DWORD}
            })

            local name = dwordToText(
                utf[1].value,
                utf[2].value,
                utf[3].value
            )

            menu[i] = "👤 " .. name
        end

        local choice = gg.choice(
            menu,
            nil,
            "تم العثور على " .. #results .. " نتائج\nاختر اللاعب المطلوب"
        )

        if not choice then
            gg.clearResults()
            return
        end

        selectedResult = results[choice]
    end

    local utf = gg.getValues({
        {address = selectedResult.address - 64, flags = gg.TYPE_DWORD},
        {address = selectedResult.address - 60, flags = gg.TYPE_DWORD},
        {address = selectedResult.address - 56, flags = gg.TYPE_DWORD}
    })

    local playerName = dwordToText(
        utf[1].value,
        utf[2].value,
        utf[3].value
    )

    local targetAddress = selectedResult.address - 136

    local values = gg.getValues({
        {address = targetAddress, flags = gg.TYPE_DWORD},
        {address = targetAddress + 4, flags = gg.TYPE_DWORD},
        {address = targetAddress + 8, flags = gg.TYPE_DWORD}
    })

    local copiedCode = values[1].value .. ";" .. values[2].value .. ";" .. values[3].value

    gg.copyText(copiedCode)

    gg.alert(
        "✅ تم نسخ كود اللاعب في الحافظة.\n\n" ..
        "👤 اسم اللاعب:\n" .. playerName
    )

    gg.clearResults()
    gg.setVisible(false)
end

function applyAddFriend()
    local password = gg.prompt({"🔐 اكتب كلمة السر:"}, {""}, {"text"})
    
    if not password or password[1] ~= "Admin" then
        gg.alert("❌ كلمة السر غير صحيحة!")
        return
    end

    local promptMsg = gg.choice({"حسنا", "إلغاء"}, nil, "قبل بدء اضافه صديق عليك ارسال صداقه اولا لهذا الصديق حتى يتم اضافته ، هل تريدي الإكمال")
    if promptMsg ~= 1 then
        friendsMenu()
        return
    end

    -- البحث مرة واحدة فقط
    if not cachedAddFriendResults then
        gg.clearResults()
        gg.searchNumber("300000000;300;300000000;3000000::41", gg.TYPE_DWORD)
        gg.refineNumber("3000000", gg.TYPE_DWORD)

        local results = gg.getResults(100)

        if #results == 0 then
            gg.alert("يضبط نطاقات الذاكرة")
            return
        end

        cachedAddFriendResults = results
    end

    -- استخدام النتائج المحفوظة بدون بحث جديد
    local results = cachedAddFriendResults

    local t = {}

    for i, v in ipairs(results) do
        local sourceValues = {}

        for j = 0, 5 do
            local res = gg.getValues({
                {
                    address = v.address + 360 + (j * 4),
                    flags = gg.TYPE_DWORD
                }
            })

            if res[1] then
                table.insert(sourceValues, res[1].value)
            else
                table.insert(sourceValues, 0)
            end
        end

        for j = 0, 5 do
            table.insert(t, {
                address = v.address + 112 + (j * 4),
                flags = gg.TYPE_DWORD,
                value = sourceValues[j + 1],
                freeze = false
            })
        end
    end

    gg.setValues(t)
    gg.addListItems(t)
    gg.clearResults()
    gg.toast("تم اضافه الاصدقاء بنجاح ✅️")
    gg.setVisible(false)
end

function applyRegatta()
    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()

    gg.searchNumber("65537~65556;1952533772;-1;100~200::261", gg.TYPE_DWORD)
    gg.refineNumber("65537~65556", gg.TYPE_DWORD)

    local results = gg.getResults(100)
    if #results == 0 then
        gg.alert([[
❌ لم يتم العثور على النتائج.

يرجى التأكد من:
• فتح اللعبة وربطها مع الاسكريبت.
• اختيار نطاقات الذاكرة الصحيحة.


ثم حاول مرة أخرى.
]])
        return
    end

    local t = {}

    for _, v in ipairs(results) do
        table.insert(t, {
            address = v.address + 192,
            flags = gg.TYPE_DWORD,
            value = 0
        })
        table.insert(t, {
            address = v.address + 196,
            flags = gg.TYPE_DWORD,
            value = 0
        })
    end

    gg.setValues(t)
    gg.clearResults()
    gg.alert([[
✅ تم تصفير مهام السباق بنجاح.

📌 اذهب الآن واختر أي مهمة،
وسيتم إنجازها فورًا.

⚠️ تنبيه:
لا تقم بإنجاز عدد كبير من المهام بشكل مبالغ فيه حتى لا تتعرض للحظر.
]])

    gg.setVisible(false)
end


function applyUpgrade()
    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()
    local input = gg.prompt(
    {"🏙 اكتب مستوى مدينتك الحالي:"},
    {""},
    {"number"}
)

if not input then
    return
end

local level = tostring(input[1])

    gg.searchNumber("33;27;1887007752;101::37", gg.TYPE_DWORD)
    gg.refineNumber("1887007752", gg.TYPE_DWORD)
    gg.clearResults()
    gg.searchNumber("1;" .. level .. ";500~550;500~540::29", gg.TYPE_DWORD)
    gg.refineNumber("1", gg.TYPE_DWORD)
    
    local results = gg.getResults(10000)
    if #results == 0 then
        gg.alert([[
❌ لم يتم العثور على النتائج.

يرجى التأكد من:
• فتح اللعبة وربطها مع الاسكريبت.
• اختيار نطاقات الذاكرة الصحيحة.
• اغلق اللعبة واعد تشغيلها وجرب مره تانيه.


ثم حاول مرة أخرى.
]])
        return
    end

    local t = {}
    for i, v in ipairs(results) do
        table.insert(t, {address = v.address, flags = gg.TYPE_DWORD, value = 3, freeze = false})
    end
    gg.setValues(t)
    gg.clearResults()
    gg.toast("تم ترقيتك الى قائد مساعد بنجاح ✅️")
    gg.setVisible(false)
end


function clanAchievements()
    gg.toast("🇦 🇭 🇲 🇪 🇩")

    if not clanAchievementsCached or clanAchievementsResults == nil then
        gg.clearResults()
        gg.searchNumber("2790260739X4", gg.TYPE_DWORD)

        local count = gg.getResultCount()

        if count == 0 then
            gg.alert([[
⚠️ لم يتم العثور على نتائج

━━━━━━━━━━━━━━━━━━

🔹 تأكد من ضبط نطاقات الذاكرة بشكل صحيح.
🔹 تأكد من ربط اللعبة بالسكريبت.
🔹 أغلق اللعبة وأعد تشغيلها ثم حاول مرة أخرى.

━━━━━━━━━━━━━━━━━━
]])
            gg.setVisible(true)
            return
        end

        clanAchievementsResults = gg.getResults(count)
        clanAchievementsCached = true
        gg.clearResults()
    end

    local allResults = clanAchievementsResults

    local menuOptions = {
        "🏆 الصديق وقت الضيق",
        "🏆 الجائزة الكبرى",
        "🏆 توصيل سريع",
        "🏆 حمولة ثقيلة",
        "🏆 سادة البحر",
        "🏆 هدف مشترك",
        "🏆 منقبون دؤوبون",
        "🏆 إنتاج مستمر",
        "🏆 زعماء اللعبة",
        "🏆 فائزون بالفطرة",
        "🏆 دوري الدرجة الأولى",
        "🏆 جميع الإنجازات"
    }

    local choices = gg.multiChoice(
        menuOptions,
        nil,
        "🏆 إنجازات التعاون\n\nحدد الإنجازات التي تريد تعديلها:"
    )
    
    if not choices then
        return
    end

    local editList = {}

    local function checkAndAdd(targetVal)
        for _, r in ipairs(allResults) do
            local valObj = gg.getValues({
                {address = r.address + 20, flags = gg.TYPE_DWORD}
            })

            if valObj and valObj[1] and valObj[1].value == targetVal then
                table.insert(editList, {
                    address = r.address + 20,
                    value = 1,
                    flags = gg.TYPE_DWORD
                })
            end
        end
    end

    local selectedAny = false

    if choices[12] then
        checkAndAdd(10000)
        checkAndAdd(5000)
        checkAndAdd(500)
        checkAndAdd(400)
        checkAndAdd(1000)
        checkAndAdd(300)
        checkAndAdd(20)
        checkAndAdd(1)
        selectedAny = true
    else
        if choices[1] then checkAndAdd(10000); selectedAny = true end
        if choices[2] then checkAndAdd(5000); selectedAny = true end
        if choices[3] then checkAndAdd(500); selectedAny = true end
        if choices[4] then checkAndAdd(500); selectedAny = true end
        if choices[5] then checkAndAdd(400); selectedAny = true end
        if choices[6] then checkAndAdd(1000); selectedAny = true end
        if choices[7] then checkAndAdd(400); selectedAny = true end
        if choices[8] then checkAndAdd(300); selectedAny = true end
        if choices[9] then checkAndAdd(500); selectedAny = true end
        if choices[10] then checkAndAdd(20); selectedAny = true end
        if choices[11] then checkAndAdd(1); selectedAny = true end
    end

    if not selectedAny then
        gg.alert("⚠️ لم يتم اختيار أي إنجاز.\n\nيرجى اختيار إنجاز واحد على الأقل.")
        return
    end

    if #editList > 0 then
        gg.setValues(editList)
        gg.clearResults()
        gg.alert([[🏆 تم تعديل الإنجازات بنجاح! ✅️

📌 قم بتنفيذ الخطوات التالية بالترتيب:

1️⃣ حقق مهمة واحدة على الأقل من الإنجاز المعدّل.
2️⃣ غيّر لغة اللعبة للغة أخرى.
3️⃣ أغلق اللعبة بالكامل وأعد تشغيلها.
4️⃣ افتح اللعبة وتحقق من الإنجازات. 🎉]])
    else
        gg.alert([[
❌ لم يتم العثور على قيم مطابقة

لم يتم العثور على البيانات الخاصة بالإنجازات التي اخترتها في الذاكرة.

🔹 تأكد من أنك داخل واجهة التعاون.
🔹 تأكد من اختيار نطاق الذاكرة الصحيح.
🔹 ثم حاول مرة أخرى.
]])
    end
end


function resetChatRequest()
    gg.toast(" ❤️ صلي ع النبي ❤️ ")
    gg.clearResults()
    gg.setRanges(gg.REGION_C_ALLOC | gg.REGION_OTHER | gg.REGION_CODE_APP)
    gg.searchNumber("10800;86400::5", gg.TYPE_DWORD)
    gg.refineNumber("10800", gg.TYPE_DWORD)
    
    local results = gg.getResults(1000)
    if #results == 0 then
        gg.alert(
"⚠️ تعذر العثور على البيانات المطلوبة.\n\n" ..
"🔄 أعد تشغيل اللعبة وجرب مرة أخرى.\n" ..
"📌 تأكد من أن يكون الطلب متاحاً قبل بدء الطريقة."
)
        return
    end

    local t = {}
    for i, v in ipairs(results) do
        t[i] = {address = v.address, flags = v.flags, value = 0}
    end
    
    gg.setValues(t)
    gg.clearResults()
    gg.toast("تم تصفير وقت طلب الشات بنجاح ✅️")
    gg.setVisible(false)
end

function applyChatWheat()
    local userInput = gg.prompt(
        {"🌾 اكتب كمية القمح التي تريدها:"},
        nil,
        {"number"}
    )

    if not userInput or userInput[1] == "" then
        return
    end

    local targetVal = tonumber(userInput[1])

    if targetVal == nil or targetVal <= 0 then
        gg.alert("يجب أن تكون القيمة أكبر من 0 .. حاول مجدداً ❌")
        return
    end

    gg.toast("🇦 🇭 🇲 🇪 🇩")
    gg.clearResults()

    gg.searchNumber("1701147414;1701345046;1::109", 4)
    gg.refineNumber("1701345046", 4)

    local resultsCount = gg.getResultCount()

    if resultsCount > 0 then
        local res = gg.getResults(1)
        local baseAddress = res[1].address

        local editList = {
            {address = baseAddress + 208, value = 0, flags = 4},
            {address = baseAddress + 212, value = targetVal, flags = 4}
        }

        gg.setValues(editList)
        gg.clearResults()
        gg.toast("تم التعديل بنجاح ✅️")
    else
        gg.alert("❌ لم يتم العثور على نتائج.\n\nاظبط النطاقات ، واغلق اللعبة واعد تشغيلها.")
        gg.setVisible(true)
    end
end

-----------------------------------------------------------
-- [3] القوائم
-----------------------------------------------------------

function chatMenu()
    saveState("CHAT_MENU", "0")

    local choice = gg.choice({
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "❄️ تجميد طلب الشات في التعاون",
        "🌾 طلب قمح بكمية في شات التعاون",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }, nil, "💬 شات التعاون")

    if not choice then
        return
    end

    if choice == 1 or choice == 4 then
        friendsMenu()

    elseif choice == 2 then
        resetChatRequest()

    elseif choice == 3 then
        applyChatWheat()
    end
end

function orderMenu(defaultChoice)
    local currentChoice = tonumber(defaultChoice) or 1
    saveState("ORDER_MENU", tostring(currentChoice))

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    for _, item in ipairs(products) do
        table.insert(choices, "📦 " .. item.name)
    end

    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local choice = gg.choice(choices, currentChoice, "🚂 طلب القطار")

    if choice == nil then
        gg.setVisible(false)

    elseif choice == 1 or choice == #choices then
        saveState("ORDER_MENU", "0")
        friendsMenu()

    else
        saveState("ORDER_MENU", tostring(choice))
        local item = products[choice - 1]
        applyRequest(item, choice)
        gg.setVisible(false)
    end
end


function trainAndCloverMenu()
    saveState("TRAIN_CLOVER_MENU", "0")

    local choice = gg.choice({
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🚂 طلب القطار",
        "🌿 تجميد إرسال البرسيم فقط",
        "📦 تعبئة صناديق القطار بالبرسيم + تجميد ارساله 🌿",
        "🚫 إلغاء تجميد إرسال البرسيم",
        "🪄 استخراج كود لاعب من التعاون",
--       "🪄 اضافة صديق",
        "📖 إرشادات قبل الاستخدام",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }, nil, "🚂 طلب القطار والبرسيم")

    if not choice then
        return
    end

    if choice == 1 or choice == 8 then
        saveState("FRIENDS_MENU", "0")
        friendsMenu()

    elseif choice == 2 then
        orderMenu()

    elseif choice == 3 then
        applyFreezeClover()
    
    elseif choice == 4 then
        applyClover() 
        
    elseif choice == 5 then
        cancelFreezeClover() 
   
   elseif choice == 6 then
        findCode()
        
--    elseif choice == 7 then
--        applyAddFriend()
    
    elseif choice == 7 then
        gg.alert([[
🚂 طلب القطار والبرسيم

• افتح واجهة القطار قبل استخدام طلب القطار.
• استخدم تجميد البرسيم عند الحاجة فقط.
• لا تترك التجميد مفعلاً بدون داعٍ.
• بعد الانتهاء يُفضل إلغاء التجميد.

]])
        trainAndCloverMenu()
    end
end

function friendsMenu()
    saveState("FRIENDS_MENU", "0")

    local choice = gg.choice({
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🚂 طلب القطار والبرسيم 🍀",
        "💬 طلب منتج ف شات التعاون",
        "🏁 إنجاز مهام السباق",
        "⬆️ ترقية نفسك للمساعدة ف مهام السباق",
        "🏆 فتح إنجازات التعاون",
        "📖 إرشادات قبل الاستخدام",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }, nil, "🤝 مساعدة الأصدقاء")

    if not choice then
        return
    end

    if choice == 1 or choice == 8 then
        saveState("FRIENDS_MENU", "0")
        mainMenu()

    elseif choice == 2 then
        trainAndCloverMenu()
        
    elseif choice == 3 then
        chatMenu()

    elseif choice == 4 then
        applyRegatta()
    
    elseif choice == 5 then
        applyUpgrade()
        
   elseif choice == 6 then
        clanAchievements()

    elseif choice == 7 then
        gg.alert([[
🤝 مساعدة الأصدقاء

اختر الخدمة المناسبة واتبع الإرشادات التالية قبل الاستخدام.

━━━━━━━━━━━━━━━━━━━━━━

🚂 طلب القطار
• افتح واجهة القطار أولاً.
• إذا لم تظهر أي نتائج:
  - ادخل الرحلة الاستكشافية.
  - اخرج منها مرة أخرى.
  - افتح القطار ثم أعد المحاولة.

⚠️ تحذير
• لا تطلب منتج "التاج" بأعداد كبيرة داخل القطار، فقد يعرض حساب الذي يساعدك للحظر الفوري.
• استخدم الميزة باعتدال وعلى مسؤوليتك.

🤲 لا تستخدمها في الشر... ستتحمل مسؤولية استخدامك أمام الله.

━━━━━━━━━━━━━━━━━━━━━━

💬 طلب منتج في شات التعاون
• استخدم هذا الخيار لإرسال طلبات المنتجات داخل شات التعاون.

━━━━━━━━━━━━━━━━━━━━━━

🏁 إنجاز مهام السباق
• بعد كل 10 - 20 مهمة، خذ أي مهمة ثم احذفها مباشرة ليتم احتساب نقاطك بشكل صحيح.
• يفضل عدم إنجاز أكثر من 100 مهمة يوميًا لتقليل احتمالية التعرض للحظر.

━━━━━━━━━━━━━━━━━━━━━━

⚠️ تنبيه
استخدم كل خيار بالطريقة الصحيحة، وتجنب الاستخدام المبالغ فيه للحفاظ على أمان حسابك.
]])
        friendsMenu()
    end
end

function developMenu()
    saveState("DEVELOP_MENU", "0")

    local choice = gg.choice({
        "⬅️ عــــــــــــــــــــــــــــــــــــــــــــودة",
        "🏗 توسيع المدينة",
        "🏛 إنهاء وقت وبناء المباني المجتمعية",
        "🏭 إنهاء وقت بناء المصانع",
        "🏠 إنهاء وقت بناء المنازل",
        "📖 إرشادات قبل الاستخدام",
        "⬆️ زيادة المستوى من زراعة القمح🌾",
        "⬆️ زيادة عدد صناديق المصانع 🏭",
        "⬆️ زيادة عدد صناديق السوق 📦",        
        "⬅️ عــــــــــــــــــــــــــــــــــــــــــــودة"
    }, nil, "🏙 تطويــــــــــر المدينــــــــــة")

    if not choice then
        return
    end

    if choice == 1 then
        mainMenu()
    elseif choice == 2 then
        applyDevelop(choice)
    elseif choice == 3 then
        applyDevelop(choice)
    elseif choice == 4 then
        applyDevelop(choice)
    elseif choice == 5 then
        applyDevelop(choice)
    elseif choice == 6 then
    gg.alert(
"📖 إرشادات قبل الاستخدام\n\n" ..
"⚠️ قبل استخدام أي خيار من خيارات تطوير المدينة:\n\n" ..
"🏛 قم بتنزيل المباني المجتمعية ع الأرض أولا.\n" ..
"🏭 قم بتنزيل المصانع ع الأرض أولا.\n" ..
"🏠 قم بتنزيل المنازل ع الأرض أولا.\n\n" ..
"✅ بعد تنزيلها يمكنك استخدام الخيارات بأمان ."
)
    developMenu()
    elseif choice == 7 then
        applyLevel()
    elseif choice == 8 then
        upBox()
   elseif choice == 9 then
        applyMarket()
    elseif choice == 10 then
        mainMenu()
    end
end


function resSubMenu(sectionIndex, defaultChoice)
    local currentChoice = tonumber(defaultChoice) or 1
    saveState("RES_SUB_MENU", tostring(sectionIndex) .. "|" .. tostring(currentChoice))

    local section = resources[sectionIndex]

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    for _, item in ipairs(section.items) do
        table.insert(choices, " " .. item.name)
    end

    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local choice = gg.choice(choices, currentChoice, "📦 " .. section.section)

    if choice == nil then
        gg.setVisible(false)

    elseif choice == 1 or choice == #choices then
        saveState("RES_SUB_MENU", "0")
        resMainMenu()

    else
        saveState("RES_SUB_MENU", tostring(sectionIndex) .. "|" .. tostring(choice))
        local item = section.items[choice - 1]
        applyResource(item, sectionIndex, choice)
        gg.setVisible(false)
    end
end

function resMainMenu()
    saveState("RES_MAIN_MENU", "0")

    local menu = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    for i, v in ipairs(resources) do
        table.insert(menu, " " .. v.section)
    end

    table.insert(menu, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local choice = gg.choice(menu, nil, "📦 مــــوارد الـمــــديــــنــــة 📦")

    if choice == nil then
        return
    elseif choice == 1 or choice == #menu then
        mainMenu()
    else
        local sectionIndex = choice - 1

        -- رسالة قسم الملصقات
        if resources[sectionIndex].section == "🎭 الملصقات 🎭" then
            gg.alert([[
🎭 الملصقات

📌 بعد استلام الهدية ثم استلام الملصق:

• أغلق اللعبة بالكامل.
• ثم افتحها مرة أخرى.

✅ بعد إعادة تشغيل اللعبة ستظهر الملصقات الجديدة.
]])
        end

        resSubMenu(sectionIndex, 1)
    end
end

function breakMenu()
    saveState("BREAK_MENU", "0")

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }
    
    for _, v in ipairs(bre_event) do
        table.insert(choices, v.name)
    end
    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local selected = gg.multiChoice(choices, nil, "🏷 قائمة مهام الحدث ")

    if not selected then
        saveState("BREAK_MENU", "0")
        return
    end

    local itemsToProcess = {}
    for i, v in pairs(selected) do
        if v then
            if i == 1 or i == #choices then
                eventsMenu()
                return
            end
            table.insert(itemsToProcess, bre_event[i - 1])
        end
    end

    if #itemsToProcess > 0 then
        applyBreak(itemsToProcess)
    end
end


function ov_giftMenu()
    saveState("OV_GIFT_MENU", "0")

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    for _, v in ipairs(ov_gifts) do
        table.insert(choices, v.name)
    end

    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local selected = gg.multiChoice(choices, nil, "🏷 قائمة مهام الحدث ")

    if not selected then
        saveState("OV_GIFT_MENU", "0")
        return
    end

    local itemsToProcess = {}
    for i, v in pairs(selected) do
        if v then
            if i == 1 or i == #choices then
                eventsMenu()
                return
            end
            table.insert(itemsToProcess, ov_gifts[i - 1])
        end
    end

    if #itemsToProcess > 0 then
        applyOv_gifts(itemsToProcess)
    end
end

function match3Menu(defaultChoice)
    local currentChoice = tonumber(defaultChoice) or 1
    saveState("MATCH3_MENU", tostring(currentChoice))

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "➕ زيادة عدد حركات اللعب ف المطابقة",
        "➕ زيادة مستوى المطابقة",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    local choice = gg.choice(choices, currentChoice, "🧩 ألعاب Match-3")

    if choice == nil then
        gg.setVisible(false)

    elseif choice == 1 or choice == #choices then
        saveState("MATCH3_MENU", "0")
        mainMenu()

    elseif choice == 2 then
       saveState("MATCH3_MENU", tostring(choice))
       applyShow(choice)
       gg.setVisible(false)
       
   elseif choice == 3 then
       saveState("MATCH3_MENU", tostring(choice))
       upMatch3()
       gg.setVisible(false)
    end
end

function showEventsMenu(defaultChoice)
    local currentChoice = tonumber(defaultChoice) or 1

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🎉 إظهار جميع الأحداث",
        "🖼️ إظهار حدث الإطار",
        "🏷️ إظهار حدث الاسم",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    -- حفظ آخر اختيار في القائمة
    saveState("SHOW_EVENTS_MENU", tostring(currentChoice))

    local choice = gg.choice(
        choices,
        currentChoice,
        "🎉 إظهار الأحداث والفعاليات 🎉"
    )

    if choice == nil then
        gg.setVisible(false)

    elseif choice == 1 or choice == #choices then
        saveState("SHOW_EVENTS_MENU", "0")
        eventsMenu()

    elseif choice == 2 then
        saveState("SHOW_EVENTS_MENU", tostring(choice))
        applyShow(4)
        gg.setVisible(false)

    elseif choice == 3 then
        saveState("SHOW_EVENTS_MENU", tostring(choice))
        showDragonNest()
        gg.setVisible(false)

    elseif choice == 4 then
        saveState("SHOW_EVENTS_MENU", tostring(choice))
        showTrainJourney()
        gg.setVisible(false)
    end
end

function eventsMenu()
    saveState("EVENTS_MENU", "0")

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🎉 إظهار الأحداث والفعاليات 🎉",
        "🔦 الرحلــــــة الاستكشافيــــــة",
        "🎮 المطابقة الثلاثية",
        "🧩 فعالية قلب المربعات",
        "☕ استراحة العمدة",
        "📋 واجبات العمدة",
        "🐸 فيض الهدايا",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    local choice = gg.choice(choices, nil, "🎉 الأحــــــــداث والفعاليــــــــات 🎉")
    if not choice then return end

    if choice == 1 then
        mainMenu()      
    elseif choice == 2 then
        showEventsMenu()     
    elseif choice == 3 then
        expEventMenu()
    elseif choice == 4 then
        match3Menu()
    elseif choice == 5 then
        flipTiles()
    elseif choice == 6 then
        breakMenu()
    elseif choice == 7 then
        applyAddFriend()
    elseif choice == 8 then
        ov_giftMenu()
    elseif choice == 9 then
        mainMenu()
    end
end

function cardsMenu()
    saveState("CARDS_MENU", "0")

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🎁 استلام الكروت",
        "➕ زيادة عدد الكروت",
        "📤 إرسال الكروت",
        "🚫 إلغاء إرسال الكروت",
        "➕️ زيادة عدد نجوم الحدث",
        "🔄 تبديل حدث الكروت",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    local choice = gg.choice(choices, nil, "قائمة الكــــــروت 🃏 :")

    if choice == nil then
        return
    elseif choice == 1 or choice == 8 then
        mainMenu()
    elseif choice == 2 then
        receiveCards()
    elseif choice == 3 then
        upCards()
    elseif choice == 4 then
        sendCards()      
   elseif choice == 5 then
        cancelSendCards()
   elseif choice == 6 then
        applyStars()       
   elseif choice == 7 then
        changeCards()
    end
end

function upgradableDecorsMenu(defaultChoice)
    local choices = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"}
    for _, item in ipairs(Decors) do
        table.insert(choices, "✨ " .. item.Name)
    end
    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local currentChoice = tonumber(defaultChoice) or 1
    saveState("PTR_MENU", tostring(currentChoice))

    local choice = gg.choice(choices, currentChoice, "الزينات المتطورة 💡 :")
    
    if choice == nil then 
        gg.setVisible(false)
    elseif choice == 1 or choice == #choices then 
        saveState("PTR_MENU", "0")
        mainMenu()
    else 
        saveState("PTR_MENU", tostring(choice))
        applyUnified(Decors[choice - 1])
        gg.setVisible(false)
    end
end

function skinsMenu(typeKey, defaultChoice)
    local keys = {"TRAIN", "HELICOPTER", "PLANE", "TRAIN_STATION", "HELICOPTER_PAD", "AIRPORT", "SHIP", "PORT", "COW", "CHICKEN", "SHEEP", "PIG", "ISLAND"}
    
    -- جزء القائمة بتاعت الاشكال
    if typeKey and typeKey ~= "0" then
        local currentChoice = tonumber(defaultChoice) or 1
        saveState("SKINS_SUB", typeKey .. "|" .. tostring(currentChoice))
        
        local subChoices = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"}
        for _, s in ipairs(skins[typeKey]) do table.insert(subChoices, s.name) end
        table.insert(subChoices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")
        
        local subChoice = gg.choice(subChoices, currentChoice, "اختر الشكل (" .. typeKey .. ")")
        
        if subChoice == nil then 
            gg.setVisible(false)
        elseif subChoice == 1 or subChoice == #subChoices then 
            saveState("SKINS_SUB", "0")
            skinsMenu(nil)
        else 
            saveState("SKINS_SUB", typeKey .. "|" .. tostring(subChoice))
            applySkins(skins[typeKey][subChoice - 1], typeKey)    
            gg.setVisible(false)
        end
        return
    end

    -- جزء القائمة بتاعت الأقسام 
    saveState("SKINS", "1")
    local choices = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة", "🚂 القطارات", "🚁 الهليكوبتر", "✈️ الطائرات", "🚉 محطة قطار", "?? مهبط هليكوبتر", "🛬 مطار", "🛥 سفينة", "⚓ ميناء", "🐄 بقرة", "🐔 دجاجة", "🐑 خروف", "🐖 خنزير", "🏝️ جزيرة", "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"}
    
    local choice = gg.choice(choices, nil, "المظاهر")
    
    if choice == nil then 
        gg.setVisible(false)
    elseif choice == 1 or choice == #choices then 
        saveState("SKINS", "0")
        mainMenu()
    else 
        saveState("SKINS", "0")
        skinsMenu(keys[choice - 1])
    end
end

function zienaMenu(section, sectionIndex, defaultChoice)
    local currentChoice = tonumber(defaultChoice) or 1
    saveState("Z_MENU", tostring(sectionIndex) .. "|" .. tostring(currentChoice))
    
    local choices = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"}
    for _, item in ipairs(section.items) do
        table.insert(choices, "💎 " .. item.name)
    end
    table.insert(choices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")

    local choice = gg.choice(choices, currentChoice, section.name)
    
    if choice == nil then 
        gg.setVisible(false)
    elseif choice == 1 or choice == #choices then 
        saveState("Z_MENU", "0")
        categoryMenu()
        else 
        saveState("Z_MENU", tostring(sectionIndex) .. "|" .. tostring(choice))
        applyUnified(section.items[choice - 1])
        gg.setVisible(false)
    end
end


function categoryMenu()
    local catChoices = {"⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"}
    for _, sect in ipairs(config) do table.insert(catChoices, sect.name) end
    table.insert(catChoices, "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة")
    
    saveState("CAT_SELECT", "0")
    local catChoice = gg.choice(catChoices, nil, "🌸 اقسام الزينات 🌸")
    
    if catChoice == nil then 
        gg.setVisible(false)
    elseif catChoice == 1 or catChoice == #catChoices then 
        saveState("MAIN", "0")
        mainMenu()
    else 
        local index = catChoice - 1
        saveState("Z_MENU", index)
        zienaMenu(config[index], index)
    end
end

function expEventMenu()
    saveState("EVENT_MENU", "0") 
    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "📖 إرشادات قبل الاستخدام",
        "✅️ إنجاز الحدث والحصول ع اللقب",
        "⏩️ تبديل الحدث",
        "🔄 إعادة ضبط الحدث",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }
    
    local choice = gg.choice(choices, nil, "🔦 قائمة حدث المغامرة 🔦")
    
    if not choice then
        saveState("EVENT_MENU", "0")

    elseif choice == 1 or choice == 6 then
        mainMenu()

    elseif choice == 2 then
    local msg = "📖 إرشادات قبل الاستخدام\n\n"
    msg = msg .. "استخدم الـ ID الصحيح عند تبديل الحدث.\n\n"
    msg = msg .. "📋 قائمة الأحداث الخاصة بتحديث 38.1.0:\n\n"

    
    local sortedEvents = {eve_searchs["Event 54"], eve_searchs["Event 55"], eve_searchs["Event 56"]}

    for _, v in ipairs(sortedEvents) do
        msg = msg .. "• " .. v.name .. "\n"
        msg = msg .. "ID : " .. v.id .. "\n\n"
    end

    gg.alert(msg)
    expEventMenu()


    elseif choice == 3 then
        finishEventMenu()

    elseif choice == 4 then
        local input = gg.prompt(
    {
        "ما هو الحدث الحالي الموجود ف مدينتك (ID):",
        "ما هو الحدث الذي تريد الانتقال إليه (ID):"
    },
    {"", ""},
    {"number", "number"}
)

        if input then
            changeEvent(
                tonumber(input[1]),
                tonumber(input[2])
            )
        else
            expEventMenu()
        end

    elseif choice == 5 then
        restartEvent()
    end
end

function ticketMenu()
    saveState("TICKET_MENU", "0")

    local choices = {
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة",
        "🎟 فتح التصريح",
        "🔄 تبديل التصريح",
        "📖 إرشادات قبل الاستخدام",
        "⬅️ عـــــــــــــــــــــــــــــــــــــــــــــودة"
    }

    local choice = gg.choice(choices, nil, "🎟 قائمة التصريح")

    if not choice then
        saveState("TICKET_MENU", "0")
    elseif choice == 1 or choice == 5 then
        mainMenu()
    elseif choice == 2 then
        applyTicket()
    elseif choice == 3 then
        local prompt = gg.prompt(
            {
                "ما رقم (ID) التصريح الذي تريد الانتقال إليه( راجع الإرشادات 📖 ):",
                "ما رقم (ID) التصريح الحالي الموجود بمدينتك( راجع الإرشادات 📖 ):"
            },
            nil,
            {
                "number",
                "number"
            }
        )

        if prompt then
            changeTicket(prompt[1], prompt[2])
        end
    elseif choice == 4 then
    local msg = "📖 تصاريح تحديث 37.0.2\n\n"

    for _, ticket in ipairs(tickets_id) do
        msg = msg .. "🎟 " .. ticket.name .. "    |    ID: " .. ticket.id .. "\n"
    end

    gg.alert(msg)
    ticketMenu()
    end
end


function mainMenu()
    saveState("MAIN", 0)
    local choices = {
    "【  🌸 الزيــــــــنات  】",
    "【  💡 زيــــــــنات متطــــــورة  】",
    "【  🏙 تطويــــــــــر المدينــــــــــة  】",
    "【 📦 مــــوارد الـمــــديــــنــــة 】",
    "【  🎟 التصريــــــح  】",
    "【  🎨 المظاهــــــــــــر  】",
    "【  🃏 الكــــــــــــروت  】",
    "【  🎉 الأحــــــــداث والفعاليــــــــات  】",
    "【 🤝 مساعدة الأصدقاء 】",
    "【  🔍 البــــحث الذكــــــــي  】",
    "【  ⚙️ نطاقات الذاكرة  】",
    "【  👨‍💻 مطــــورو الاسكريــــبت  】",
    "【  ❌ خــــــــــروج  】"
}
    
    local choice = gg.choice(choices, nil, "👑  القــــــــــــائمة الرئــــــــــــيسية  👑")
    if not choice then return end

    if choice == 1 then categoryMenu()
    elseif choice == 2 then upgradableDecorsMenu()
    elseif choice == 3 then developMenu()    
    elseif choice == 4 then resMainMenu()
    elseif choice == 5 then ticketMenu()
    elseif choice == 6 then skinsMenu()
    elseif choice == 7 then cardsMenu()
    elseif choice == 8 then eventsMenu()
    elseif choice == 9 then friendsMenu()
    elseif choice == 10 then searchByName()
    elseif choice == 11 then selectMemoryRange()
    elseif choice == 12 then 
        gg.alert(
"❤️ احمد ( دكتور ) ❤️   ❤️ كريم المصري ❤   ❤️ نور الماريا ❤️ ️\n\n" ..

"                              🦅  جروب الجزيرة  🦅"
)
        mainMenu()
    elseif choice == 13 then
        os.remove(stateFile) 
        gg.alert("👋🏼  مع السلامة ي عسل 👋🏼 ")
        os.exit() 
    end
end

function selectMemoryRange()

    local choice = gg.choice({
        "📌 نطاق Ca",
        "📌 نطاق O.Others",
        "📌 نطاق Ca + O.Others",
        "⬅️ رجوع"
    }, nil, "⚙️ تغيير نطاقات الذاكرة")

    if not choice then
        mainMenu()
        return
    end

    if choice == 1 then
        gg.setRanges(gg.REGION_C_ALLOC)
        saveMemoryRange("CA")
        gg.toast("✅ تم تفعيل نطاق Ca")

    elseif choice == 2 then
        gg.setRanges(gg.REGION_OTHER)
        saveMemoryRange("OTHER")
        gg.toast("✅ تم تفعيل نطاق O.Others")

    elseif choice == 3 then
        gg.setRanges(gg.REGION_C_ALLOC | gg.REGION_OTHER)
        saveMemoryRange("CA_OTHER")
        gg.toast("✅ تم تفعيل نطاق Ca + O.Others")

    elseif choice == 4 then
        mainMenu()
        return
    end

    mainMenu()
end
-- التشغيل الأولي المحدث
local range = loadMemoryRange()

if range == "CA" then
    gg.setRanges(gg.REGION_C_ALLOC)

elseif range == "OTHER" then
    gg.setRanges(gg.REGION_OTHER)

elseif range == "CA_OTHER" then
    gg.setRanges(gg.REGION_C_ALLOC | gg.REGION_OTHER)
end

while true do
    if gg.isVisible() then 
        gg.setVisible(false) 
        local s, i = loadState()
        
        if s == "Z_MENU" then 
            local p1, p2 = i:match("([^|]+)|(.+)")
            local idx = tonumber(p1)
            if not p1 then idx = tonumber(i) end 
            if idx and config[idx] then
                zienaMenu(config[idx], idx, p2)
            else
                categoryMenu()
            end
     
        elseif s == "SKINS" then 
            skinsMenu(nil)

        elseif s == "SKINS_SUB" then 
            if i ~= "0" then
                local p1, p2 = i:match("([^|]+)|(.+)")
                skinsMenu(p1 or i, p2)
            else
                skinsMenu(nil)
            end

        elseif s == "SUB" then 
            local idx = tonumber(i)
            if idx and config[idx] then
                zienaMenu(config[idx], idx, nil)
            else
                mainMenu()
            end
            
        elseif s == "MATCH3_MENU" then
           match3Menu(i)   
        
        elseif s == "CHAT_MENU" then
           chatMenu()
           
        elseif s == "FRIENDS_MENU" then
           friendsMenu()
    
        elseif s == "BREAK_MENU" then
           breakMenu() 
           
        elseif s == "RES_MAIN_MENU" then
           resMainMenu()  
           
        elseif s == "RES_SUB_MENU" then
           local p1, p2 = i:match("([^|]+)|(.+)")
           local idx = tonumber(p1)
           if not p1 then idx = tonumber(i) end

           if idx and resources[idx] then
              resSubMenu(idx, p2)
           else
              resMainMenu()
          end
          
        elseif s == "ORDER_MENU" then
           orderMenu(i)
           
        elseif s == "TRAIN_CLOVER_MENU" then
     trainAndCloverMenu(tonumber(index))
    
        elseif s == "DEVELOP_MENU" then
           developMenu()  
           
        elseif s == "OV_GIFT_MENU" then
           ov_giftMenu()   
    
        elseif s == "EVENTS_MENU" then
           eventsMenu()
    
        elseif s =="CARDS_MENU" then
           cardsMenu()  
 
        elseif s == "TICKET_MENU" then
            ticketMenu()
            
        elseif s == "PTR_MENU" then
            upgradableDecorsMenu(i ~= "0" and i or nil)

        elseif s == "CAT_SELECT" then
            categoryMenu()

        elseif s == "EVENT_MENU" then
            expEventMenu()
            
        elseif s == "SHOW_EVENTS_MENU" then
           showEventsMenu(i)

        elseif s == "SEARCH_MENU" then
            if i ~= "0" then
                local uInput, c = i:match("([^|]+)|(.+)")
                if uInput then searchByName(c, uInput) end
            else
                mainMenu()
            end
        else 
            mainMenu() 
        end
    end
    gg.sleep(200)
end